{
  "file_name": "2025-08-01_100809_email.html",
  "date": "2025-08-01",
  "subject_line": "Tariff man’s moment",
  "playbook_type": "national_playbook",
  "authors": [
    "Email Canada Playbook"
  ],
  "sponsor": "TikTok Canada",
  "text": "Aug 01, 2025\nView in browser\n\n By Nick Taylor-Vaisey\n\n Presented by \n\nSend tips | Subscribe here | Email Canada Playbook | Follow Politico Canada\nThanks for reading Canada Playbook. TGIF.\nIn today’s edition:\n→ Trump dropped the hammer. What happens next?\n→ The deal-or-no-deal moment for Canada.\n→ Canada Playbook will not publish Monday. We’ll see you on Tuesday.\n\nTrade war\n\nPresident Donald Trump signed executive orders on Thursday evening to impose tariffs of between 15 and 41 percent on goods shipped to the U.S. from more than 67 countries. | Chip Somodevilla/Getty Images\n\nTHE BIG DAY — Today marks the two-year anniversary of Meta's landscape-altering decision to block Canadian news links on Facebook and Instagram.\nWhy, what else is on the agenda?\nOh, right, that.\n— Tariff man strikes back: Trade watchers around the world — which is just about everybody these days, one way or another — are absorbing DONALD TRUMP's latest trade gambits.\nThe president slapped a 35 percent tariff, effective today, on Canadian imports not covered by the United States-Mexico-Canada Agreement. (Most imports are covered by the USMCA.)\nAn executive order posted late Thursday, ostensibly to \"address the flow of illicit drugs across our northern border\" — aka fentanyl — made it official.\n— The word from 1600: A senior White House official told POLITICO last night that Canadians “haven’t shown the same level of constructiveness that we’ve seen from the Mexican side.”\nIn other words: No new security and trade deal with the northern neighbor. Not yet.\n— The PM responds: Twenty-three minutes after midnight, Prime Minister MARK CARNEY posted a page-long statement on X. He indicated that the USMCA shield means the average U.S. tariff on a Canadian import \"remains one of its lowest for all of its trading partners.\"\nCarney repeated his government's insistence that fentanyl isn't flowing over the border in large quantities. He reiterated efforts to cut interprovincial trade barriers and build \"nationbuilding\" projects in Canada's interest. No drama. No punches thrown.\nPLUS ÇA CHANGE — The president repeated his grievances about Canada from behind a White House lectern after an unrelated announcement on Thursday afternoon.\nTrump focused his ire on the ag sector and his northern neighbor's lackluster defense spending. No mention of fentanyl, but plenty of claims that Canadians are unfair: \"They want a lot of things from our country. And for years, we did it.\"\nTrump said a call came in from Carney on Thursday, but the two didn't speak. Carney's office didn't reply to Playbook's request for confirmation of that outreach.\n— Second opinion: Earlier in the day, Commerce Secretary HOWARD LUTNICK told Fox's LARRY KUDLOW that Canada's plan to recognize a Palestinian state was \"tone deaf.\"\nHe reminded Kudlow with a smirk that only Canada and China retaliated against American tariffs earlier this year. \"I just don't see the president stepping off the gas now,\" Lutnick said, unless Carney changes tack.\n\"If he starts turning on the charm, and if he takes off his retaliation … and stops the silliness, maybe the president will let it down a bit.\"\nOtherwise, Lutnick concluded, the levying of 35 percent tariffs \"is surely in the cards.\"\nFact-check: True.\n— Captain Canada: Ontario Premier DOUG FORD was undeterred by the straight line the commerce secretary drew from retaliation to new tariffs.\n\"Now is not the time to roll over. We need to stand our ground,\" Ford posted on X, pushing for countertariffs on steel and aluminum.\nTHE BIG QUESTION — Can DOMINIC LEBLANC and KIRSTEN HILLMAN still eke out a deal with the American side?\nPOLITICO’s DANIEL DESROCHERS, BEN LEFEBVRE and DOUG PALMER point out that Trump’s dealmaking has left behind a trail of ambiguity — scant specifics, few written agreements and even fewer lasting outcomes.\n— Maybe the biggest question: What's a \"deal\" even worth?\n\nA message from TikTok Canada:\nCanadian small business is booming on TikTok. Over 613,000 businesses, like Canada’s first hybrid semi company, Edison Motors, use TikTok. In 2024, TikTok’s local operations and SMB activities contributed $2.3billion to Canada’s economy and supported 19,250 FTEs. TikTok's role in Canada’s SMB economy is big - and their local team supports those entrepreneurs. With a new government in place, we can find a Canadian solution to prioritize security and keep TikTok’s local jobs in place. www.tiktokcanada.ca\n\nPROZONE\n\nFor POLITICO Pro subscribers, here’s our latest trade news: \n— White House indicates Trump may not extend deadline for China talks.\n— Tariff panic in Canada inspires USMCA paperwork rush.\n— Trump’s tariffs get frosty reception at federal appeals court.\n— EU expects US tariff commitments by Friday.\n— Trump extends Mexico tariff deadline for 90 days.\nAnd our latest policy newsletter: Up against a deadline.\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nTHE ROOMS THAT MATTER \n\n— The PM has not released his schedule.\n\nWHO'S UP, WHO'S DOWN\n\nUp: Google searches for \"katy perry justin trudeau\" after, well, you probably heard.\nDown: The square footage of the ballot in the upcoming Battle River-Crowfoot federal by-election, following Elections Canada's decision to make it a write-in contest.\nWant more POLITICO? Download our mobile app to save stories, get notifications on U.S.-Canada relations, and more. In \niOS\n or \nAndroid\n.\n\nA message from TikTok Canada:\n\nFor your radar\n\nMORNING MONEY: CAPITAL RISK — POLITICO’s flagship financial newsletter has a new Friday edition built for the economic era we’re living in: one shaped by political volatility, disruption and a wave of policy decisions with sector-wide consequences. Each week, Morning Money: Capital Risk brings sharp reporting and analysis on how political risk is moving markets and how investors are adapting. Want to know how health care regulation, tariffs, or court rulings could ripple through the economy? Start here.\n\nMORNING MUST-CLICKS\n\n— LEAH BORTS-KUPERMAN of The Narwhal reports that Canada's Department of National Defence plans to build new Armed Forces housing units in locations listed on the federal government’s inventory of contaminated properties.\n— “We just couldn’t stand on the sidelines,” Artificial Intelligence and Digital Innovation Minister EVAN SOLOMON tells Toronto Life of his decision to enter politics.\n— “Bad bill meets good and necessary debate. Things will get spicy,” national security expert WESLEY WARK tells CARMINE STARNINO of The Walrus in a Q&A on Bill C-2.\n— POLITICO’s ADAM WREN writes on JOE BIDEN’s life after the White House: “He’s staffed by only one or two aides and a small Secret Service detail. He holes up for hours at a time in Delaware working on his memoir with a new ghostwriter, while undergoing treatment for an aggressive form of prostate cancer.”\n— The Macdonald-Laurier Institute published an ANDREW MACDOUGALL longread: \"Dismantling the attention economy: How the battle for attention is killing the traditional news media and eroding the foundations of Western democracies.\"\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nPLAYBOOKERS\n\nBirthdays: HBD to Sen. WANDA THOMAS BERNARD, Crestview partner ROB MOORE and McMillan Vantage managing director RICHARD MAHONEY.\nSaturday: Transport and Internal Trade Minister CHRYSTIA FREELAND, U.N. Ambassador BOB RAE, Ontario Transport Minister PRABMEET SARKARIA.\nSunday: ALEXANDRA VALCOUR of Proof Strategies, former NDP MP DAN HARRIS and ex-Quebec MNA SYLVAIN ROY.\nMonday: Former Newfoundland and Labrador Premier DANNY WILLIAMS.\nNoted: The Public Policy Forum published a new report on bolstering local coverage of national elections. First recommendation: creating a nonpartisan election coverage fund, a philanthropically funded endowment to be distributed among smaller outlets.\nFrom the ethics files: Energy and Natural Resources Minister TIM HODGSON declared two free tickets to the Calgary Stampede Rodeo gifted to him by former interim Conservative Leader RONA AMBROSE and partner J.P. VEITCH.\nMovers and shakers: ÉTIENNE-ALEXANDRE BEAUREGARD, a former speechwriter and strategic planning adviser for Quebec's Cabinet, has joined the research team at Cardus.\nMedia mentions: This is the first day of post-CBC life for longtime broadcaster MARK CONNOLLY.\nSend Playbookers tips to \ncanadaplaybook@politico.com\n\nA message from TikTok Canada:\nCanada’s economy runs on small businesses. TikTok helps drive them. More than 613,000 Canadian small businesses use TikTok to make sales, reach customers and innovate.\n\n One of them is hybrid-electric semi-truck company, Edison Motors—now valued at $200 million and manufacturing trucks in Golden, BC. From raising capital to building a network of suppliers, Edison used TikTok to reach millions of supporters, and scale-up quickly.\n\n SMBs like Edison Motors are supported by the work of a local TikTok Canada team. Unfortunately, this team's existence is at risk as the federal government has ordered TikTok to shutdown its Canadian offices.\n\n From 2019-2024, TikTok Canada’s operations produced an estimated $1.4 billion in GDP for the Canadian economy and supported approximately 9,000 FTEs. Why destroy that support and economic investment?\n\n With a new government in place, now is the time to find a made-in-Canada solution—one that protects security and our economy. Explore www.tiktokcanada.ca\n\nLOBBY WATCH\n\nOur daily check-in on federal lobbyist registrations and notable meetings around town:\n— North Atlantic Refining Ltd., which operates the Braya Renewable Fuels refinery in Come By Chance, Newfoundland and Labrador, logged recent meetings with senior political staff at the Department of Finance, Intergovernmental Affairs, Environment and Climate Change, Natural Resources and Industry.\n\nTRIVIA\n\nThursday’s answer: Canada’s first Department of External Affairs office opened on June 1, 1909, in downtown Ottawa above a barber shop.\nProps to ROBERT MCDOUGALL, ELIZABETH BURN, RAY DEL BIANCO, PATRICK JUNEAU, GORDON RANDALL, RODDY MCFALL, SHAUGHN MCARTHUR, JOHN PEPPER, KEVIN DEN HEIJER, JOHN MERRIMAN, MARCEL MARCOTTE, MALCOLM MCKAY, JENN KEAY and MARC SHAW.\nFriday’s question: In 2023, the Government of Manitoba passed legislation officially declaring LOUIS RIEL to be the province’s first premier. What happened to the Métis leader on this date in history?\nSend your answer to \ncanadaplaybook@politico.com\n\nWriting Tuesday’s Playbook: SUE ALLAN.\nCanada Playbook would not happen without: Canada Editor Sue Allan, editor Willa Plank and POLITICO’s Grace Maalouf.\n\nFollow us on X\n\nSue Allan @susan_allan\nMike Blanchfield @ @mblanchfield\nMickey Djuric @MickeyDjuric\nZi-Ann Lum @ziannlum\nNick Taylor-Vaisey @TaylorVaisey\nPOLITICO Canada @politicoottawa\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Canada Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}