{
  "file_name": "2025-08-01_110137_email.html",
  "date": "2025-08-01",
  "subject_line": "Adams’ registration reverie",
  "playbook_type": "new_york_playbook",
  "authors": [
    "Jeff Coltin",
    "Nick Reisman",
    "Emily Ngo"
  ],
  "sponsor": "New Yorkers For Affordable Groceries",
  "text": "Aug 01, 2025\nView in browser\n\n By Joe Anuta, Jeff Coltin and Nick Reisman\n\nPresented by New Yorkers For Affordable Groceries\n\nWith help from Amira McKee\n\nNew York City Mayor Eric Adams announced his re-election campaign on the steps of City Hall days after Zohran Mamdani won the Democratic nomination. | Michael M. Santiago/Getty Images\n\nMayor Eric Adams is banking on a massive voter registration drive to pull off a comeback for the ages in the November general election.\n“We're going to register a million new voters,” he said in July on the Mo News podcast, one of several times he’s floated the idea. “And we're going to motivate those voters that know our city is moving in the right direction.”\nThe mayor’s plan is, to put it mildly, farfetched.\nAn analysis of the 2024 general election from the Campaign Finance Board found 85.5 percent of eligible voters were already registered, leaving roughly 800,000 people who could theoretically be added to the rolls.\nStats from the voter data firm L2, on the other hand, show there are 1.6 million New Yorkers over the age of 18 who aren’t registered to vote — a potential roadmap for the incumbent’s efforts. But a chunk of those people are likely ineligible on account of their citizenship status.\nThen there are the practical considerations.\n“Outside of it being impossible mathematically, which is true, it’s also impossible physically from a tactical standpoint,” said a Democratic consultant unaffiliated with any mayoral campaign, who was granted anonymity to frankly discuss campaign strategies.\nAs a point of comparison, a pair of nonprofits started by Georgia Democrat Stacey Abrams spent north of $30 million over the course of 2020 on voter outreach and a registration drive that saw the rolls increase by 800,000 statewide.\nAnd in the New York City Democratic mayoral primary, The New York Times found a spike of roughly 37,000 people who registered in the two weeks before June 24, which the paper attributed to excitement behind Zohran Mamdani’s winning primary campaign.\nIn the case of the general election, there are roughly three months to go. Adams has just $4.2 million in his war chest. He will undoubtedly raise more cash and hopes to unlock millions more in public matching funds. But he will need to spend it on expenses that provide a bigger bang for his buck.\nThe idea that all — or even most — of the city’s unregistered voters would support Adams is also unlikely. A recent poll from Public Progress Solutions and Zenith Research, which surveyed registered voters, showed Adams’ job approval and favorability ratings both hovering around 16 percent.\nThat means Adams would be providing at least some help to his opponents by bringing more voters into the fold.\nCampaign spokesperson Todd Shapiro told Playbook the mayor hopes to register as many voters as possible through digital channels and in-person outreach at community events and houses of worship.\n“His goal to register 1 million voters reflects a broader mission: to engage communities that have too often been left out of the political process,” Shapiro said in a statement.\nHe added that the registration efforts are part of a strategy that includes winning over the 2.5 million Democrats who did not vote in the primary and the 1 million independents eligible to vote in the general election by yoking the mayor’s tenure to New York City’s comeback from Covid.\n“The campaign is just getting started,” he added. “But as more New Yorkers hear the mayor’s message and see the results of his leadership in their own neighborhoods, we’re confident they’ll join this movement.” — Joe Anuta\nHAPPY FRIDAY: Got news? Send it our way: Jeff Coltin, Emily Ngo and Nick Reisman.\nWHERE’S KATHY? In New York City, making a transportation announcement.\nWHERE’S ERIC? Schedule unavailable as of 10 p.m. Thursday.\nQUOTE OF THE DAY: “I just feel like I was heading toward generational wealth and now I’m heading toward generational debt.” — Coss Marte, owner of ConBud, one of the cannabis shops that may have to move for being too close to schools, via Gothamist.\n\nA message from New Yorkers For Affordable Groceries:\nA staggering 85% of New Yorkers say food costs are outpacing their income — and it’s about to get worse. City Council Int 1135 could raise the cost of grocery deliveries by $10 or more per order and block thousands of delivery workers from earnings opportunities. Mayor Adams: Say NO to higher grocery delivery costs and NO to making New York even less affordable for working families. Veto the City Council’s devastating grocery delivery bill. Learn more at groceryaffordability.nyc.\n\nABOVE THE FOLD\n\nA new poll shows Zohran Mamdani performing better with Jewish voters in New York City than any other mayoral candidate. | Michael M. Santiago/Getty Images\n\nJEWS FOR ZOHRAN: Jewish voters in New York City prefer Mamdani to any other mayoral candidate — but 58 percent say they’re concerned the city will become less safe for Jews if he’s elected mayor.\nThat’s according to a new poll of 800 Jewish registered voters commissioned by New York Solidarity Network, a Jewish civic organization whose leadership strongly opposed Mamdani in the primary and campaigned against him.\nAsked who they’d support in the general, Mamdani gets 37 percent, followed by Adams at 25, Andrew Cuomo at 21 and GOP nominee Curtis Sliwa at 14. The Zenith Research poll released earlier this week also showed Mamdani leading the field while failing to win a majority of Jewish support.\nAsked how Mamdani could help Jews as mayor, 85 percent said it was important to maintain police presence outside synagogues on high holidays, and 59 percent said it was important to oppose boycott, divestment and sanctions efforts.\nNew York Solidarity Network Executive Director Sara Forman said the poll was meant to take the temperature of the Jewish community after Mamdani’s win, and she hopes the Democratic nominee would use the poll “to address the very salient concerns of the community.”\n\nForman and Solidarity PAC, which is aligned with NYSN, endorsed Cuomo and encouraged supporters not to rank Mamdani. She said the PAC hasn’t made any decisions for the general election.\n“Zohran holds the support of thousands of Jewish New Yorkers who trust him to make this city more affordable and to protect their safety. They’re also tired of seeing Jewish suffering be cynically exploited for personal gain from the likes of Andrew Cuomo and Eric Adams,” Mamdani spokesperson Jeffrey Lerner responded in a statement. “Zohran remains committed to meeting with Jewish elected officials and community leaders, and hearing from Jewish New Yorkers directly in the coming months.\"\nThe poll was conducted by both phone interviews and text-to-web from July 15 to 24 by GQR, whose senior partner Anna Greenberg crafted the questions. It had a margin of error of 3.5 percentage points. — Jeff Coltin\n\nStay ahead of Canada’s political transformation. Canada is at a pivotal moment — with big implications for U.S. interests, global trade and the future of its political leadership. Canada Playbook is your must-read guide to the key players, power struggles and policy shifts shaping this new era. Delivered straight to your inbox. Sign up here.\n\nCITY HALL: THE LATEST\n\nLeo Namuche, a cat, is a write-in candidate for New York City Council District 30 in Queens, meant to be an alternative to two conservative candidates on the general election ballot. | Raquel Namuche Pacheco\n\nGETTING CATTY:  Mamdani won 56 percent of the vote in City Council Member Bob Holden’s district — but the Democrat vying to replace the term-limited member has pledged to follow in the incumbent’s conservative “Common Sense” footsteps.\nSo has Republican Alicia Vaichunas — because she and Democrat Phil Wong both work for Holden.\nIt’s too late for the democratic socialist-loving majority of Dems in the Central Queens district to field a more lefty challenger, so one organizer is starting a write-in campaign for Leo Namuche, her cat.\n“Today Leo Namuche, a lifelong Ridgewood resident and self-appointed community leader, announces his run for the open District 30 City Council seat,” Leo posted on Instagram Monday. “He has now set his sights on local politics and dismantling the conservative chokehold Robert Holden has held on the district.”\nThe campaign is run by Raquel Namuche Pacheco, an organizer with the Ridgewood Tenants Union. Democrats in the district’s southern side in Ridgewood gave Mamdani some of his largest winning margins in the city. — Jeff Coltin\nMore from the city:\n— Fewer Black and Hispanic students were admitted to New York City’s elite public high schools this year. (POLITICO Pro)\n— Outdoor dining is mostly for rich neighborhoods again, thanks to new city rules. (Hell Gate)\n— A man pleaded guilty in a fraud scheme linked to a lawsuit naming a firm founded by Adams adviser Frank Carone (Daily News)\n\nA message from New Yorkers For Affordable Groceries:\n\nNEW FROM PLANET ALBANY\n\nGov. Kathy Hochul speaks during the MTA Board's monthly meeting at Grand Central Madison in New York City. | Michael M. Santiago/Getty Images\n\nGOING YOUR WAY: Gov. Kathy Hochul and Democratic state lawmakers want voters to know they’re just as annoyed with the Metropolitan Transportation Authority as New Yorkers are.\nPower problems during one of the hottest weeks of the summer, combined with potential fare hikes, has led to increased frustration among elected officials.\nHochul on Tuesday said “New Yorkers deserve better” after power problems at West 4 Street impacted straphangers.\nWhile she insisted millions of dollars have been leveraged to upgrade mass transit infrastructure, more needs to be done.\n“New Yorkers can’t wait years for more resilient service; I’ve directed the MTA to undergo a full review of this week’s issues to prevent similar outages in the future,” Hochul said. “I will always stand with our subway riders to ensure they have safe, reliable service.”\nThe governor, a year out from her reelection campaign, certainly wants to avoid another so-called “summer of hell” when subway breakdowns plagued riders and the then-Cuomo administration.\nFurthering the agita, though, is a proposed fare hike that has suburban Democrats in revolt. The Westchester and Long Island suburbs are potential swing areas for the party as Republicans are already signaling they’ll campaign on the controversial congestion pricing toll program. The tolls are supposed to help the MTA upgrade its infrastructure, and fare hikes won’t help Democrats facing reelection in 2026.\n“Regular New Yorkers and businesses are paying through the nose in order to subsidize the huge transit agency,” state Sen. Peter Harckham said. “The MTA is fast becoming part of the affordability problem and not the solution.” — Nick Reisman\nMore from Albany:\n— Mamdani missed session more than any other Democrat, even skipping the day his one bill passed. (Times Union)\n— The Plattsburgh town supervisor is being eyed as a potential replacement for Assemblymember Billy Jones. (Spectrum News)\n— A proposal to allow mid-decade redistricting would still prohibit partisan gerrymandering. (City & State)\n\nPlaybook isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nKEEPING UP WITH THE DELEGATION\n\nRep. Mike Lawler told Playbook he isn't concerned about New York Democrats' push for mid-decade redistricting. | Francis Chung/POLITICO\n\nDON’T WORRY: Vulnerable House Republicans aren’t sweating New York Democrats potentially conducting a mid-decade round of redistricting.\nRep. Mike Lawler told Playbook there’s very little for the GOP to prepare for since Republicans expect any legal challenge would quickly put the kibosh on any effort to change the lines before 2032 as mandated by the state constitution.\n“Obviously we would be prepared to go to court,” he said.\nLawler’s Hudson Valley House seat has long been eyed by Democrats. The redistricting talk, though, isn’t bothering him.\nThere are no clear ways New York Democrats could draw new lines even as the issue — fueled by red states like Texas and Ohio engaging in mid-decade map drawing — has spurred Hochul to assess options with House Minority Leader Hakeem Jeffries.\n“What’s their legal pathway for a court to intervene?” Lawler said. “There’s really nothing they could do.” — Nick Reisman\nMore from Congress:\n— The complex fight over redistricting, in part, can be traced back to the Cuomo era. (Gothamist)\n— Gen Z candidate Liam Elkind said he raised more than $340,000 in his first day running against Rep. Jerry Nadler. (The Hill)\n—  Rep. Josh Riley wants hearings on utility rate hikes. (Spectrum News)\n\nNEW YORK STATE OF MIND\n\n— Supporters of The Coney casino bid in Coney Island made its pitch — and got some real pushback. (Casino Reports)\n— The Department of Justice is calling for a delay in a settlement stemming from the state’s homecare transition. (POLITICO Pro)\n— New York’s public media organizations will lose $57 million over the next two years due to federal cuts. (New York Focus)\n\nA message from New Yorkers For Affordable Groceries:\nFor countless New Yorkers, grocery delivery isn’t a convenience—it’s a lifeline. Grocery delivery makes it possible for seniors and low-income families in food deserts to access fresh, affordable food.\n\n Recent budget cuts in Washington will soon cut SNAP benefits for more than 300,000 households in New York, creating a crisis that will devastate the most vulnerable communities. At a time when 85% of New Yorkers say food costs are outpacing their income, City Hall must focus on policies that will reduce the cost of groceries.\n\n Instead, the City Council just passed an extreme bill that could make New York even less affordable for hardworking families. If signed, it will make it harder for individuals living in food deserts and SNAP families to access nutritious food, but also eliminate earnings opportunities for workers. That’s a cost New Yorkers simply can’t afford.\n\n Mayor Adams: Say NO to Int. 1135.\n\nhttps://www.groceryaffordability.nyc/\n\nSOCIAL DATA\n\nEdited by Daniel Lippman\nIN MEMORIAM:Montgomery County Legislator Dan Wilson died in a plane crash Wednesday at 77. (WRGB)\nMAKING MOVES: James Christopher has left his roles as communications director for Assemblymember Rodneyse Bichotte Hermelyn and the Brooklyn Democratic Party to start his own firm, James Christopher Public Relations.\nHAPPY BIRTHDAY: State Sen. Jeremy Cooney … former U.S. Sen. Al D’Amato … Agudath Israel of America’s Yeruchim Silber … former Assemblymember Nick Perry … the MLB’s Hudy Rosenberg … Kevin Wolfe of the Center for NYC Neighborhoods … Brendan Sexton of the Independent Drivers Guild … Bianca Seidman … NYT’s Joe Coscarelli and Dana Goldstein … Hillspire’s Chai Jindasurat-Yasui ... Letitia James' press secretary Alexis Richards.\nMissed Thursday’s New York Playbook PM? We forgive you. Read it here.\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Canada Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}