{
  "file_name": "2025-08-01_105927_email.html",
  "date": "2025-08-01",
  "subject_line": "A tale of two swing districts",
  "playbook_type": "national_playbook",
  "authors": [
    "Matt Friedman"
  ],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Matt Friedman\n\nGood Friday morning! \nIn Central Jersey’s 7th District, where Democrats hope to oust Republican Tom Kean Jr., eight candidates have filed with the Federal Election Commission, and more are probably on the way.\nThe latest is Valentina Mendoza, a lawyer from Rahway who says she can stick out in a field of mostly conventional candidates. Mendoza, who’s transgender, described herself as “somebody who can speak towards the challenges that people can face, the multiple intersectional identities that I represent.”\n“I can make policy from somebody who has lived those consequences — not only survived them but thrived,” she said.\nAnd I was saving this for today, but David Wildstein beat me to the punch: Megan O’Rourke, a former USDA climate scientist in the Biden administration, has recently met with Democratic operatives and leaders about potentially running. O’Rourke wrote on LinkedIn a couple months ago that her job duties under the Trump administration had been “stripped away one by one until I had no work left to do” and that she ultimately decided to take the Deferred Resignation Program. While I’ve heard one operative describe O’Rourke’s entrance as very likely, when I checked earlier this week, not all of the district’s county chairs had heard from her. She didn’t respond to a LinkedIn message I sent her Monday morning. See here for the list of candidates so far and how much they’ve raised.\nFurther north in the 9th District, Republicans have been making a lot of noise about the Hispanic rightward shift in the 2024 election. There, Donald Trump carried the heavily Hispanic district, and freshman Democrat Nellie Pou beat three-time Republican candidate Billy Prempeh by just 4 points. Kean won reelection by a larger margin in the 7th. But so far, aside from Prempeh, just one other candidate has emerged: Clifton Councilmember Rosemary Pino. Prempeh — who has a significant online following despite his struggles to raise money — hit her with pretty devastating criticism about a group she led endorsing Pou just last year.\nSo what should we make of this? Noting the crowded Democratic field in the 7th, National Republican Congressional Committee Executive Director Jack Pandal said: “Dem recruitment in absolute shambles.” And it does look like a potentially messy primary. \nBut the number of candidates running so far in the Democratic-held swing district could also be read as a measure of enthusiasm, especially compared to the 9th District. Several of these candidates have already demonstrated an ability to raise a lot of money.\n\nFEEDBACK? Reach me at mfriedman@politico.com\nSHOW ME THE WAY: Acting Gov. Tahesha Way is in Sea Girt at 10 a.m. for the New Jersey State Police Youth Week graduation ceremony\nQUOTE OF THE DAY: “Maybe he doesn't agree with your standards because he knows that you're a snake.” — Toms River Councilmember Tom Nivison to Mayor Dan Rodrick, while arguing about new police hiring standards \nHAPPY BIRTHDAY — John Amodeo, Jenna Mellor,  Michael Suleiman. Saturday for Paul Kanitra, Bill Pascrell III, Bridget Palmer, Michael Dressler, Angel Fuentes, Janice Kovach, Kaylee McGuire. Sunday for Brian McDonough, Marc Pfeiffer, Peggy Ackermann, Chris Brown, Julia Fah\n\nStay ahead of Canada’s political transformation. Canada is at a pivotal moment — with big implications for U.S. interests, global trade and the future of its political leadership. Canada Playbook is your must-read guide to the key players, power struggles and policy shifts shaping this new era. Delivered straight to your inbox. Sign up here.\n\nWHAT TRENTON MADE\n\nFROM A KINK TO THE CLINK — “Sex, greed & fraud: He stole $5 million to pay for sex. It could cost him his life,” by NJ Advance Media’s Karin Price Mueller: “[Harry] Pizutelli had faced physical challenges all his life. Spina bifida was supposed to kill him by age 16. The leg braces he uses to hurl his five-foot frame around are uncomfortable, but allow him to walk … But there was one thing Pizutelli couldn’t get over: His sex life was practically nonexistent … So he called the massage parlor and set up what would become the first of many trysts, the starting point for a toxic relationship that would last 10 years and cost the state of New Jersey nearly $5 million. Pizutelli stole millions from a government fund that helps victims of traumatic brain injury. The state worker funneled it to the masseuse he met that day in 2005, to her close friend and to six other women Pizutelli hired for sex acts. He doesn’t deny any of it. But this wasn’t a typical sex-for-money racket. It’s the story of a man desperate for physical intimacy who followed his lust into a criminal spiderweb. The story of a man who made one fateful decision that snowballed into a series of disastrous choices that forever changed his life. And the story of a man with physical limitations who stole from others with limitations to pay for illicit sex.”\nHOW DOES IT FEEL? — “A lesson in labor from Wayne DeAngelo: 'If you don't like it, leave,’” by InsiderNJ’s Max Pizarro: “Assemblyman Wayne DeAngelo of Mercer County, lawmaker and labor leader … wants the next governor to not just support project labor agreements (PLAs) but to be the state's strongest public bulwark against corporations that would try to locate here without employing Building Trades labor. New Jersey has considerable problems, including energy deficits produced in part by a wind initiative that went bust because of politics, a federal budget that disincentivizes solar and renewable energy, and the expansion of population and artificial intelligence putting tremendous demands on the grid. But none of those problems can be fixed without the simultaneous support for labor coming out of Drumthwacket, DeAngelo maintains — and the future of labor in the form of public incentivizing real trades opportunities for New Jersey youth … Democrat DeAngelo, for his part, is aware of the erosion of support by rank-and-file labor workers for the Democratic Party, even though President Joe Biden prioritized projects like the Gateway Tunnel, which former Republican Governor Chris Christie killed. Biden was a good president for labor, the assemblyman acknowledges, and specifically to the trades. 'But as a blue-collar person and as a person who goes door to door and talks to people, I recognize that a lot of people — most, in fact, are exhausted and they don't know the name of their local councilman or county executive or what they do. They don't know what the president is doing, in many cases. Unfortunately, within that environment, Biden, during the second half of his presidency, was not the same guy.'”\n— “Driver charged with vehicular homicide in crash that killed N.J. governor’s staffer, prosecutor says” \n— “Victims of sex abuse in New Jersey’s juvenile lockups demand justice” \n— “Solid year for NJ state pension fund despite market volatility” \n— “Sherrill: New Jersey's transit systems aren't working. I'll change that” \n— “Ciattarelli: Transportation is too expensive in NJ. We must fix it” \n— “NJ launches rape kit tracking system for sexual assault survivors”\n\nTRUMP ERA\n\nETERNAL U.S. ATTORNEY ALINA HABBA ANNOUNCES INVESTIGATION INTO FDU — Trump 18 points underwater in New Jersey, poll finds, by POLITICO’s Matt Friedman: Despite a closer-than-expected margin in New Jersey last year, New Jersey voters have soured on President Donald Trump, according to poll numbers released Thursday. Thirty-seven percent of likely voters surveyed by Fairleigh Dickinson University said they approve of Trump’s job performance, while 55 percent disapprove. The numbers could be sobering for Republicans who saw Trump’s relatively narrow 6-point loss of New Jersey in November as a sign that the state could be trending red thanks to the president’s inroads with the state’s Hispanic communities, and whose hopes were further buoyed by a recent poll that showed voters there split evenly on the president … “Last year’s Presidential election was much closer than anyone was expecting in New Jersey,” said Dan Cassino, executive director of the FDU poll. “But if Trump had the opportunity to turn that into lasting support in the state, it seems to be gone now.”\nHABBA — Criminal defendant challenging Alina Habba’s appointment takes a page from Aileen Cannon’s playbook, by POLITICO’s Ry Rivard and Kyle Cheney: A criminal defendant seeking to torpedo President Donald Trump’s top federal prosecutor in New Jersey is drawing inspiration from an unusual source: U.S. District Judge Aileen Cannon. The defendant, Julien Giraud Jr., argues that the Trump appointee’s bombshell ruling last summer dismissing a federal criminal case against Trump by finding that special counsel Jack Smith’s appointment was unconstitutional applies equally to Trump’s temporary U.S. attorney pick, Alina Habba. Giraud’s attorney Thomas Mirigliano says the workaround Trump used to keep Habba in place after a 120-day interim appointment expired directly conflicts with Cannon’s ruling. “As Judge Cannon explained in Trump, when executive officials deliberately engineer an appointment in violation of statutory and constitutional mandates, the only effective remedy is dismissal or, at the very least, disqualification of the unconstitutionally appointed officer and her subordinates,” Mirigliano wrote in a filing Wednesday. Mirigliano’s bid is a long shot, meant to spare his client from further prosecution for gun and drug crimes that were brought by a grand jury and filed in 2024 when there was no uncertainty about the leadership of the U.S. attorney’s office. But it’s one of the first efforts to turn Cannon’s ruling against the Trump administration’s interests.\nNADONE — A federal judge on Thursday rejected a long shot attempt by the wife of former Sen. Bob Menendez to have all the corruption convictions against her thrown out. In a 51-page ruling, U.S. District Court Judge Sidney Stein said Nadine Menendez “failed to identify any injustice — let alone a manifest injustice — requiring a new trial.” He did, however, toss one count he found duplicative.\nNadine Menendez, who was found guilty in a trial separate from her husband, is scheduled to be sentenced on Sept. 11. Bob Menendez and a pair of businesspeople accused of bribing the couple are all in prison and each is appealing their conviction.Nadine Menendez is also planning an appeal. She is expected to argue that she was denied the ability to pick who represented her in court because prosecutors had discussed calling her previous attorneys from Schertler Onorato as part of their obstruction of justice charges, but ultimately the attorneys were never called. “The government violated Mrs. Menendez’s fundamental constitutional right to counsel, and we are confident that the Second Circuit will engage with this issue,” her attorney, Sarah Krissoff of Cozen O'Connor, said in a statement. — Ry Rivard\n— “Vote on blocking weapons for Israel divides New Jersey’s senators”\n— “Trump moves to ensure no new offshore wind projects get proposed for years to come”\n\nPlaybook isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nLOCAL\n\nMODELO CITIZENS — “N.J. town threatened to revoke housing for non-citizens, former employee’s lawsuit says,” by NJ Advance Media’s Anthony G. Attrino: “Elected officials in a Monmouth County town have tried to require renters to submit proof of U.S. citizenship or face removal from their homes, a lawsuit filed by the former township manager alleges. Joseph Clark, who served as Howell Township manager for two years, claims in court papers Mayor John Leggio and Councilman Ian Nadel proposed ordinances and directives that were racist and illegal. One directive included identifying migrants who entered the country illegally, and revoking the certificates of occupancy for their rentals, Clark alleges in a lawsuit filed in Monmouth County Superior Court. The lawsuit claims officials encouraged racial profiling, such as monitoring recycling bins for Modelo beer bottles as a way to identify undocumented residents. … When Clark, the deputy town manager, and other officials objected to the allegedly discriminatory behavior, they were retaliated against, the lawsuit claims.”\nMONTCLAIR PEOPLE'S COMMISSARIAT FOR EDUCATION TO DEVELOP FIVE-YEAR DEBT PLAN — “Montclair public schools reveal $11 million deficit’,” by Montclair Local’s Matt Kadosh and Asad Jung: “The Montclair Public Schools face an $11 million deficit, school officials said on Wednesday as residents called for a forensic audit of the district’s finances. Superintendent Ruth B. Turner and Interim School Business Administrator Dana Sullivan, both of whom started with the district July 1, detailed the shortfall during a community meeting at Glenfield Middle School. The district must develop a corrective action plan and submit it to the state Department of Education, the officials said … Sullivan said that she found 70 pages of outstanding purchase orders when she began as the district’s interim business administrator this month. Sullivan said she has also received many emails from vendors and staff members about unpaid bills.”\nWILDWOOD DUNE: WATCH THE SANDWORM, PLEASE — “Army Corps threatens to pull funding for Wildwoods beach project,” by The Press of Atlantic City’s Bill Barlow: “The U.S. Army Corps of Engineers has threatened to pull $54 million for a long-planned beach and dune project for the Wildwoods … The project has been in the works for more than a decade and calls for beaches in North Wildwood to be rebuilt, and a continuous dune line built the length of the barrier island’s beaches. The Army Corps and the DEP enacted an agreement in 2017. But local skepticism has grown, with officials in Wildwood and Wildwood Crest balking as the scope of the project became clearer. Those communities have extremely wide beaches, which would be the source of the sand for both the new dunes and for the wider beach in North Wildwood. It is up to the DEP to acquire the easements along privately owned beaches for the project to move forward. So far, that process appears to be moving slowly, according to previous comments from the DEP and the Army Corps. The Army Corps appears to have lost patience.”\nA NIGHT AT THE OPMA — “Judge voids suspension of Washington Township school superintendent,” by The Philadelphia Inquirer’s Melanie Burney: “A judge has struck down the suspension of Washington Township School Superintendent Eric Hibbs, ruling that the school board voted improperly when it placed the South Jersey schools chief on paid leave. In a one-page order released Thursday, Superior Court Judge Benjamin C. Telsey said the board violated the Open Public Meetings Act at its March 18 meeting when it suspended Hibbs. As a result, a resolution to suspend Hibbs is void, the judge said. It was not immediately clear what the decision would mean for Hibbs and the district, which has been in upheaval.”\n— “NJ homeless count shows 84% surge in number of unsheltered people in Paterson” \n— “N.J. dad convicted in hot car death of infant daughter avoids prison” \n\nEVERYTHING ELSE\n\nGAMMIBALIZATION — “Bally's bid for a New York City casino is alive again after Mayor Adams intervenes,” by The Press of Atlantic City’s Wayne Parry: “A bid by Bally's Corp. to open a casino in New York City is back in the game after Mayor Eric Adams intervened on its behalf. Adams on Wednesday vetoed a move by the New York City Council that denied Bally's the zoning changes it needs to build a casino resort on 16 acres of parking lots and practice greens adjacent to a golf course in the Bronx … Bally's is one of four companies seeking a New York casino that also have existing casinos in Atlantic City. The company has said it is committed to keeping Bally's Atlantic City open regardless of what happens with its New York proposal.”\n— “As horse racing fades, Meadowlands Racetrack faces a crossroads: Is a casino the answer?” \n— “Here are contract details for Rutgers AD Keli Zinn, who is betting on herself”\n\nFollow us on X\n\nMatt Friedman @mattfriedmannj\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Ottawa Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}