{
  "file_name": "2025-08-02_151600_email.html",
  "date": "2025-08-02",
  "subject_line": "The fraudster behind California secession",
  "playbook_type": "new_york_playbook",
  "authors": [],
  "sponsor": null,
  "text": "Aug 02, 2025\nView in browser\n\n By POLITICO MAGAZINE\n\nCalExit’s new CEO Sir Doctor Xavier Mitchell is pictured at one of his homes and the new headquarters for the CalExit movement in Calabasas, California, on May 7, 2025. | Alisha Jucevic for POLITICO\n\nFrom the outside, it looks impressive: a palatial home overlooking the San Fernando Valley, just northwest of Los Angeles. It’s a befitting place for the headquarters of such an ambitious organization. Here, the Calexit movement, dedicated to getting California to secede from the United States and become its own country, has made its headquarters.\nBut inside, the house — and the organization — something is amiss.\nThe mansion belongs to Calexit CEO Xavier Mitchell, and it’s a bit of a mess. Drywall falls from a water-damaged ceiling in clumps. Plywood boards stand in place of several glass doors. “Nothing in Mitchell’s house is quite as it seems. Instead, it is a superficial facsimile of wealth, a flawed stand-in — good enough, maybe, until you take a closer look,” writes Will McCarthy in this week’s Friday Read.\n“The same could be said of Mitchell himself.”\nMcCarthy pulls back the curtain on the fraudster at the center of the movement for an independent California.\nRead the story.\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\n“I was just informed that our Country’s ‘Jobs Numbers’ are being produced by a Biden Appointee, Dr. Erika McEntarfer, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala’s chances of Victory.”\nCan you guess who said this about former head of the Bureau of Labor Statistics, without evidence? Scroll to the bottom for the answer.**\n\nIllustration by Jade Cuevas/POLITICO (source images via Getty Images and iStock)\n\nTrump’s Epstein Options ... The ongoing Epstein scandal continues to rock the White House. Does Trump have a way out? According to legal columnist Ankush Khardori, the options available to the president range from bad to worse. “All have conspicuous downsides for the administration, the public or both,” he writes. Read his latest column for a breakdown of what Trump might do next — and what consequences he could suffer.\n\nGetting a little hard to keep track of who is getting fired in Washington, isn’t it? If you missed the latest high-profile axing yesterday, just stick to these talking points at happy hour. Your friends won’t know the difference. (From Associate Editor Dylon Jones)\n— If anyone raises the revisions in past job numbers Trump called out on Truth Social, show off your background knowledge about how the Bureau of Labor Statistics operates: “Revising jobs report data isn’t a sign of wrongdoing — it’s routine. Collecting data about the entire U.S. economy takes time, so it’s not a surprise that you’d need to make some updates as new information trickles in.” \n— Make yourself look like a government personnel expert with this nugget my former colleague Sam Stein shared on X: “Trump emphasized her being a Biden appointee, but he didn’t mention that she was confirmed with strong bipartisan support — including from his own VP.” \n— Telegraph what a sharp consumer of economic news you are with some important context: “Is it any wonder that the bureau would be playing catch-up on the data when the administration slashed it as part of his crusade against the ‘deep state’? Economists have been saying cuts to the bureau could weaken their reports for a while now, and we already knew they’d been forced to scale back data collection. Surprise, surprise: Worse collection means bigger revisions.” \n— Connect some dots to prove you’re an astute observer of Trump’s economic policies: “Victoria Guida wrote in POLITICO that the weak jobs report might put more pressure on Jerome Powell to cut rates — and Trump took another jab at him when he announced the BLS firing. But if he’s saying the weak report is fake, that would undermine the argument, no? Guess we’ll see what Powell does over the next month or so.” \n\nDaniel Boone escorting settlers through the Cumberland Gap by George Caleb Bingham.\n | Wikimedia Commons\n\nDoes JD Vance Consider You American? ... There’s a new term du jour on the right, and it’s making the rounds on social media — including on the Department of Homeland Security’s X account: “Heritage American,” a phrase that loosely refers to people who trace their roots to the founding generations of the United States. The idea is that who “counts” as American isn’t a matter of shared ideals or values, but rather a matter of whose family has lived here the longest. “While the specific worldview surrounding ‘heritage America’ may have been incubated online, it is increasingly finding its way into the policies and rhetoric of the Trump administration,” writes Ian Ward — especially the rhetoric of Vice President JD Vance.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nCivil rights legend Dolores Huerta, 95, speaks at a rally in Los Angeles, Monday, June 9, 2025, calling for the release of labor union leader David Huerta, who was arrested during a protest on June 6. | Damian Dovarganes/AP\n\nICE On the Farm ... Dolores Huerta, 95, has been working on farm labor issues in California for some seven decades, but she says she’s never seen raids on the agriculture sector like she’s seeing now, under the Trump administration’s aggressive push for mass deportations. That campaign is growing concerns that there may not be enough workers to manage harvest season. Huerta spoke with Samuel Benson about the impact on farm workers — and how things could be different.\n\nDemocratic mayoral candidate Zohran Mamdani has garnered the support of the Hotel & Gaming Trades Council and 32BJ SEIU, both of which previously endorsed Andrew Cuomo in the primary. | Richard Drew/AP\n\nThe Other, Other New York Socialist ... Zohran Mamdani’s upset victory in the New York Democratic mayoral primary put socialism back at the center of political debates. But Mamdani and Rep. Alexandria Ocasio-Cortez, who also rode the Bernie-Sanders-style democratic socialism train to fame, aren’t the only New York comrades to win office. Mamdani could learn a thing or two if he looks back “about eight decades to the most successful socialist to ever hold office in New York,” writes Jeff Greenfield, “a man by the name of Vito Marcantonio.”\n\nMatt Wuerker / Politico\n\nFrom the drafting table of editorial cartoonist Matt Wuerker.\n\n**Who Dissed? answer: If the creative capitalization wasn’t enough of a clue, it was Trump, who fired McEntarfer after the most recent jobs report showed job growth falling below expectations. He provided no evidence for his claims that the jobs report was faked, or that the BLS attempted to assist former Vice President Kamala Harris during the 2024 campaign. \npoliticoweekend@politico.com\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}