{
  "file_name": "2025-08-01_203104_email.html",
  "date": "2025-08-01",
  "subject_line": "A wind and solar tax mystery solved",
  "playbook_type": "national_playbook",
  "authors": [],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Timothy Cama\n\nWind turbines spin above solar panels in Atlantic City, New Jersey. | Ted Shaffrey/AP\n\nThe sudden emergence of a new wind and solar tax during the debate over Republicans’ One Big Beautiful Bill Act was shrouded in mystery.\nBut some answers are starting to emerge.\nThe tax, which aimed to penalize wind and solar projects that used parts from China and other U.S. adversaries, popped up in a late June draft of the Senate Finance Committee’s portion of the bill. It was panned by the industry and its backers as a “kill shot” and an attempt to further hobble wind and solar after ending the technologies’ tax credits.\nSenators removed the tax days later, thanks to a push from some Republican clean energy supporters. But its journey to the bill remained a head-scratcher, with many lawmakers and observers pointing fingers and hazarding guesses about it, and no one taking credit.\n“I brought it up at the lunch [soon after the text’s release] and leadership had not heard about it,” Sen. John Curtis (R-Utah), a key negotiator pushing to save renewable energy incentives, told our Kelsey Brugger.\n“Some members of Finance got surprised when I brought it up.”\nKelsey spoke with lawmakers, congressional aides, lobbyists and others, and pieced together new details about what happened: Finance Committee staff worked and took meetings for more than a year, trying to find a policy to support domestic manufacturing jobs while rolling back the tax incentives in a way that Senate Republicans could support.\nThe aides came up with the tax after talking with the Joint Committee on Taxation and legislative counsel. But with President Donald Trump’s July 4 deadline for passing the bill fast approaching and staff juggling numerous other changes, the committee didn’t have time to discuss the ideas broadly and get consensus.\n“It was a perfect MacGuffin for the most frenzied point in the process,” said Liam Donovan, a political strategist at the firm Bracewell. He called it a “reminder to industry that things could get worse.”\nAdrian Deveny, founder of Climate Vision and a former top energy aide to Minority Leader Chuck Schumer, said there “aren’t that many tools in the toolbox” if lawmakers want to reshore domestic manufacturing without the tax credits.\n“The truth of how a lot of this stuff happens, much of the policy is not requested by a member, it’s committee staff, it’s not a new phenomenon,” Deveny added.\nSenate GOP leadership referred questions to the Finance Committee, which did not return requests for comment.\nNonetheless, there was no shortage of finger-pointing around the excise tax. Prominent fossil fuel supporter Alex Epstein, who had been vocally pushing to end the tax credits quickly, was one person being blamed, but he said he opposed it.\n“We don’t want to punish solar and wind, but we don’t want to give it special preferences,” he said, characterizing his advocacy.\nThe Solar Energy Manufacturers for America Coalition offered some support for the excise tax — but also wanted to retain the tax credits to incentivize domestic solar production.\nBut Mike Carr, the group’s executive director, said SEMA did not play a role in formulating it. “The first time we saw the excise tax provision was the same time as everyone else. We didn’t provide any input on that provision,” he said.\n\nIt's Friday— thank you for tuning in to POLITICO's Power Switch. I'm your host, Timothy Cama. Power Switch is brought to you by the journalists behind E&E News and POLITICO Energy. Send your tips, comments, questions to tcama@eenews.net.\n\nListen to today’s POLITICO Energy podcast\n\nToday in POLITICO Energy’s podcast: Zack Colman breaks down the legal outlook for EPA's move to roll back the endangerment finding.\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nPower Centers\n\nFull steam ahead for offshore wind project\nThe largest offshore wind project in the U.S. is on track to start producing electricity next year — a bright spot for an industry that has been under attack, Benjamin Storrow writes.\nDominion Energy officials said in an earnings call Friday that their project named Coastal Virginia Offshore Wind is 60 percent complete. And a turbine installation vessel that is the first American-flagged ship of its kind could arrive as soon as this month.\n“This project remains consistent with the goal of securing American energy dominance and is part of our comprehensive all-of-the-above strategy to affordably meet growing energy needs,” Dominion CEO Robert Blue said on the call, echoing Trump's language.\nFEMA boss has two jobs\nThe acting head of the Federal Emergency Management Agency also holds a senior position at the Department of Homeland Security, raising questions about disaster response as hurricanes enter their most active season, Thomas Frank writes.\nDHS oversees both FEMA and the Countering Weapons of Mass Destruction Office, and the department confirmed to Tom that David Richardson leads both.\nTrump appointed Richardson in January to oversee the DHS weapons office and put him in charge of FEMA in May. At the time, the president did mention Richardson's status at DHS.\nHeading FEMA “is 24/7, every day of the year and requires your full attention every single day, every single minute,” said Peter Gaynor, who led the agency in Trump's first term.\nCO2 storage site gets ready to reopen\nArcher-Daniels-Midland expects to resume carbon dioxide injections later this summer at an Illinois site that was shuttered last year after a possible leak was detected, Carlos Anchondo writes.\n\nADM is still in talks with EPA about meeting the compliance measures for the site.\n“We take our commitment to safety and being transparent in reports we submit to the government and in relevant information we share with stakeholders very seriously,” ADM spokesperson Jackie Anderson said in a statement.\n\nIn Other News\n\nIn the market: ExxonMobil is considering purchasing other oil companies, its CEO Darren Woods told The Wall Street Journal.\nMore information: Duke Energy is planning to give electricity bill data to its North Carolina customers after years of lobbying from clean energy advocates.\n\nSubscriber Zone\n\nA showcase of some of our best subscriber content.\n\nSwedish renewable energy company Vattenfall is promoting offshore wind as a cure for climate change. | Vattenfall\n\nSamuel L. Jackson is lending a hand to offshore wind in an advertisement for a Swedish power company.\nElon Musk may be gone, but DOGE is still cutting funding for energy projects.\nSenate Democratic climate hawks slammed the White House AI action plan for the environmental impacts of favoring coal and gas.\nExelon is in talks to build new generation in six states as concerns grow about energy shortages.\nThat's it for today, folks. Thanks for reading, and have a great weekend!\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nFollow us on X\n\nArianna Skibell @ariannaskibell\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}