{
  "file_name": "2025-08-01_122256_email.html",
  "date": "2025-08-01",
  "subject_line": "Biden sounds the alarm in Chicago",
  "playbook_type": "national_playbook",
  "authors": [],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Shia Kapos\n\nHappy August, Illinois. We're wishing clear skies and clean air for Lollapaloozans.\n\nTOP TALKER\n\nFormer President Joe Biden speaks during the National Bar Association's 100th Annual Awards Gala in Chicago on Thursday, July 31, 2025. | Nam Y. Huh/AP\n\nDIRE WARNING: Former President Joe Biden stopped in Chicago on Thursday to deliver a warning that “dark days” are ahead under the Trump administration.\nDemocracy eroding: “We are, in my view, at such a moment in American history, reflected in every cruel executive outreach, every rollback of basic freedoms, every erosion of long-standing, established precedent,” Biden told the nearly 1,100 gathered at the National Bar Association's gala dinner at the Hyatt. Read our home page story here\nBiden accused the Trump administration of rolling back civil rights, eroding legal norms and endangering the democratic fabric of the nation.\nHe faulted Congress for its passivity and accused the White House of trying to “erase truth.” He called the administration “cruel” — pointing to legal immigrants detained in handcuffs and attacks on media and law firms. “That’s not hyperbole,” he insisted.\nBiden’s address wasn’t just politics — it was part memoir, part warning and part rallying cry. He recalled the 1968 riots, Dr. Martin Luther King Jr.’s assassination, and his early days as a public defender in Delaware. Biden also touted his own record — appointing more Black women to the bench than any president before him, as well as backing historically Black colleges and universities.\nEver the optimist: Biden said the stakes are high, but added, “America is worth fighting for.”\nBig names attending the reception or dinner included the Rev. Jesse Jackson, who was honored for his civil rights service, his son, Rep. Jonathan Jackson, Ariel Investment’s John Rogers Jr., Rep. Robin Kelly, Rep. Danny Davis, state Rep. La Shawn Ford, Commissioner Larry Rogers Jr., Chicago Bears President Kevin Warren, Rainbow Push Rev. Janette Wilson and Chicago Mayor Brandon Johnson, who welcomed the crowd.\nAt a press conference ahead of Biden’s speech, National Bar Association President Wiley Adams said he wanted to hear from Biden how he was navigating his health struggles and if he was doing okay. But the former president, who is being treated for prostate cancer, never did address his health, by the Sun-Times’ Violet Miller.\nApplause, applause: The lawyers’ association honored Biden for his work in office, including his appointments of Black U.S. Supreme Court Justice Ketanji Brown Jackson and a diverse slate of federal judges, by the Tribune’s Olivia Olander.\n\nTHE BUZZ\n\nCongressman Danny Davis, left, and state Rep. La Shawn Ford share a light moment after Davis endorsed Ford on Thursday, July 31, 2025. | Shia Kapos/POLITICO\n\nIT’s OFFICIAL: Rep. Danny Davis won’t seek reelection, and he’s endorsing state Rep. La Shawn Ford for his 7th District seat.\n“I am 83 years old,” Davis told supporters Thursday outside his West Side office. “Some people won’t get to be 83… I just decided that this would be a good time — this would be a great time — to try and usher in new leadership.”\nFord's rallying cry: “This campaign isn’t just about securing your vote,” Ford said Thursday. “It’s about sending a firm message against ‘Make America Hate Again.’”\nWith Davis out of the race, the list of Democrats wanting to run is expected to grow. Forest Park Mayor Rory Hoskins announced his bid after Davis's news conference. “With deep respect for the people of this district, I am stepping forward to continue this work — not by replicating the past, but by offering bold, proven leadership for the future,” Hoskins said in a statement.\nDavis’s other big move: The congressman said he won’t seek reelection for his Democratic State Central Committee seat. He isn’t offering an endorsement in that contest. After Davis’s press conference, Illinois House Speaker Emanuel “Chris” Welch said in a statement that he plans to run for the Democratic committeeman position.\nIf you are Kevin Warren, Playbook would like to hear from you! Email: skapos@politico.com\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nWHERE'S JB\n\nAt Wrigley Field at 9:30 a.m. for a Chicago Cubs announcement with Major League Baseball.\n\nWHERE's BRANDON\n\nAt Wrigley Field at 9:15 a.m. for the announcement from the Cubs and Major League Baseball.\n\nWhere's Toni\n\nAt McCormick Place at 9:30 a.m. to deliver remarks for the kick-off of the Black Women’s Expo — At 122 E. 118th St. at 10:45 a.m. for the groundbreaking of the Hope Center Foundation’s Kensington Park project, which will transform 46 vacant lots into single-family homes in Roseland.\nHave a tip, suggestion, birthday, new job or a (gasp!) complaint? Email skapos@politico.com\nMORNING MONEY: CAPITAL RISK — POLITICO’s flagship financial newsletter has a new Friday edition built for the economic era we’re living in: one shaped by political volatility, disruption and a wave of policy decisions with sector-wide consequences. Each week, Morning Money: Capital Risk brings sharp reporting and analysis on how political risk is moving markets and how investors are adapting. Want to know how health care regulation, tariffs, or court rulings could ripple through the economy? Start here.\n\nTHE STATEWIDES\n\n— Pritzker signs legislation to implement universal mental health screenings in Illinois schools: “The mental health screenings would be self-assessed, with students being able to take the screening on a tablet or a form, according to Dana Weiner, chief officer for the Children’s Behavioral Health Transformation Initiative under the governor’s office, and who was credited for laying the foundation for the piece of legislation,” by WTTW’s Eunice Alpasan. Pritzker signed the bill in Evanston, notes Evanston Now’s Matthew Eadie.\n— Legislative hearing on CPS funding issues makes problems clear, solutions less so: “I believe everybody wants to help children. Very few people want to help [the mayor] based on his lack of leadership,” state Rep. Curtis Tarver, a Democrat from Chicago’s South Side, said of Mayor Brandon Johnson, who last year argued that the city was entitled to $1 billion in additional school funding from the state, by the Tribune’s Jeremy Gorner.\n\nCHICAGO\n\n— Mayor Johnson's team reviews 26 ideas to raise revenue, plug Chicago’s budget deficit: “The biggest potential moneymakers are boosting property taxes and a garbage collection fee,” by the Sun-Times’ Fran Spielman.\nAbout the 26 tax ideas under review: “Many have been rejected by Johnson, lack Council support or require state approval,” by Justin Laurence.\n— Chicago has the worst air quality in the world just as Lollapalooza starts: “Smoke from Canadian wildfires has rolled into the Chicago area,” by Block Club’s Layla Brown-Clark.\nMore on today’s air quality, via ABC 7’s Evelyn Holmes.\n— Speaking of Lollapalooza: Pic!\n— UI Health suspends gender-affirming surgeries for patients under 19: “UI Health is the fourth major hospital in Chicago to scale back trans health care for young people amid threats to federal funding,” by WBEZ’s Kristen Schorsch.\n— Chicago's top cop consolidates power by scaling back No. 2's role, by the Sun-Times’ Tom Schuba.\n— Pullman developer touts impact amid uneasy times for low-income community funding, by Crain’s Danny Ecker.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nTAKING NAMES\n\n— SPOTTED: Chicago Ald. Bennett Lawson’s fundraiser earlier this week drew a crowd at Vines on Clark in Wrigleyville. In the room were Rep. Robin Kelly, Rep. Mike Quigley, state Sen. Sara Feigenholtz, Ald. Felix Cardona Jr., former House Majority Leader Greg Harris, former Cook County Assessor Jim Houlihan, MWRD Commissioners Cam Davis and Beth McElroy Kirkwood, Democratic Committeeman Sean Tenner and numerous judges, school board members and candidates for political office.\n— Ron Onesti was recognized earlier this week by the Cook County Board for the 100th birthday of the Des Plaines Theatre, which he runs.\n\nReader Digest\n\nWe asked about gathering signatures for candidates.\nJohn Anderson: “I got bit by a dog while knocking doors to collect signatures when I ran for circuit judge in 2010. Little dogs have sharp teeth. It worked out OK — they put a sign in their yard for me.”  \nMatthew Beaudet: “When I ran for judge countywide in 2000, my 76-year-old dad went to senior buildings and got a ton of signatures from widowed female residents. My 76-year-old mom stayed at home and told my dad to behave himself in the senior buildings.”\nBrady Chalmers: “I was knocking doors for Obama in Virginia in '07. I knocked on a guy's door and did my spiel. He looks at me and says, ‘I've never voted for a N-word in my life, but I'm gonna give this Obama a chance.’ I had no idea how to react to the situation, but I was pretty sure we were going to win the election at that point.”\nAnne Sommerkamp: “A little boy (3 or 4 years old) answered the door naked with an Xbox controller in his hand. His mom was horrified and embarrassed. I told her my son liked being naked at that age, too. It’s a boy thing he’ll outgrow. She signed, and chuckled all day.”\nNEXT QUESTION: If summer had a soundtrack, what's one song you'd put on the August playlist?\n\nKEEPING UP WITH THE DELEGATION\n\n— Illinois Sens. Dick Durbin and Tammy Duckworth are among senators urging the Department of Justice to publicly release all files relating to the investigation of Jeffrey Epstein and his associates. The State Journal-Register’s Steven Spearie has more.\n\nTHE NATIONAL TAKE \n\n— Trump issues order imposing new global tariff rates effective Aug. 7, by POLITICO’s Daniel Desrochers and Ari Hawkins\n— Trump’s Options for Dousing the Epstein Fire, by POLITICO’s Ankush Khardori\n— Ron DeSantis declares ‘Hulk Hogan Day in Florida,’ and orders flags lowered, by POLITICO’s Gregory Svirnovskiy\n\nIN MEMORIAM\n\n— Column | Talented journalist Christine Moyer’s words foreshadow her own tragic death outside Schaumburg wedding: The former reporter for The Beacon-News and Courier-News was allegedly killed by her father-in-law at a family wedding, by the Aurora Beacon-News’ Denise Crosby.\n\nTRANSITIONS\n\n— Joe Neri is retiring at the end of the year as CEO of IFF, formerly the Illinois Facilities Fund. He’s been with the lending institution for 28 years — 14 in the top job. Succeeding him is Kirby Burkholder, president of IFF’s Core Business Solutions.\n— William “Bill” Josten has joined Honigman LLP as director of Client Value and Commercial Strategy. He spent more than a decade at Thomson Reuters, most recently as a senior manager.\n— Greg Gartland is now a co-chair of Winston & Strawn LLP’s financial restructuring practice. He has been a partner at the firm.\n\nEVENTS\n\n— Saturday: Black Millennial Renaissance will hold its graduation and fundraiser luncheon. Details here\n\nTRIVIA\n\nTHURSDAY’s ANSWER: Congrats to Cristina Nonato for correctly answering that in 1982, the Cubs traded Iván de Jesus to get Ryne Sandberg and Larry Bowa in what’s been described as the best trade the Cubs ever made.\nTODAY’s QUESTION: Who was the Chicago baseball player who served on the CTA Board? Email to: skapos@politico.com.\n\nHAPPY BIRTHDAY\n\nToday: Illinois Department of Human Services General Counsel Amy Crawford, Chief of Staff to Congressman Danny Davis Tumia Romero, CTA Strategic Adviser on Strategic Initiatives Steve Mayberry, consultant Richard Melcher and former Illinois Film Office head Brenda Sexton.\nSaturday: Illinois House Chief of Staff Clayton Harris III, former state Rep. Karen May, Catholic Charities Government Relations Director Brendan O’Sullivan and Drug Enforcement Administration of Chicago’s Luis Agostini.\nSunday: Former Sen. Roland Burris, Lee County Industrial Development Association exec and former state Rep. Tom Demmer, former EPA Regional Administrator Debra Shore, former U.S. Ambassador to Chile Bernadette Meehan, political consultant and former Flossmoor Trustee Gyata Kimmons, Washington Reporter Editor in Chief and former Chicago ward committeeman Matthew Foldi, Allies for Community Business CEO Brad McConnell, Conagra Chief Comms Officer Jon Harris, UCAN Marketing VP Derrick Baker, Tribune reporter Gregory Royal Pratt and podcaster and former Slate CEO Jacob Weisberg.\n-30-\n\nFollow us on X\n\nShia Kapos @shiakapos\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Ottawa Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}