{
  "file_name": "2025-08-02_145348_email.html",
  "date": "2025-08-02",
  "subject_line": "The new master of the Senate",
  "playbook_type": "national_playbook",
  "authors": [
    "Charlie Mahtesian",
    "Eli Okun",
    "Bethany Irvine",
    "Ali Bianco"
  ],
  "sponsor": "The Vapor Technology Association",
  "text": "Aug 02, 2025\nView in browser\n\n By Charlie Mahtesian\n\n Presented by \n\nWith help from Eli Okun, Bethany Irvine and Ali Bianco\nGood morning. I’m Charlie Mahtesian. Get in touch.\n\nDRIVING THE DAY\n\nThe traditional presidential play would have been to cut GOP Sen. Thom Tillis some slack, instead Donald Trump became the catalyst for his retirement. | Jacquelyn Martin/AP Photo\n\nMASTER OF THE SENATE: The most eventful week to date in the midterm battle for the Senate just came to a close. The field in one of the marquee races of 2026 finally took shape in North Carolina, the lead architect of Project 2025 launched a primary challenge against South Carolina Sen. Lindsey Graham, Rep. Mike Collins joined the Georgia GOP Senate primary, appointed Florida Sen. Ashley Moody continued on her special election glide path when her most serious Democratic challenger dropped out, and we got a little more insight into Nebraska.\nBut don’t lose sight of the larger narrative. Whatever else is happening in these races from week to week, the single most important factor determining the outcome of the 2026 Senate election cycle is President Donald Trump. Nothing else is even close.\nHis approval ratings are part of this equation. Trump is famously rangebound in the polls, with a low ceiling and a high floor, but his popularity next year will matter — midterm history shows there is a correlation between a president’s ratings and his party’s fate.\nBut Trump’s unique ability to unleash the forces of electoral chaos is what really makes him the single most influential character. No one — not Mitch McConnell, not the National Republican Senatorial Committee, not Majority Leader John Thune nor anyone else — has done as much as Trump to directly shape the Senate GOP Conference over the past decade.\nSince taking office in 2017, he’s hounded a handful of members out of office, been the proximate cause of lost Senate seats in Georgia and blown opportunities elsewhere (just Google McConnell and ‘candidate quality’). By elevating JD Vance and Marco Rubio from their Senate seats into his administration, Trump created two more new Republican senators.\nMost recently, Trump upended the landscape in North Carolina. The traditional presidential play would have been to cut GOP Sen. Thom Tillis some slack, recognizing the complexity of the terrain and the party’s need to maximize Tillis’ chances of holding his seat. Instead, Trump became the catalyst for his retirement, enhancing Democratic chances of flipping the seat in one of the most competitive states in the nation.\nSo far, Trump has been unusually disciplined when it comes to the Senate — by his standards, at least. Surrounded by the most capable political team he’s ever assembled — and tempered by the bracing experience of two unsuccessful midterm elections — the president has judiciously dished out endorsements to incumbents and strategically withheld them.\nHe’s also largely avoided trashing wayward Senate Republicans. Until now.\nWhether it’s the pressure from the Jeffrey Epstein saga or a reversion to the mean, the cracks are beginning to show. The gravitational pull toward chaos is overtaking his strategic imperatives.\nIn the last week alone, Trump has publicly whacked three Senate Republicans — Josh Hawley (R-Mo.), Susan Collins (R-Maine) and 91-year-old Chuck Grassley (R-Iowa), the longest-serving member of the Senate — for largely minor political offenses. (Here’s a thought exercise: Try imagining Barack Obama lighting up Robert Byrd for respecting an informal Senate practice, or George W. Bush torching Strom Thurmond.)\nThe missile aimed at Collins, who has consistently vexed the president, was predictable, though not particularly productive. Dragging one of the most vulnerable GOP incumbents doesn’t advance the goal of holding a Senate majority.\nThe dig at Grassley — especially after the Senate Judiciary chair and champion of whistle-blowers fell in line on the Emil Bove nomination — was simply gratuitous. The Iowan’s GOP bona fides date back to the Eisenhower era; his ticket’s been punched in the Iowa Legislature, the House and nearly a half-century in the Senate. To suggest Grassley lacks political courage, or is a RINO, or that the president carried him to reelection in 2022, is to play cat’s paw with him.\nIt also served no discernable purpose, other than to remind Grassley and everyone else of Trump’s dominion over the Senate, which isn’t really in question anymore. Grassley’s meek response was revealing: he said he was “offended” and “disappointed” by the insult. Welp.\nTrump can’t seem to help himself: He delights in taking down members of the world’s most exclusive club. Counting his Truth Social posts aimed at Chuck Schumer and four other Senate Democrats (“SLEAZEBAGS ALL”) Trump leveled public attacks on eight different senators in recent days.\nThe equal-opportunity disparagement helps explain his deep connection with the base of an increasingly populist GOP: The grassroots appreciates the fact that, when it comes to Trump, everyone in a position of power — senators, foreign leaders, former presidents, billionaires and Fortune 500 CEOs — is fair game.\nThe GOP begins with a structural advantage on the 2026 Senate map: Nearly all of the Republican seats up for election are in states Trump carried easily last year, while Democrats must defend at least four seats that are more precariously perched. While the midterm political winds typically blow against the party in power, to win back the majority Democrats have to flip four Republican seats, while not losing any they currently control.\nIt’s a daunting task, but Trump looms as the great equalizer. It wouldn’t take more than a few impulsive, undisciplined moves — such as endorsing slavishly loyal but unelectable candidates in key races, or creating messy primaries by torpedoing shaky GOP incumbents — to create just enough opportunities for Democrats to compete on what is otherwise an unforgiving Senate map.\n\nA message from The Vapor Technology Association:\nThe U.S. vaping industry and tens of thousands of small businesses are at risk. A Biden-era task force and rogue FDA and CBP bureaucrats are blocking all flavored vapes from entering the U.S. These bureaucrats are undermining President Trump’s promises to protect our children from illicit vapes and save flavored vaping.\n\n President Trump: Tell the FDA and CBP to stop banning vapes – vaping voters and small businesses are counting on you.\n\nLearn more.\n\n9 THINGS THAT STUCK WITH US\n\n President Donald Trump fired Erika McEntarfer, the head of the Bureau of Labor Statistics, on Friday after the monthly jobs report for July came in far weaker than expected. | AP\n\n1. DAMNED LIES AND STATISTICS: President Donald Trump fired Erika McEntarfer, the head of the Bureau of Labor Statistics, on Friday after the monthly jobs report for July came in far weaker than expected and also significantly revised the numbers downward for June and May, POLITICO’s Nick Niedzwiadek and Sam Sutton report.\nWhat Trump said: “I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,” the president wrote on Truth Social. “She will be replaced with someone much more competent and qualified.” Trump has previously claimed that the BLS inflated employment figures at the close of the Biden administration for political reasons — a claim made without evidence, and which the president reiterated online yesterday. “In my opinion, today’s Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad,” he wrote.\nDespite Trump’s claims to the contrary, the government’s “economic statistics have been considered the gold standard for decades,” write WSJ’s Justin Lahart, Alex Leary and Matt Grossman.\nThe immediate worry: “Trump’s move throws the quality of America’s statistical apparatus into question,” the Journal continues. “The immediate worry among economists and former officials following Trump’s move was that it opened the door for the economic data to be distorted for political reasons. Federal Reserve officials rely on U.S. economic statistics to make timely decisions on setting monetary policy, while investors and businesses depend on them to allocate capital efficiently.”\nOr, put differently: “You can’t bend economic reality, but you can break the trust of markets,” University of Michigan economist Justin Wolfers put it. “And biased data yields worse policy.”\nReaction on the Hill: While some Republican senators reacted warmly to Trump’s announcement, Senate Minority Leader Chuck Schumer said the move was tantamount to “shoot[ing] the messenger,” and some Democrats “likened Trump’s demand to actions taken by totalitarian governments,” POLITICO’s Aaron Pellish reports.\n2. ALL ABOARD THE MINIBUS: The Senate passed its first three spending bills yesterday in a show of bipartisan agreement over the so-called “minibus” package. In an 87-9 vote, the upper chamber passed a two-bill package that would fund the departments of Veterans Affairs and Agriculture, along with military construction and the Food and Drug Administration, POLITICO’s Katherine Tully-McManus and Jordain Carney report. A third bill “to fund Congress itself” passed, 81-15.\nWhat’s in it: “The package would provide almost $154 billion for military construction and veterans programs,” KTM and Jordain report. “It would send more than $27 billion to the Agriculture department and FDA. Both represent a roughly 2 percent boost over current levels.”\nComing soon: Though the minibus passing won't do anything to stop a possible shutdown in September, “Senate leaders still want to move that package through with the goal of gaining leverage in the broader spending talks with the House and President Donald Trump.” The package is now headed to the House, which will take it up after returning from August recess.\n3. REDISTRICTING ROUNDUP: In Austin yesterday, as Texas lawmakers gathered at the state capitol to discuss the GOP’s newly proposed congressional maps, state House Republicans didn’t shy away from what is animating their proposed redistricting, Playbook’s Bethany Irvine writes in from the Lone Star State. “We have five new districts, and these five new districts are based on political performance,” said State Rep. Todd Hunter, a Corpus Christi Republican and sponsor of the bill. Even so, he defended the mid-decade redraw as “completely transparent” and “lawful.”\nA floor vote on the maps could happen as soon as Tuesday, though state legislative Democrats are considering a mass exodus from the state in a last-ditch effort to delay the vote.\nFrom Washington to Austin: During public testimony, Democratic U.S. Reps. Marc Veasey, Lloyd Doggett, Al Green, Greg Casar, Jasmine Crockett and Sylvia Garcia slammed the gerrymander. “This is not a Texas map, it is a Trump map,” said Doggett. Added Casar: “I think a five-year-old could draw a more coherent map than what they sent you from Mar-a-Lago.”\nAnd beyond the Lone Star State: “A group of Democratic governors is urging its colleagues to get tough in countering Republican-backed efforts to gerrymander Texas’ congressional districts,” POLITICO’s Elena Schneider reports. Said Kansas Gov. Laura Kelly at a Democratic Governors Association meeting yesterday: “I’m not a big believer in unilateral disarmament.”\n4. VIEWERS LIKE YOU: “The Corporation for Public Broadcasting announced on Friday that it will wind down its operations due to the successful Republican effort to defund local PBS and NPR stations across the country,” CNN’s Liam Reilly and Brian Stelter report. “The announcement came just over a week after President Donald Trump enacted a rescissions bill clawing back congressionally approved federal funds for public media and foreign aid. Of the $9 billion in canceled funds, $1.1 billion was earmarked for the corporation for the next two years.”\nThe impact: The CPB “has warned that some stations, particularly in rural areas, will have to shut down without federal support,” Reilly and Stelter write. “Most larger stations have numerous other funding sources, including viewer and listener donations, to soften the blow dealt by Congress.”\nWhat endures: “PBS, NPR and some of the most popular programs associated with public broadcasting, such as ‘Sesame Street’ and ‘All Things Considered,’ will survive without the Corporation for Public Broadcasting,” writes NYT’s Benjamin Mullin. “NPR and PBS get a relatively small portion of their annual budget from the corporation, and children's TV programs like ‘Daniel Tiger’s Neighborhood’ are produced independently of those organizations. Still, the cutbacks could affect the availability of those shows, particularly in pockets of the country without widespread access to broadband internet and mobile data.\n\nA message from The Vapor Technology Association:\nPresident Trump understands what voters want – flavored vapes to quit smoking.\n\n That’s why VTA supports a crackdown on illicit vapes targeting youth while encouraging him to keep his promise to save flavored vaping.\n\n President Trump: Stop bureaucrats blocking Americans’ freedom to vape and killing small businesses.\n\nLearn more.\n\n5. NEW FUNDING FIGHT: “Trump Administration Blocks Funding for CDC Health Programs,” by WSJ’s Nidhi Subbaraman and Liz Essley Whyte: “The Trump administration is blocking funding for a swath of public-health programs run by the Centers for Disease Control and Prevention, the latest flashpoint in a push by the White House to withhold money already approved by Congress. … A range of programs won’t be fully funded under the freeze. These include youth violence prevention programs, research on preventing gun injuries and deaths and efforts targeting diabetes, chronic kidney disease and tobacco use. It couldn’t be determined how much the withheld money would amount to, but it could be as high as $200 million, according to one of the people familiar with the matter. Another person familiar estimated the amount to be more than $300 million.”\n6. ON THE LINE: “Appeals Court Allows Trump Order That Ends Union Protections for Federal Workers,” by NYT’s Chris Cameron: “A federal appeals court on Friday allowed President Trump to move forward with an order instructing a broad swath of government agencies to end collective bargaining with federal unions. … Trump had framed his order stripping workers of labor protections as critical to protect national security. But the plaintiffs — a group of affected unions representing over a million federal workers — argued in a lawsuit that the order was a form of retaliation against those unions that have participated in a barrage of lawsuits opposing Mr. Trump’s policies. … But a three-judge panel of the United States Court of Appeals for the Ninth Circuit, a famously liberal jurisdiction, ruled in Mr. Trump’s favor, writing that ‘the government has shown that the president would have taken the same action even in the absence’ of the union lawsuits.”\n7. GAZA LATEST: “U.S. aid money to Gaza trickles in, belying Trump’s claims, as officials visit,” by WaPo’s Karen DeYoung: “Despite President Donald Trump’s repeated assertion this week that the United States has contributed $60 million for food to Gaza, U.S. pledges have been half of that amount, only a fraction of which has been actually disbursed. A State Department spokesperson said Friday that ‘we have approved funding for $30 million’ to the Gaza Humanitarian Foundation, the controversial U.S.-Israeli backed food distribution system, adding that ‘an initial amount has been disbursed as of this week.’”\n8. COMING ATTRACTIONS: “The Supreme Court just dropped a hint about its next big Voting Rights Act case,” by POLITICO’s Zach Montellaro and Josh Gerstein: “The Supreme Court said Friday that it will weigh the constitutionality of a common form of redistricting used to protect the voting power of Black and Hispanic voters: the drawing of congressional districts where racial minorities make up at least half the population. Experts in election law said the move signals that the court may be poised to further narrow the Voting Rights Act.”\n9. VIBE CHECK: “Businesses got some clarity on Trump’s trade deal. They aren't reassured,” by POLITICO’s Daniel Desrochers and Victoria Guida: “A half-dozen leaders from financial firms, corporations and trade groups said in interviews that the series of tariff rates Trump unveiled Thursday night were steeper than they had expected, and they worry that the dizzying kaleidoscope of policies he’s applying to different countries will complicate global commerce. The economy is already showing cracks, with the job market slowing and stocks tumbling Friday. … Many business leaders fear that this week’s worrying economic numbers are only the beginning of a more sustained downturn.”\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nCLICKER — “The nation’s cartoonists on the week in politics,” edited by Matt Wuerker —16 funnies\n\nMatt Wuerker - POLITICO\n\nA message from The Vapor Technology Association:\n\nGREAT WEEKEND READS:\n— “Inside the Crisis at the Anti-Defamation League,” by Noah Shachtman for NY Mag: “The group used to fight for justice for all. Its war against anti-Zionism has changed everything.”\n— “Ms. Rachel grew up on Mister Rogers. Now she’s carrying on his legacy,” by Caitlin Gibson for WaPo: “The YouTube star wants her audiences — adults and children alike — to see the humanity of all people.”\n— “How NASA Engineered Its Own Decline,” by Franklin Foer for the Atlantic: “The agency once projected America’s loftiest ideals. Then it ceded its ambitions to Elon Musk.”\n— “Meet the Fraudster Who Wants to Make California Its Own Country,” by Will McCarthy for POLITICO Magazine: “The man behind the Calexit movement claims to be a baller. But he's broke.”\n— “Tom Homan once spared Phoenix migrants. Now he’s Trump’s Darth Vader,” by Stephen Lemons for the Phoenix New Times: “Pre-Trump, colleagues of border czar Tom Homan described him as reasonable. Now, they see a cruel man they don’t recognize.”\n— “Ada and Her Family Fled El Salvador. She Died Alone in the New Mexico Desert,” by Lillian Perlmutter for Rolling Stone: “Over the past three years, the skeletons of hundreds of female migrants have been discovered in the Sunland Park Triangle, near a New Mexico suburb.”\n— “DOGE-Pilled,” by Susan Berfield, Margi Murphy and Jason Leopold by Bloomberg: “Luke Farritor could have been an artist, or a builder, or someone dedicated to seeing a great historical mystery through. Instead, he wound up at the Department of Government Efficiency, slashing, dismantling, undoing.”\n— “The First Soda in Space: When NASA Got Caught Up in the Cola Wars,” by Joseph Dragovich for NYT: “In the summer of 1985, NASA, the Reagan White House and seven talented astronauts were wrangled into an orbital battle over soft-drink supremacy.”\n— “‘No Tax on Tips’ Is an Industry Plant,” by Eyal Press for the New Yorker: “Trump’s ‘populist’ policy is backed by the National Restaurant Association — probably because it won’t stop establishments from paying servers below the minimum wage.”\n— “The U.S. military is investing in this Pacific island. So is China,” by Michael Miller, Lyric Li and An Rong Xu for WaPo: “New U.S. radar sites are designed to keep China in check. But Chinese developments, some with questionable connections, could create vulnerabilities.”\n— “‘Combat Cocktail’: How America Overmedicates Veterans,” by Shalini Ramachandran and Betsy McKay for WSJ: “To treat PTSD, the Department of Veterans Affairs put hundreds of thousands of patients on multiple streams of powerful drugs that put them at risk of suicide.”\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nTALK OF THE TOWN\n\nMEDIA MOVE — Dave Levinthal is now a contributing editor at NOTUS. He is an investigative reporter and Raw Story and Business Insider alum.\nWEDDING — Sarah Williamson, a correspondent and anchor for Newsmax and Tal Erel, a business transformation consultant at EY, recently married at City Vineyard on Pier 26 in Tribeca. The couple met when Sarah was living in Israel and interviewed Tal before the 2020 Olympics, when he was on the Israeli baseball team that had qualified. Pics by Eric Green ... Another pic SPOTTED: Tom and Deneen Borelli, Christina Thompson, Monica and Daniel Baldwin, and Rita Cosby and Tomaczek Bednarek.\nHAPPY BIRTHDAY: VP JD Vance … Sen. Jacky Rosen (D-Nev.) … Rep. Burgess Owens (R-Utah) … D.C. Mayor Muriel Bowser … BAL’s Betsy Lawrence … Matthew Rosenberg … Patrick Ruffini of Echelon Insights … Gigi Sohn … Fox News’ Rich Edson … Kevin Walling … NewsNation’s Kellie Meyer … Peter Mihalick … CBS’ Caitlin Huey-Burns … Emily Gershon … Sarah Bittleman … Camille Gallo … Jeff Ballou … Michael Manganiello … Jack H. Jacobs (8-0) … Brynn Barnett … former Reps. Nancy Boyda (D-Kan.) (7-0) and Dan Boren (D-Okla.) … Laura Nasim … former Treasury Secretary John Snow … Brian Montgomery … The New Yorker’s Lawrence Wright … Dennis Prager … Nick Ballas … Whit Blount of Rep. María Elvira Salazar’s (R-Fla.) office … NBC’s Dylan Dreyer … Kolby Lee … Steve Tebbe … Stephen Cox … Geneva Fuentes … Seng Peng\nTHE SHOWS (Full Sunday show listings here):\nCBS “Face the Nation”: USTR Jamieson Greer … New Mexico Gov. Michelle Lujan Grisham … CMS administrator Mehmet Oz … Brian Moynihan … Canadian Ambassador Kirsten Hillman.\nFOX “Fox News Sunday”: Kevin Hassett … Johnnie Moore … Tim Lilley … Sen. Tim Kaine (D-Va.). Panel: Guy Benson, Dan Koh, Susan Page and Tiffany Smiley.\nNBC “Meet The Press”: Kevin Hassett … Sen. Alex Padilla (D-Calif.). Roundtable: Yamiche Alcindor, Susan Glasser, Stephen Hayes and Symone Sanders-Townsend.\nCNN “Inside Politics Sunday”: Sen. Cory Booker (D-N.J.). Panel: \nJeff Zeleny, Aaron Blake, Tia Mitchell and Olivia Beavers.\nCNN “State of the Union”: EPA Administrator Lee Zeldin … Colorado Gov. Jared Polis. Panel: Faiz Shakir, Kate Bedingfield, Jonah Goldberg and Brad Todd.\nABC “This Week”: Larry Summers … Eric Holder … Avril Benoît. Politics Panel: Chris Christie and Donna Brazile.\nDid someone forward this email to you? Sign up here.\nSend Playbookers tips to playbook@politico.com or text us on Signal here. Playbook couldn’t happen without our editor Zack Stanton, deputy editor Garrett Ross and Playbook Podcast producer Callan Tansill-Suddath.\n\nA message from The Vapor Technology Association:\nNearly 500,000 Americans die annually from smoking cigarettes. 67% of Trump voters say government should promote vapes to help Americans quit smoking – and all Americans need President Trump to save flavored vaping now.\n\n VTA stands with President Trump in cracking down on the bad actors who sell vapes targeting youth. However, a Biden-era FDA task force is out of control – wasting CBP resources on vapes, rather than human traffickers – banning vapes from the market. The vape blockade is a de facto ban on flavored vapor products nationwide, which is already shutting down small businesses.\n\n It’s time to protect this multibillion-dollar American industry and stand up for American adults’ freedom to vape.\n\n President Trump, stop the bureaucrats from undermining your promise to save flavored vaping. Don't let Biden’s task force fulfill his plan to destroy legitimate businesses and hurt American consumers. American vapers are counting on you.\n\nLearn more.\n\nFollow us on X\n\nJack Blanchard @Jack_Blanchard_\nDasha Burns @DashaBurns\nAdam Wren @adamwren\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Canada Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}