{
  "file_name": "2025-08-01_223118_email.html",
  "date": "2025-08-01",
  "subject_line": "Why Trump’s newly announced tariffsaren’t a done deal",
  "playbook_type": "politico_nightly",
  "authors": [],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Ankush Khardori\n\nPresident Donald Trump displays a signed executive order imposing tariffs on imported goods during a trade announcement event in the Rose Garden at the White House on April 2, 2025. | Andrew Harnik/Getty Images\n\nTHE LAW ON LIBERATION DAY — On Thursday, Donald Trump announced sweeping new tariffs against U.S. trading partners that will go into effect next week. The announcement came on the same day that an appeals court grappled with the question of whether Trump’s tariffs are even legal.\nIndeed, there is a strong argument that the tariffs are illegal and unconstitutional. The Federal Circuit Court of Appeals, which on Thursday held oral argument on two major tariff challenges — one from a group of small businesses and the other from a coalition of twelve states led by Oregon Attorney General Dan Rayfield — seems like it may ultimately agree.\nRayfield was pleased with how it went. “If you were an outside observer watching the hearing and you had to pick a party to stay in the shoes of, I think you would prefer to be in the state’s shoes after Thursday’s hearing,” Rayfield said in an interview with POLITICO this afternoon.\nThat seems to be the consensus among close observers. “Federal appeals court judges on Thursday sharply questioned President Donald Trump’s authority,” POLITICO’s Kyle Cheney and Doug Palmer wrote. Reuters put it similarly, while the Associated Press reported that the judges “expressed broad skepticism” toward the government’s arguments. The New York Times’ account said that Brett Shumate, the lawyer arguing for the government, “at times faced an icy reception.”\nThis is not that surprising if you have been following this legal saga closely.\nThe Constitution explicitly gives the power to impose tariffs to Congress. Congress has passed several trade laws that provide the president with the power to impose tariffs in certain circumstances, but they do not grant the sweeping and unreviewable power that the Trump administration has claimed — and indeed requires in order to support Trump’s tariffs as a legal matter.\nMeanwhile, the statute that has actually been invoked by the Trump administration — the International Emergency Economic Powers Act — has never been used to impose tariffs over the course of the nearly half-century that it has been on the books, and it makes no mention of tariffs in the text. It was in fact passed to limit the president’s emergency economic powers. On top of that, the key case cited by the government in its favor does not actually support their position (usually a bad thing).\nThus far, two lower courts have ruled against the administration on this issue — a unanimous three-judge panel on the U.S. Court of International Trade and a federal district court judge in Washington, D.C. Both rulings have been stayed pending appeal. Thursday’s argument concerned the first of those rulings and was conducted in the Federal Circuit Court of Appeals.\nIf the government loses in the Federal Circuit, it is still possible that the Supreme Court’s conservative justices could agree to hear the case and ultimately rule in Trump’s favor. On the merits, that outcome would be hard to square with the conservative majority’s stated commitment to textualism as a mode of statutory interpretation, as well as the major questions doctrine that was developed in recent years by the conservative justices, who used it in 2023 to strike down much of the Biden administration’s student-loan forgiveness effort.\nIn the student-loan forgiveness case, the conservative justices relied crucially on the fact that the program was estimated to cost taxpayers roughly $500 billion, according to a budget model from the University of Pennsylvania. They concluded that this warranted a particularly rigorous and stringent mode of statutory interpretation.\nThe estimated cost to taxpayers in that case pales in comparison to the estimated cost for Americans resulting from Trump’s tariffs, according to a model at Yale University. That model currently estimates that Trump’s latest tariff framework will result in an average per household income loss of $2,400 this year alone, that it will result in a 0.5 percentage loss in real GDP this year and next year, and that the economy will lose nearly half a million jobs by the end of 2025.\nNone of this has stopped the administration from plowing forward.\nAt this point, the administration may be hoping for a victory at the Supreme Court (assuming they lose at the Federal Circuit) or, perhaps, simply planning to do as much as they can to advance their tariff policy before a day comes when it is definitively thrown out by the courts.\nThey have already been aided in this regard by the Supreme Court, intentionally or otherwise.\nIn mid-June, the two businesses that prevailed in federal district court in Washington asked the Supreme Court to short-circuit the appeals process and take the case up immediately for review.\n“In light of the tariffs’ massive impact on virtually every business and consumer across the Nation, and the unremitting whiplash caused by the unfettered tariffing power the President claims, challenges to the IEEPA tariffs cannot await the normal appellate process (even on an expedited timeline),” the companies’ lawyers wrote.\nThe companies’ request was far from crazy, particularly given the fact that the conservative justices have moved quickly in a variety of major court challenges to the Trump administration’s actions since Trump’s inauguration.\nThree days later, however, the Supreme Court denied their request, with no explanation.\nPerhaps not coincidentally, those expedited rulings have favored the Trump administration, while in the case of Trump’s tariffs, a critical mass of conservative justices may ultimately be compelled to rule against Trump — if, that is, they actually adhere to the interpretive and constitutional principles that they claim to follow.\nIn the meantime — and as the administration has been struggling in the courts to defend its policy — the Trump administration is evidently moving forward undeterred.\nWelcome to POLITICO Nightly. Reach out with news, tips and ideas at nightly@politico.com. Or contact tonight’s author at akhardori@politico.com.\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nWhat'd I Miss?\n\n— Trump demands firing of BLS chief after soft jobs report: President Donald Trump called for the ouster of the head of the Labor Department’s statistical arm this afternoon after the latest monthly jobs report came in well under expectations. “I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,” Trump wrote in a social media post. “She will be replaced with someone much more competent and qualified.” Trump reprised prior accusations that the Bureau of Labor Statistics under Commissioner Erika McEntarfer surreptitiously put out overly rosy jobs numbers at the tail end of the Biden administration that were subsequently revised in order to influence the election. Economists have roundly dismissed these claims as a misunderstanding of the agency’s revision processes.\n— Huckabee, Witkoff visit US-backed Gaza Humanitarian Foundation amid global outcry: Senior U.S. officials visited a distribution center for the American-backed Gaza Humanitarian Foundation today, pledging to report back to President Donald Trump about the foundation’s operations and devise a plan to address starvation in the strip amid growing global outcry over the humanitarian crisis. U.S. Ambassador to Israel Mike Huckabee and special envoy Steve Witkoff made a rare trip to Gaza today amid heightened pressure — including from within MAGA circles — to reconsider the administration’s support for Israel’s war on Hamas and intervene in Gaza’s hunger crisis.\n— Corporation for Public Broadcasting shutting down: The Corporation for Public Broadcasting announced today it was shutting down its operations after President Donald Trump rescinded funding for the nonprofit, which it used to support public radio and TV stations around the country. The CPB — which was established by Congress decades ago as an independent nonprofit — said it will begin “an orderly wind-down” after Trump signed a measure last month to claw back $1.1 billion in grants appropriated to CPB over the next two fiscal years.\n— Ghislaine Maxwell transferred to less restrictive prison after DOJ meeting: Days after sitting down with one of the highest-ranking members of the Justice Department, Ghislaine Maxwell has been transferred to a less restrictive minimum security federal prison camp in Texas, her attorney said. Maxwell’s attorney David Oscar Markus said today she had been moved to Federal Prison Camp Bryan, a facility for female inmates in Southeast Texas. He declined further comment. Until this week, Maxwell, the onetime girlfriend of disgraced financier Jeffrey Epstein, had been serving a 20-year sentence for her 2021 conviction for sex trafficking crimes in Florida, at FCI Tallahassee, a low-security prison.\n— Trump, escalating war of words with Russia’s Medvedev, mobilizes two nuclear submarines: President Donald Trump said today he mobilized two nuclear submarines “to be positioned in the appropriate regions” in response to threatening comments by Russia’s former president Dmitry Medvedev. In a post on Truth Social, Trump said he was taking that action “just in case these foolish and inflammatory statements are more than just that. Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.” Medvedev on Thursday referenced Russia’s nuclear capabilities amid an escalating battle on social media sparked by Trump’s latest efforts to increase economic pressure on the Kremlin in hopes of reviving diplomatic efforts to end the war in Ukraine.\n\nAROUND THE WORLD\n\nItaly's Prime Minister Giorgia Meloni speaks during a press conference with Austria's chancellor in Rome on July 15, 2025. | Tiziana Fabi/AFP via Getty Images\n\nRAISING THE BAR — Italian Prime Minister Giorgia Meloni reacted with fury today as the EU’s top court raised the threshold for member countries to reject asylum-seekers.\nThe Court of Justice of the European Union (CJEU) said EU nations may only create national lists of safe countries outside the bloc if they fully justify their assessments with public sources.\nAccording to the court, a country can only be considered “safe” for repatriation if “the entire population” is protected across all regions.\nMeloni called the court’s decision “surprising” and a power grab by EU judges. “Once again, the judiciary, this time at the European level, claims spaces that do not belong to it, in the face of responsibilities that are political,” she said.\nSLOVENIA STEPS OUT— Slovenia became the first EU country to ban all weapons trade with Israel, citing the ongoing humanitarian crisis in Gaza.\nThe government also prohibited the transit of weapons to or from Israel through Slovenia, the administration in Ljubljana said in a statement Thursday.\nSlovenia said that it decided to act independently from the EU, as “due to internal disagreements and disunity,” the bloc is unable to take action against Israel. Though the European Commission proposed partially suspending Israel’s association agreement with the EU this week, member countries have yet to agree on it.\n\nNightly Number\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\n258,000\nThe revision downwards of the number of jobs added in May and June, meaning the government now estimates that employment only increased by 33,000 total jobs over those two months, according to the Labor Department. Those are significant revisions that the Labor Department acknowledged were “larger than normal.”\n\nRADAR SWEEP\n\nWEEKEND WARRIORS — Under the threat of Chinese invasion, more and more Taiwanese civilians are signing up for civil defense classes. US intelligence predicts that China will be ready to invade Taiwan by 2027 as China builds up its aircrafts and warships. Armed with airsoft guns that fire plastic pellets, men and women train on the weekends in converted garages and empty warehouses to prepare a civil resilience. Beyond armed defense, officials and private organizations have amped up drills for attacks on critical infrastructure and cyberattacks. Yian Lee reports on the “soft militarization” of Taiwanese civilians for Bloomberg.\n\nParting Image\n\nOn this date in 1979: President Jimmy Carter shakes hands with the crowd as he perches on the roof of his car in a motorcade through Bardstown, Kentucky. Carter spoke at a local high school after the parade. | Bob Daugherty/AP\n\nJacqueline Munis contributed to this newsletter.\nDid someone forward this email to you? Sign up here.\n\nFollow us on X\n\nCharlie Mahtesian @PoliticoCharlie\nCalder McHugh @calder_mchugh\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}