{
  "file_name": "2025-08-01_150227_email.html",
  "date": "2025-08-01",
  "subject_line": "Transgender Women Banned from Women’s Olympic Sports",
  "playbook_type": "transgender_sports_newsletter",
  "authors": [
    "Emma Cordover"
  ],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Emma Cordover\n\nIllustration by Claudine Hellmuth/POLITICO (source images via iStock)\n\nGood morning, it’s Aug. 1. How are you surviving the East Coast rain? Reach out to us: ecordover@politico.com and klong@politico.com. \nAs of today, transgender women will no longer be allowed to compete in U.S. women’s Olympic sport competitions.\nThe United States Olympic and Paralympic Committee changed its policy Monday to comply with President Donald Trump’s executive order, “Keeping Men Out of Women’s Sports.” The policy change, which goes into effect today, takes the decision to include trans women away from the national governing bodies of each sport.\nUSOPC is the latest organization to change its policies this year in the wake of Trump’s executive order. The Education Department changed its Title IX enforcement policy to exclude discrimination on the basis of gender identity and sexual orientation in January, and the National Collegiate Athletic Association banned trans women from playing women’s collegiate sports in February. The move has prompted both intense criticism and fervent support from women’s rights groups.\nThe news came as a “relief” to Nancy Hogshead-Makar, a three-time Olympic gold medalist, lawyer, founder of Champion Women and co-founder of the Women’s Sports Policy Working Group, nonprofit legal advocacy groups for women in sports.\nShe tells Women Rule that “as a longstanding Democrat, I am appalled at other women's organizations that don't” support this change.\nAs Hogshead sees it, transgender women competing in women’s sports is unfair and threatens important all-women spaces like “women's changing spaces, bathrooms, rape crisis centers, homeless shelters, prison cells, because of male violence, which is literally 50 times that of female violence.”\nOn the other hand, Shiwali Patel, senior director of safe and inclusive schools at the National Women’s Law Center, says the development “was very alarming and shameful.”\n“The USOPC is capitulating to the Trump administration’s unlawful demands,” Patel continues. “We are a women's rights organization. …We know there are very real issues to address when it comes to protecting the rights of women and girls in sports, and that banning trans women from women's sports doesn't do that. In fact, it also leaves women vulnerable to humiliating and invasive sex testing practices.”\nHogshead shares that she was sex-tested herself while qualifying for the Olympics and says the experience is invasive and uncomfortable — but one she ultimately welcomed.\n“It is as invasive as you can imagine, and who wants it the most? Who wants that kind of invasive testing? Athletes. They're the ones that call for it, the administrators don't want it … But the athletes, they want clean competition.”\n“Boys before puberty still have a significant advantage over girls,” Hogshead says, an advantage of up to 10 percent. “To somehow imply that women working harder can close a 10 percent gap is just so insulting to women.”\nPatel disagrees. Trans women and girls, she says, have been competing in women’s and girls’ sports for years, with no evidence of them having an unfair advantage on the playing field.\n“Trans women are not dominating women's sports,” Patel says. “So all of this is just a false distraction.It's a false narrative.”\nLast year, the United Nations published a study that found that “transgender athletes competing in women's athletic events have won nearly 900 medals over their competitors.” But another 2024 study by the British Journal of Sports Medicine found that transgender women athletes may actually have several disadvantages when competing with cisgender women, such as weaker lower-body strength and lung function.\nGiven “the educational benefits and emotional benefits, the academic benefits” from playing sports, Patel says, “no students should be denied that opportunity just because of who they are.\"\nUSOPC responded to a request for comment by pointing to its online statement: “Preserving and expanding opportunity across all sports is essential to maintaining our competitive edge and inspiring the next generation.\"\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nPOLITICO Special Report\n\nCamille Cohen/AFP via Getty Images\n\n‘She Had Reasonable Doubt’: Why Kamala Harris Isn't Running for Governor by Melanie Mason for POLITICO: “Six months ago, Kamala Harris took a break from packing up the vice president’s residence to attend a quiet meeting on Capitol Hill with a group of Black congresswomen. She had advice for them on how to steel themselves for a second Trump administration.\nBut since that meeting on the Hill, a Harris gubernatorial bid had become almost a foregone conclusion in California political circles. Her deliberations froze the 2026 contest to succeed Gov. Gavin Newsom in a state of paralysis. Public polling consistently showed Harris would start the race as the prohibitive favorite.\nUltimately, however, Harris’ heart wasn’t in it.”\nDemocrats Sue Over Efforts to Defund Planned Parenthood by Rachel Bluth for POLITICO: “Attorney General Rob Bonta and 22 other Democratic attorneys general and governors are suing the Trump administration over a bid to strip federal funds from Planned Parenthood clinics.\n‘We need to just call it what it is: punishment for Planned Parenthood’s constitutionally protected advocacy for abortion,’ Bonta said at a press conference Tuesday morning. ‘The hypocrisy is really hard to ignore: a party that claims to be defenders of free speech only seem to care about it when it aligns with their own agenda.’”\nMcBride Blames Netanyahu for Gaza Famine by Cheyanne M. Daniels for POLITICO: “Rep. Sarah McBride blamed Israeli Prime Minister Benjamin Netanyahu for the humanitarian crisis in Gaza, saying his government has a responsibility for “facilitating the conditions.”\nIn an interview with POLITICO’s Dasha Burns for “The Conversation” podcast, McBride (D-Del.) condemned Israel’s blockade policies as the driving force behind the famine unfolding in the Middle East.”\n\nNumber of the Week\n\nRead more here.\n\nMUST READS\n\nI-Hwa Cheng/AFP via Getty Images\n\nSouth Asian Women Will Be Hurt by the Trade War by The Economist: “The participation rate of women in the labour markets of South Asia is in general woefully low. The region’s garment factories, however, are exceptions. In Bangladesh and Sri Lanka around two-thirds of those behind the sewing machines are women. The industry has pulled millions of them into the workforce while spearheading the countries’ economic growth since the 1980s. But much hinges on selling cheap t-shirts and shoes to a country whose president’s favourite word is tariffs.”\nRepublican States Press Congress to Ban Abortion Shield Laws by Alejandra O’Connell-Domenech for The Hill: “More than a dozen Republican-led states are urging Congress to ban abortion shield laws, pieces of legislation passed in states where abortion is legal that protect abortion providers from liability for violating anti-abortion laws in other states.\nA total of 15 GOP attorneys general signed and sent a letter to congressional leadership this week requesting federal action be taken to preempt abortion shield laws, arguing they interfere with states’ ability to enforce criminal laws.”\nVirginia Giuffre’s Family Responds to Trump’s Claim That Epstein ‘Stole’ Her by Alan Feuer and Matthew Goldstein for the New York Times: “The family of Virginia Giuffre, a woman who accused Jeffrey Epstein of sexually abusing her as a teenager, released a statement on Wednesday night expressing outrage about President Trump’s recent remarks about her, in which he confirmed an account that Mr. Epstein had hired her away from her job in the spa at Mar-a-Lago, Mr. Trump’s private club in Florida.\nOn Tuesday, while answering questions from reporters, Mr. Trump said that Mr. Epstein “stole” Ms. Giuffre from Mar-a-Lago while she was working there as a spa attendant. Ms. Giuffre has long maintained that Ghislaine Maxwell, Mr. Epstein’s longtime associate, met her at the club and recruited her to serve as a masseuse for Mr. Epstein, but Mr. Trump’s comments on Air Force One appeared to be the first time he had personally confirmed her story.”\n\nQUOTE OF THE WEEK\n\nRead the full story here.\n\non the move\n\nThe Treasury Department is adding Alley Adcock as deputy assistant secretary for legislative affairs, appropriations and management. She most recently was a professional staff member on the House Appropriations Commerce-Justice-Science Subcommittee. (h/t POLITICO Playbook)\nEllen Murray has joined Simon & Co. as of counsel. She was most recently Democratic staff director of the Senate Appropriations Financial Services Subcommittee. (h/t POLITICO Influence)\nRachel Chiu is now a member of the government relations team at the LA28 Olympic & Paralympic Games. She previously was special assistant to the president and chief of staff of the Biden White House’s Office of Political Strategy and Outreach and is a Kamala Harris presidential campaign alum. (h/t POLITICO Influence)\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nFollow us on X\n\nKatherine Long @katherinealong\nEmma Cordover @Emma_Cordover\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}