{
  "file_name": "2025-08-03_153540_email.html",
  "date": "2025-08-03",
  "subject_line": "It’s Trump's economy now",
  "playbook_type": "national_playbook",
  "authors": [
    "Zack Stanton",
    "Eli Okun",
    "Bethany Irvine",
    "Ali Bianco"
  ],
  "sponsor": "The Vapor Technology Association",
  "text": "Aug 03, 2025\nView in browser\n\n By Zack Stanton\n\n Presented by \n\nWith help from Eli Okun, Bethany Irvine and Ali Bianco\nGood Sunday morning. It’s Zack Stanton. Get in touch.\nTHE CONVERSATION: Within days of her election in November, Rep. Sarah McBride (D-Del.), faced backlash from some House Republicans for being transgender. In the face of those attacks, McBride has sought ways to forge ties across the aisle, animated partly by her hope of bringing “a sense of kindness and grace” to Congress despite the “reality TV show nature” of today’s politics, she tells Playbook’s Dasha Burns on today’s episode of “The Conversation.”\n\nListen in: The two also discuss the ongoing humanitarian crisis in Gaza, how the Democratic Party can rebuild its coalition without “reinforcing right-wing framing” over “culture war” issues and why her pursuit of bipartisan legislation is in part a direct response to President Donald Trump. Watch the full episode … Subscribe to “The Conversation” on YouTube, Apple Podcasts or Spotify\n\nDRIVING THE DAY\n\nPresident Donald Trump boards Air Force One on Aug. 1, 2025 at Joint Base Andrews, Maryland. Trump is traveling to Bedminster, New Jersey for the weekend. | Anna Moneymaker/Getty Images\n\nWELCOME TO THE VIBE SHIFT: For months, Trump has boasted that under his leadership, America is the “hottest” country in the world. (He repeated that claim overnight in a social media post at 1:49 a.m.) Now, he’s at risk of being burned by those expectations.\nOn Wednesday, new GDP numbers showed that in the first half of the year, the economy grew at an annual rate of less than 1.3 percent.\nOn Thursday, new inflation numbers showed that the personal consumption expenditures price index jumped by 2.6 percent in the year ending in June — an acceleration of the inflation rate from April.\nOn Friday, the new jobs report showed that net hiring has “plummeted over the past three months with job gains of just 73,000 in July, 14,000 in June and 19,000 in May,” in the words of the AP. And behind those topline numbers was a striking datapoint, the WSJ’s Te-Ping Chen and Harriet Torry note: “The number of people unemployed for at least 27 weeks topped 1.8 million, the highest level since 2017, not counting the pandemic’s unemployment surge.”\nThis morning, it’s clear that a new consensus is emerging: For all the talk of a new “Golden Age,” there are abundant signs that the economy, while at times glittering, may not be gold.\nSimply put: “Job gains are dwindling. Inflation is ticking upward. Growth has slowed compared with last year,” AP’s Josh Boak and Christopher Rugaber write. “[T]his is not the boom the Republican president promised, and his ability to blame his Democratic predecessor, Joe Biden, for any economic challenges has faded as the world economy hangs on his every word and social media post.”\nIndeed, nearly 200 days into his second term, even members of Trump’s administration are signaling that the window during which Biden could be blamed has now passed. The “Trump economy has arrived,” Commerce Secretary Howard Lutnick said on Wednesday. “Biden’s first quarter is behind us, and growth is already accelerating.”\nTrump has made himself central to the economy. “After campaigning on a pledge to free business from worrying about Washington’s dictates, Trump has made public policy — and his own norm-busting behavior — the primary variables affecting the $30 trillion U.S. economy, economists said,” WaPo’s David Lynch and Abha Bhattarai report. Washington, they write, is now “the focus of business and investment decision-making.”\nThat’s unlikely to change anytime soon. Among the reasons why, two loom large: the coming economic impact of Trump’s tariffs, and new concerns about the reliability of government economic statistics going forward.\n\nA message from The Vapor Technology Association:\nThe U.S. vaping industry and tens of thousands of small businesses are at risk. A Biden-era task force and rogue FDA and CBP bureaucrats are blocking all flavored vapes from entering the U.S. These bureaucrats are undermining President Trump’s promises to protect our children from illicit vapes and save flavored vaping.\n\n President Trump: Tell the FDA and CBP to stop banning vapes – vaping voters and small businesses are counting on you.\n\nLearn more.\n\nON THE TARIFFS: “Companies are starting to shift more tariff-related costs onto consumers,” NYT’s Sydney Ember reports in an A1 story this morning. “Many businesses chose to absorb the additional tax during the early days of President Trump’s trade war. But evidence is emerging that they are running out of options to keep prices stable in the face of deteriorating profit margins, suggesting that the tariffs could have a more pronounced effect on prices in the months ahead.”\nYes, the inflationary effects of Trump’s tariffs have been muted thus far. But economists “cite several reasons for that limited impact,” Ember writes. “Companies across the country raced to stockpile goods before any tariffs kicked in, giving them a significant cushion before they had to import goods subject to higher levies. Many businesses, big and small, were reluctant to pass along higher costs to their inflation-weary customers without more clarity on where the tariffs would settle.”\nA new economic divide: Now that the policy is settling into place, a “divide is widening in the US economy as the biggest banks and technology groups shrug off Donald Trump’s tariffs to post huge earnings gains while consumer-facing companies struggle with rising costs,” FT’s George Steer writes this morning.\nStat of the day: In total, 52 percent of the S&P 500 companies that have posted Q2 results reported declining profit margins, FT reports, citing Société Générale, a financial services company based in France. Companies reported margin pressure even as their sales rose, which suggests “that their costs are going up but that companies aren’t yet passing this on” to consumers, Andrew Lapthorne, the firm’s head of quantitative research, told the FT.\nON THE DATA: On Friday, Trump ordered his team to fire Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, after the jobs report showed weaker numbers than expected for July and downgraded the May and June figures. That’s igniting “worries that Trump’s volatile temperament could cause additional economic harm by undermining market confidence in the government data that investors, business executives and policymakers require to make decisions,” WaPo’s Lynch and Bhattarai write.\n“If policymakers and the public can’t trust the data — or suspect the data are being manipulated — confidence collapses and reasonable economic decision-making becomes impossible,” Heidi Shierholz, the president of the center-left Economic Policy Institute and former chief economist of the Labor Department, told the Post. “It’s like trying to drive a car blindfolded.”\n\nA message from The Vapor Technology Association:\nPresident Trump understands what voters want – flavored vapes to quit smoking.\n\n That’s why VTA supports a crackdown on illicit vapes targeting youth while encouraging him to keep his promise to save flavored vaping.\n\n President Trump: Stop bureaucrats blocking Americans’ freedom to vape and killing small businesses.\n\nLearn more.\n\nSUNDAY BEST …\n— U.S. Trade Representative Jamieson Greer on the new tariffs and future trade deals, on CBS’ “Face the Nation”: “These tariff rates are pretty much set. I expect I do have my phone blowing up. There are trade ministers who want to talk more and see how they can work in a different way with the United States, but I think that we have, we’re seeing truly the contours of the president's tariff plan right now with these rates.”\n— National Economic Council Director Kevin Hassett on the jobs numbers on “Fox News Sunday”: “When the data are unreliable, when they keep being revised all over the place, then there are going to be people that wonder if there’s a partisan pattern in the data. … And so, I think what we need is a fresh set of eyes at the [Bureau of Labor Statistics], somebody who can clean this thing up.”\n— Sen. Alex Padilla (D-Calif.) on the firing of the head of the BLS, on NBC’s “Meet the Press”: “That’s what confirmation hearings are supposed to be about, is it going to be somebody that will maintain the independence of the Bureau of Labor Statistics, like so many other departments and agencies that need to have the independence from political pressure of the White House to do their job reliably? Or will this be another yes person for the president that’s going to be more interested in propaganda than statistics, more interested in propaganda than the facts?”\n— Doctors Without Borders USA CEO Avril Benoît on the starvation in Gaza on ABC’s “This Week”: “We need to flood the zone with as much food as possible. The problem with the [Gaza Humanitarian Foundation] is, of course, it’s unsafe. It’s an inefficient way to deliver aid. People have to cross very unsafe zones to reach those areas that are controlled by the IDF and military contractors from the U.S., and then there are insufficient quantities.”\nTOP-EDS: A roundup of the week’s must-read opinion pieces.\n\n“After 47 years on the political beat for The Post, it’s transition time,” by WaPo’s Dan Balz\n“How Democrats Can Win on Immigration,” by Neera Tanden for WSJ\n“The Death of Democracy Promotion,” by Brian Klaas for the Atlantic\n“845,000 dead on U.S. highways. Why not address the main cause?” by Josh Max for WaPo\n“Vinay Prasad Is a Bernie Sanders Acolyte in MAHA Drag,” by WSJ’s Allysia Finley\n“The Anti-Abundance Critique on Housing Is Dead Wrong,” by Derek Thompson\n“Israel Must Open Its Eyes,” by NYT’s David French\n“The Fact Checker rose in an era of false claims. Falsehoods are now winning,” by WaPo’s departing fact-checker Glenn Kessler\n“The folly of Harris 2028,” by WaPo’s Matt Bai\n“Europe’s Future Depends on Confrontation, Not Compromise,” by Garry Kasparov and Gabrielius Landsbergis for POLITICO Magazine\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\n9 THINGS FOR YOUR RADAR\n1. RECESS BEGINS: Senators left Washington yesterday to begin their long-awaited August recess. Republicans left without locking in a deal to confirm dozens of nominations that Trump has put forward, but Senate Majority Leader John Thune has vowed to return in the fall to clear the deck after Trump privately told Republicans to go home and cut negotiations with Democrats, POLITICO’s Jordain Carney reports.\nThe U-turn: Thune and Minority Leader Chuck Schumer had a path forward on the floor (which hadn’t been formalized) that would have exchanged a tranche of confirmations for the release of withheld NIH and foreign aid funding, Jordain writes. That came after Republicans seemed adamant on Saturday about getting the nominations resolved this weekend, whether by cutting a deal, changing the confirmation rules or by adjourning to allow recess appointments.\nThe Trump of it all: “The president is fed up,” Sen. Markwayne Mullin (R-Okla.) said. Trump manned the phones yesterday for conversations with some key GOP senators, and late last night he blasted Schumer for “political extortion” on Truth Social and urged all Republicans to head out. Thune teed up seven final nominees for confirmation votes last night before moving on to recess. Among the newly confirmed: Jeanine Pirro, the former Fox News host, now formally the U.S. attorney for D.C. following a 50-45 vote.\nWhat Thune is thinking: He’s already preparing for the possibility of speeding up the process with a rules change come September. “I think they’re desperately in need of change,” Thune said, per AP’s Mary Clare Jalonick and Joey Cappelletti. “I think that the last six months have demonstrated that this process, nominations is broken. And so I expect there will be some good robust conversations about that.” What Schumer is thinking: He defended the Democrats’ response, saying “historically bad nominees deserve historic levels of scrutiny.”\nStill in limbo: The nominations of Mike Waltz as UN ambassador and Kimberly Guilfoyle for U.S. ambassador to Greece, CBS’ Cristina Corujo notes. It’s still unclear if the Senate will take up nominations as soon as they come back on Sept. 2, or if they’ll wait until after the shutdown deadline.\n2. PROMISES BROKEN?: “White House has no plan to mandate IVF care, despite campaign pledge,” by WaPo’s Riley Beggin and Jeff Stein: “The White House does not plan to require health insurers to provide coverage for in vitro fertilization services, two people with knowledge of internal discussions said … In addition, White House officials are backing away from proposals discussed internally to mandate IVF coverage for the roughly 50 million people on the Obamacare exchanges … It is unclear whether the administration plans to ask lawmakers to take up a bill, but the two people said that forcing insurance companies to cover IVF is not currently on the table.”\n3. TRADING PLACES: India will continue purchasing Russian oil even as Trump threatens penalties, Reuters’ Shivam Patel and Chandni Shah report. Trump said Friday that he was told India would stop the trade with Russia. But sources in India’s government said no policy changes have been made. It’s the latest instance of an increasingly sour relationship between the U.S. and India, one tied not just to trade, but also Trump’s claimed credit over the end of India’s brief conflict with Pakistan, WSJ’s Alex Ward and colleagues write.\nOn the tariffs: As the final deals in Trump’s trade war emerge, Myanmar is still optimistic it can come to an agreement with the U.S. that would decrease its new 40 percent tariff levels, per Bloomberg’s Khine Lin Kyaw. But in Switzerland, investors are bracing themselves for the market’s reopening tomorrow after Trump’s 39 percent tariff announcement came during Swiss National Day, Bloomberg’s Gary Parkinson and colleagues report.\nElsewhere on the economy: Though Washington has increasingly come down on electric vehicles, they’re not going anywhere, writes NYT’s Jack Ewing, as the cars become cheaper and tariff resilient. … Fed officials say the U.S. labor market is still solid despite the July jobs report, WSJ’s Nick Timiraos scooped. … As Fed Governor Adriana Kugler announced her resignation on Friday, Trump now has an opportunity to install someone at the Fed to push for interest rate cuts, Bloomberg’s Christopher Condon and Amara Omeokwe report.\n4. THE CRISIS IN GAZA: Special envoy Steve Witkoff told the families of Israeli hostages yesterday that the U.S. has a plan to bring home all of the remaining hostages in a deal with Hamas that could soon end the war, WaPo’s Gerry Shih reports from Jerusalem. Trump “now believes that everybody should come home at once, no piecemeal deals. That doesn’t work and we’ve tried everything,” Witkoff said. He added that Hamas was ready to disarm itself, which the group denied.\nNot a moment too soon: The starvation and struggle over aid continues to ravage the Gaza strip. Hundreds of thousands of people are overrunning aid convoys out of desperation for access to food, WaPo reports. Though the Trump administration claims it has given over $60 million in aid to Gaza, the State Department has only pledged half that amount and only a fraction has been issued in Gaza so far, per WaPo’s Karen DeYoung. More on the starvation in Gaza from the NYT\nBack in Washington: Pro-Israel Democrats are increasingly publicly breaking with PM Benjamin Netanyahu and circulating a letter in the House to potentially recognize a Palestinian state, CNN’s Isaac Dovere reports.\nRelated read: “Mike Huckabee, Israel’s Passionate Defender as Gaza War Drives Allies Away,” by NYT’s Elisabeth Bumiller\n5. IMMIGRATION FILES: DOJ is walking back Stephen Miller’s touted goal of 3,000 ICE arrests per day, as the Trump administration told federal judges last week that this quota doesn’t exist, POLITICO’s Kyle Cheney and Josh Gerstein write. That figure has emerged in multiple lawsuits over the administration’s deportation drive, and its denial is the “latest example of a gulf between what White House advisers say in public and what the Justice Department says in court.” It also comes as an appeals court on Friday upheld the block on the seemingly indiscriminate immigration raids in Los Angeles.\nDade County, all day: Billionaire Michael Fernández is behind the new ads in Miami blasting its representatives in Congress over the mass deportations of immigrants, telling NYT’s Patricia Mazzei that he hopes to “wake up the conscience” of Miami’s Cuban GOP voters. … But Latino representatives in Congress, including Miami’s own Cuban Republicans, are already concerned Trump’s deportations could backfire with Latino voters, WaPo’s Marianna Sotomayor writes.\nDeep in the heart: “Trump’s Border Wall Is Back—and So Is His Fight With Texas Landowners,” by WSJ’s Elizabeth Findell\n\nA message from The Vapor Technology Association:\n\n6. FROM THE WILDERNESS: New campaign finance filings reveal some Democrats are already revving themselves up for 2028, with former Transportation Secretary Pete Buttigieg raising $1.6 million with his PAC and some Democratic governors raising hundreds of thousands as well, POLITICO’s Jessica Piper and Elena Schneider report. … Kamala Harris told Stephen Colbert she doesn’t “want to go back in the system” right now, and some Democrats are hoping she doesn’t in 2028 either, POLITICO’s Dustin Gardiner and colleagues write. … Democrats are increasingly turning to veterans across the country, NYT’s Shane Goldmacher reports, as the party tries to shift away from its currently unpopular branding.\nSurvey says: Democratic voters see their party as “weak” or “ineffective,” with one-third describing the party negatively in a new AP-NORC poll, per AP’s Steve Peoples and colleagues.\n7. A HOMECOMING FOR WILES: White House chief of staff Susie Wiles returned to her home state of Florida on Saturday night to receive the “Statesman Award” from the Republican Party of Florida, Kimberly Leonard writes in to Playbook. Speaking before the Red Florida Dinner at the Rosen Shingle Creek in Orlando, Wiles called her job “a dream beyond anything I could ever have imagined,” adding: “The golden age of America is here, because Donald Trump is in the White House.”\nThe evening was a testament to how Wiles helped transform Florida from a purple to a red state in just a few election cycles — first with Rick Scott’s 2010 campaign for governor, then for Gov. Ron DeSantis’ first gubernatorial campaign in 2018. She also led Trump’s Florida operation in 2016 and 2020 and ultimately led his 2024 comeback to the White House. Now, many Floridians she has worked with over the years are in the administration. “Honestly, Floridians overpopulate the West Wing in a really big way,” Wiles said to applause.\nWiles’ band of loyalists heaped praise on her throughout the evening. Top Trump pollster Tony Fabrizio called the award “long overdue.” Chris LaCivita praised Wiles as “inarguably” the best in the field. Deputy chief of staff James Blair said Wiles “deserves all the credit she gets and then some.” VP JD Vance delivered a surprise video greeting, crediting Wiles with keeping the White House “on track and on schedule” while also being a “ruthless political operator.” And Trump capped off the love fest in his own video message, saying he was unsure whether to call her a “statesman” or “stateswoman,” but concluding: “You are the person of the year in my book.”\n8. DEMOCRACY WATCH: DOJ is expanding its efforts to get access to voter data and election information, sending letters and emails and phone calls to get copies of voter registration lists in at least 15 states, AP’s Ali Swenson and Gary Fields report. That includes “all records” from the 2024 election and any records retained from 2020, and it’s raising red flags with some state officials. In one instance in Colorado, consultant Jeff Small asked Republican officials if they would give a third party access to election information, and that he was acting on a request from Stephen Miller, per CNN’s Fredreka Schouten.\n9. RETRIBUTION CORNER: “Agency Scrutinizes Jack Smith After Republican Complaint,” by NYT’s Devlin Barrett: “An agency that scrutinizes the conduct of federal employees has opened an investigation into Jack Smith, the former special counsel who investigated Donald J. Trump before he returned to office … The Office of Special Counsel confirmed on Saturday that it had opened an investigation into Mr. Smith for a possible violation of the Hatch Act, a law that prohibits federal workers from using their government jobs to engage in political activity. … Senator Tom Cotton, Republican of Arkansas, had asked the agency to investigate.”\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nTALK OF THE TOWN\n\nPLAYBOOK METRO SECTION — “Smithsonian to restore Trump to impeachment exhibit ‘in the coming weeks,’” by WaPo’s Jonathan Fischer and Samantha Chery: “The Smithsonian said on Saturday that it would restore information about President Donald Trump’s two impeachments to an exhibit in the National Museum of American History within weeks.”\nSOUNDS LIKE VEEP — After Alan Dershowitz got into it with a farmer’s market vendor on Martha’s Vineyard who refused to sell him a pierogi, Crooked Media’s Matt Berg published the corresponding police report. The highlight: “Dershowitz stated he was going to spread the word to others at the market to not buy from the pierogi booth,” the report reads. At a nearby lemonade stand, a cop warned him not to. It concludes: “Shortly after, the lawyer departed, pierogiless.”\nFIRST IN PLAYBOOK — K STREET FILES: AECOM, the giant infrastructure firm the White House picked to lead the engineering team for the construction of the $200 million White House ballroom being built with private money, is registered with Ballard Partners, the powerhouse lobbying firm with ties to chief of staff Susie Wiles, POLITICO’s Daniel Lippman writes in.\nAECOM has paid Ballard Partners $120,000 to lobby the White House and Congress this year, according to lobbying records. The firm run by Brian Ballard, a top Trump fundraiser, registered for AECOM a week after the election. The initial listing said it was lobbying Congress and the State Department, but in the second quarter it added the White House.\nWiles told Playbook in an email that she has never represented AECOM, adding she didn’t “know how they were selected, but I was never lobbied about any of the contractors or involved in any way.” Ballard declined to comment. Spokespeople for AECOM didn’t respond to a request for comment.\nAECOM has received numerous federal contracts since the start of the Trump administration, including an Air Force contract worth up to $1.5 billion and at least two major contracts from the Army Corps of Engineers. A White House official pointed Playbook to data showing AECOM has also been a major contractor for the government during Democratic administrations and that two-thirds of AECOM’s contributions in the 2024 cycle went to Democrats.\nWiles worked for Ballard from 2011 to 2019, helping open up its D.C. office. Stories about the firm often include the fact that he used to employ Wiles. AG Pam Bondi also is an alum of the firm. Ballard Partners has risen to the top of the K Street ranks in the months since Trump’s reelection.\nSpeaking of the ballroom: “Experts Raise Concerns Over Trump’s White House Ballroom Renovation Plans,” by NYT’s Ashley Ahn\nHAPPY BIRTHDAY: Sen. Chris Murphy (D-Conn.) … Reps. Gabe Vasquez (D-N.M.) and Ryan Mackenzie (R-Pa.) … Bernadette Meehan (5-0) … KFF Health News’ Rachana Pradhan … Matthew Foldi … ABC’s Ben Siegel and John Parkinson … Scott Parkinson … Claire Olszewski of the Obama Foundation … Jeff Dressler of SoftBank … Tom Freedman … Matt Compton … former Sen. Roland Burris (D-Ill.) … Jordan Burke … Erikka Knuti … Katherine Robertson of Alabama AG Steve Marshall’s office … Graham MacGillivray … Jessica Ennis Kitelyn … Brian Morgenstern … City Journal’s Brian Anderson … Dow Jones’ Clarissa Matthews … Joe Ramallo of Sen. Bill Cassidy’s (R-La.) office … Jay Caruso … Rachael Shackelford Dussuau … Reuters’ Brad Brooks … Ken Nahigian … DNC’s Emma Bailey … James Wegmann of Stand Together … Jacob Weisberg of Pushkin Industries … Andrew Craft … POLITICO’s Jasmine Turner and Bemi Ukuedojor … Dmitri Mehlhorn … Sydney Hilbush of Rep. John Garamendi’s (D-Calif.) office\nDid someone forward this email to you? Sign up here.\nSend Playbookers tips to playbook@politico.com or text us on Signal here. Playbook couldn’t happen without our editor Zack Stanton, deputy Garrett Ross and Playbook Podcast producer Callan Tansill-Suddath.\n\nA message from The Vapor Technology Association:\nNearly 500,000 Americans die annually from smoking cigarettes. 67% of Trump voters say government should promote vapes to help Americans quit smoking – and all Americans need President Trump to save flavored vaping now.\n\n VTA stands with President Trump in cracking down on the bad actors who sell vapes targeting youth. However, a Biden-era FDA task force is out of control – wasting CBP resources on vapes, rather than human traffickers – banning vapes from the market. The vape blockade is a de facto ban on flavored vapor products nationwide, which is already shutting down small businesses.\n\n It’s time to protect this multibillion-dollar American industry and stand up for American adults’ freedom to vape.\n\n President Trump, stop the bureaucrats from undermining your promise to save flavored vaping. Don't let Biden’s task force fulfill his plan to destroy legitimate businesses and hurt American consumers. American vapers are counting on you.\n\nLearn more.\n\nFollow us on X\n\nJack Blanchard @Jack_Blanchard_\nDasha Burns @DashaBurns\nAdam Wren @adamwren\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Canada Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}