{
  "file_name": "2025-08-01_174530_email.html",
  "date": "2025-08-01",
  "subject_line": "A wobbly jobs report shakes Trump’s economy",
  "playbook_type": "national_playbook",
  "authors": [
    "Eli Okun"
  ],
  "sponsor": "The Vapor Technology Association",
  "text": "Aug 01, 2025\nView in browser\n\n By Eli Okun\n\n Presented by \n\nTHE CATCH-UP\n\nBREAKING: “Trump, escalating war of words with Russia’s Medvedev, mobilizes two nuclear submarines,” by POLITICO’s Eli Stokols\n\nToday's jobs numbers pose a fresh challenge for President Donald Trump. | Anna Moneymaker/Getty Images\n\nJOBS DAY: The latest jobs data today painted a picture of a much softer labor market all summer than was previously known, raising fresh fears about the health of the U.S. economy and — in combination with President Donald Trump’s new tariffs — sending markets lower.\nThe toplines: American employers added 73,000 jobs in July, per the latest data, lower than economists had expected. Growth was largely concentrated in the health care sector, and the overall unemployment rate ticked up to 4.2 percent. Wages were up 3.9 percent annually, outpacing inflation. But the big shock came in revisions to the May and June jobs numbers, which defied fears at the time but have now come in at a combined 258,000 jobs fewer than previously reported, per Reuters.\nWhat’s going on? It’s a game changer of a Labor Department report that shows the labor market in a precarious state, with May and June job creation at very low levels. Economists tell WaPo’s Lauren Kaori Gurley and Andrew Ackerman that market uncertainty, fueled particularly by Trump’s trade and immigration policies, is to blame. And they fear that the weakness could get worse in the coming months as Trump’s tariffs really start to bite. On CNBC, White House Council of Economic Advisers Chair Stephen Miran today blamed seasonal factors, saying there was no evidence of tariffs as the culprit.\nDon’t check your 401(k): Stock markets slumped today on the latest data. The Dow, S&P 500 and Nasdaq were all down more than 1 percent by publication time. Ten-year Treasury yields also dropped lower, on the expectation that the Fed will now cut interest rates. More from the WSJ\nFed up: The Trump administration’s focus today’s jobs report was squarely on the Fed. Even before the report came out, Trump fumed about Chair Jerome Powell on Truth Social, “IF HE CONTINUES TO REFUSE, THE BOARD SHOULD ASSUME CONTROL, AND DO WHAT EVERYONE KNOWS HAS TO BE DONE!” And though the central bank has been cautious about lowering rates too quickly as inflation remains elevated, the worsening job market could indeed make a rate cut in September likelier, POLITICO’s Victoria Guida writes. The two Fed governors who dissented from this week’s interest-rate decision today issued statements warning of the perils of “wait and see.”\nTrading places: All this tension comes amid a banner day for Trump’s trade policies, as the world digests the reality of the significantly more protectionist era in global commerce he’s ushered in. After last night’s announcement, and with a week until the higher tariff levels kick in across the world, several top U.S. trading partners remain without a deal or in active negotiations. Overall, the U.S. will see an effective tariff rate of about 18 percent on imports, down from the 28 percent Trump initially announced on April’s “Liberation Day” but way up from 2 to 3 percent at the start of Trump’s term, per WaPo.\nThe impact: Many of the effects for the U.S. economy remain to be felt. But around the world, Trump’s top targets that haven’t struck agreements are reeling:\n\nConfusion in Canada: Unlike other countries, there’s no weeklong reprieve here. U.S. tariffs of 35 percent on Canada are in effect as of today. And though PM Mark Carney said he’d keep negotiating, Ottawa is mostly baffled by the disparate treatment they’ve received relative to Mexico, NYT’s Ian Austen reports.\n\nShock in Switzerland: Trump’s 39 percent tariff rate on Switzerland — one of the highest in the world — has rattled the Swiss establishment, which seems to have made a “dramatic misreading of the mood in Washington,” Bloomberg’s Hugo Miller and colleagues report.\n\nTrouble in Taiwan: Taiwanese leaders said today they were continuing talks with the U.S., but the prospect for now of 20 percent tariffs — plus potentially more on semiconductors — remains a significant threat, NYT’s Meaghan Tobin and colleagues report.\n\nLament in Lesotho: Trump slapped Lesotho with a 15 percent tariff, down significantly from his initial threat of 50 percent. But even just the plan for the earlier, higher level was enough to wreak significant economic devastation in the country, as both NYT’s John Eligon and WSJ’s Alexandra Wexler capture in stories from Maseru this morning. Companies pressed pause and factories shut down in an industrial economy dependent on textiles, stranding thousands of workers. And the country is simultaneously struggling with the decimation of U.S. foreign aid.\n\nGood Friday afternoon. Thanks for reading Playbook PM. Drop me a line at eokun@politico.com.\n\nA message from The Vapor Technology Association:\nThe U.S. vaping industry and tens of thousands of small businesses are at risk. A Biden-era task force and rogue FDA and CBP bureaucrats are blocking all flavored vapes from entering the U.S. These bureaucrats are undermining President Trump’s promises to protect our children from illicit vapes and save flavored vaping.\n\n President Trump: Tell the FDA and CBP to stop banning vapes – vaping voters and small businesses are counting on you.\n\nLearn more.\n\n8 THINGS YOU NEED TO KNOW\n\n1. IMMIGRATION FILES: “Judge blocks Trump rapid-fire deportations for immigrants with parole status,” by POLITICO’s Kyle Cheney and colleagues: “U.S. District Judge Jia Cobb said in a ruling Friday that the Department of Homeland Security’s tactics — rapid-fire deportation proceedings with little to no chance to lodge challenges — amounted to changing the rules in the middle of the game for [hundreds of thousands of] people previously welcomed into the country on a temporary basis.”\nRelated news: “US plans to fund deportations from Costa Rica, document shows,” by Reuters’ Gram Slattery and Ted Hesson: “The U.S. State Department is planning to spend up to $7.85 million to help Costa Rica deport immigrants … under an arrangement similar to a Biden-era program that drew criticism from migrant advocates.”\n2. IT’S OFFICIAL: The Corporation for Public Broadcasting announced that it will begin to shut down, after Republicans rescinded its funding and senators left it out of next year’s appropriations bill.\n3. SCHOOL DAZE: The Daily Caller’s Reagan Reese scooped new details on the Trump administration’s crackdown on the University of California Los Angeles, Trump’s latest collegiate target. Four federal agencies are freezing a collective $339 million in research funding, alleging civil rights violations in the university’s diversity practices, treatment of transgender people and handling of antisemitism.\n4. HEADS UP: The Centers for Medicare and Medicaid Services is planning an experiment for some Medicare and Medicaid programs to cover Ozempic, Wegovy and similar drugs for weight-loss purposes, WaPo’s Paige Winfield Cunningham scooped. For people not on private insurance, the drugs have largely been available only for those with diabetes previously. This could be an innovative way for some obese and overweight Medicare and Medicaid recipients to access GLP-1s, following the administration’s decision this spring not to cover them for weight loss. Though they’ve been hailed as “miracle drugs” for obesity, GLP-1s are also controversial with top MAHA figures in the administration, and significant cost concerns remain.\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\n5. THE GOLDEN AGE: The Defense Department’s initial goal for testing the new Golden Dome missile defense system is to do it in the fourth quarter of 2028, CNN’s Natasha Bertrand and Zachary Cohen scooped. That’s an ambitious timetable for Trump’s big Pentagon space initiative to protect the whole country with a shield, which will require a lot of technological innovation and satellite construction. It would also place the high-profile test right around the next presidential election. And the project’s cost could balloon to hundreds of billions of dollars.\n6. EPSTEIN LATEST: Ghislaine Maxwell has been moved from a prison in Florida to a prison camp in Texas, a less restrictive facility, per CNN. The reason for the change isn’t clear yet, but the Jeffrey Epstein accomplice is appealing her conviction to the Supreme Court and met with Deputy AG Todd Blanche last week. Meanwhile, Bloomberg’s Jason Leopold scooped that the FBI redacted Trump’s name — and those of other people — in the Epstein files. Doing so is common practice in FOIA requests, and there’s no evidence of Epstein-related wrongdoing by Trump.\n7. THE SALES PITCH: As Congress heads home for the August recess, the messaging blitz is on for both parties to define the One Big Beautiful Bill Act in voters’ eyes. The DNC is holding events in every state, along with digital ads and billboard trucks in some targeted districts, with a particular focus on the bill’s sweeping Medicaid cuts, AP’s Steve Peoples reports. The Democrats are also getting a national training program underway to help more people become organizers and candidates.\nFacing the music: NRCC Chair Richard Hudson (R-N.C.) has newly encouraged House Republicans to start holding in-person town halls again, per POLITICO’s Meredith Lee Hill. But at an early one last night, Rep. Bryan Steil (R-Wis.) got a brutal reception in Elkhorn, per the Milwaukee Journal Sentinel’s Lawrence Andrea. And many Republicans are avoiding or sharply restricting such events, NOTUS’ Emily Kennard reports.\nInteresting read: NYT’s Sarah Kliff dives deep into the ideas behind Republicans’ Medicaid overhaul, beginning with the broadly popular belief that Americans should have to work to earn health insurance — and a shift from the longtime U.S. trajectory of gradually expanding coverage. There’s also “the belief that health insurance coverage isn’t actually an essential benefit. Research connecting health insurance to better health outcomes is surprisingly mixed, with multiple, large-scale studies either not finding a relationship or showing one only among especially sick patients. If this is true, it’s because the United States’ large uninsured population has forced the creation of a vast, ad hoc safety net that fills the gaps in a patchwork system.”\n8. VALLEY TALK: “In Trump’s Washington, Palantir is winning big,” by WaPo’s Elizabeth Dwoskin and colleagues: “The software and data analytics company has garnered at least $300 million in new and expanded business since Trump took office for his second term … Though [CEO Alex] Karp is a progressive who has largely supported Democrats, Palantir’s striking success over the last six months is a case study in how a changing ethos in Washington — toward cutting costs, embracing AI and empowering the private sector — is benefiting a particular company.”\n\nA message from The Vapor Technology Association:\nNearly 500,000 Americans die annually from smoking cigarettes. 67% of Trump voters say government should promote vapes to help Americans quit smoking – and all Americans need President Trump to save flavored vaping now.\n\n VTA stands with President Trump in cracking down on the bad actors who sell vapes targeting youth. However, a Biden-era FDA task force is out of control – wasting CBP resources on vapes, rather than human traffickers – banning vapes from the market. The vape blockade is a de facto ban on flavored vapor products nationwide, which is already shutting down small businesses.\n\n It’s time to protect this multibillion-dollar American industry and stand up for American adults’ freedom to vape.\n\n President Trump, stop the bureaucrats from undermining your promise to save flavored vaping. Don't let Biden’s task force fulfill his plan to destroy legitimate businesses and hurt American consumers. American vapers are counting on you.\n\nLearn more.\n\nTALK OF THE TOWN\n\nSun Chanthol, a Cambodian deputy PM, said his government would nominate Donald Trump for the Nobel Peace Prize.\nCatherine Cortez Masto shot back at Cory Booker: “I don’t need a lecture from anybody about how to take on and push back and fight against Donald Trump.”\nWHERE ARE THEY NOW — Omarosa Manigault Newman, who went from reality TV to the West Wing, is embarking on a new chapter: lawyer. “I’m going to trial work and complex litigation,” she said while attending the National Bar Association convention in Chicago this week, POLITICO’s Shia Kapos writes in.\nOmarosa, as she is known, recently graduated from Southern University Law Center with a JD/MBA and is studying to sit for the bar exam next year. She was named Law Student of the Year at the NBA’s centennial convention. Though she was once a voice for Trump on the airwaves and worked in the White House during his first presidency, she now describes herself as politically independent. “I am now just focused on my legal career and gladly considering retiring from politics after 20 years,” she said.\nOUT AND ABOUT — SPOTTED at a going-away party for the White House’s May Davis Mailman last night, hosted by Virginia Boney Moore in Georgetown: Will Scharf, Julia Hahn, Jim Goyer, Alex Pfeiffer, Jarrod Agen, Michael Kratsios, Paige Willey, Steve Bradbury, Dan Katz, Sam Mulopulos, Andrew Moore, Kate Lair, Derek and Liz Lyons, Lauren Culbertson Grieco and Chris Grieco, Michael Anton, Jeff Freeland, James Burnham, Josh Gruenbaum, William Kessler, Trevor Kellogg, Colton Snedecor, Steph Carlton, John Sauer, Sarah Harris, Ben Moss, Cooper Godfrey, Bryn Jeffers, Heidi Overton and Sam Adolphsen.\n— Rwandan Ambassador Mathilde Mukantabana and Irish Ambassador Geraldine Byrne Nason co-hosted a dinner last night in honor of Chief of Protocol Monica Crowley. SPOTTED: Austrian Ambassador Petra Schneebauer, Greek Ambassador Ekaterini Nassika, Monegasque Ambassador Maguy Maccario Doyle and Tunisian Ambassador Hanène Tajouri Bessassi.\nFIRST IN PLAYBOOK — Sarah Corley is launching Dynamique, a boutique strategic comms and image development company. She previously was longtime comms director for Rep. Tom Cole (R-Okla.).\nMEDIA MOVE — Sandhya Somashekhar is joining the NYT’s Washington bureau as domestic policy editor. She previously was deputy business and technology editor at WaPo.\nTRANSITIONS — David Marriott, an antitrust trial litigator, is joining Latham & Watkins as a partner. He previously was a partner at Cravath, Swaine & Moore. … Amanda Hunter will be VP of comms at the Women’s Suffrage National Monument Foundation. She previously was executive director of the Barbara Lee Family Foundation.\nWEEKEND WEDDING — Kat Atwater, founder and CEO of Community Tech Alliance, and Shreyes Seshasai, co-founder of Switchboard, celebrated their marriage Saturday at the Lansdowne Resort in Leesburg, Virginia, following a Sangeet ceremony the night before. They met on a conference call during the 2020 election, when Shreyes led the analytics engineering team on the Biden campaign and Kat worked at the DNC. Pic, via Katie Nesbitt … SPOTTED: Karuna Seshasai, Becca Siegel, Roger Lau, Amanda Coulombe, Michael Halle, Kyle Lierman and Amanda Brown Lierman, Lindsey Schuh Cortes, Meg Schwenzfeier, Maeve Ward, Christina Coloroso, Cristina Sinclaire, Molly Chapman Norton and Nell Thomas.\nDid someone forward this email to you? Sign up here.\nSend Playbookers tips to playbook@politico.com or text us on Signal here. Playbook couldn’t happen without our editor Zack Stanton, deputy editor Garrett Ross and Playbook Podcast producer Callan Tansill-Suddath.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nFollow us on X\n\nEli Okun @eliokun\nGarrett Ross @garrett_ross\nBethany Irvine @bethanyirvinee\nAli Bianco @_alibianco\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Ottawa Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our politics and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}