{
  "file_name": "2025-08-01_140058_email.html",
  "date": "2025-08-01",
  "subject_line": "Trump’s top brass turnover hits HHS",
  "playbook_type": "politico_pulse",
  "authors": [
    "Kelly Hooper",
    "Sophie Gardner",
    "Robert King"
  ],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Kelly Hooper and Sophie Gardner\n\nWith help from Robert King\n\nDriving the Day\n\nPresident Donald Trump has overseen a series of dismissals of high-level officials in HHS and other agencies. | Jacquelyn Martin/AP Photo\n\nYOU’RE FIRED! Since taking office, President Donald Trump has brusquely removed a number of top officials from their positions across departments who didn’t align politically with his administration. That upheaval has included a string of high-profile firings across the nation’s health agencies.\nThe pattern of dismissals highlights the growing tension between science and politics as Health Secretary Robert F. Kennedy Jr. implements his Make America Healthy Again agenda and reshapes federal policy on disease prevention, food and vaccines.\nMost recently, the FDA’s top vaccine regulator, Vinay Prasad, was given the boot after just three months on the job. The president ordered his removal this week, overriding Kennedy and FDA Commissioner Marty Makary, who opposed the move.\nBackground: Earlier this month, close Trump ally Laura Loomer began attacking Prasad, writing on her website that he was a “progressive leftist saboteur undermining President Trump’s FDA.” Other conservative voices, like former Sen. Rick Santorum (R-Pa.) and The Wall Street Journal editorial board, piled onto the criticism of Prasad and his approach to rare disease therapies under the FDA’s purview — a concern that Sen. Ron Johnson (R-Wis.) raised with the White House on Monday, a day before Prasad was fired.\nPrasad’s predecessor, Dr. Peter Marks, was also unceremoniously pushed out of the position four months ago, after leading the FDA’s vaccine division for more than eight years. In March, Marks abruptly resigned from his post as the FDA’s top vaccine regulator under pressure from Kennedy after his team concluded they needed a fresh start as part of a broader HHS reorganization. The ouster came as Marks had grown increasingly concerned by Kennedy’s attitude toward vaccines and was particularly at odds with the secretary over his tepid response to the Texas measles outbreak.\n“If Peter Marks does not want to get behind restoring science to its golden standard and promoting radical transparency, then he has no place at FDA under the strong leadership of Secretary Kennedy,” an HHS spokesperson told POLITICO in a statement at the time.\nZooming out: And there’s also been upheaval among Trump’s nominees for top positions at HHS. The White House abruptly scrapped former Florida Rep. David Weldon’s nomination to lead the CDC in March, just hours before his confirmation hearing, after determining he didn’t have the support to win confirmation on the Senate floor. Some Senate Republicans had expressed concerns about Weldon’s fringe views on vaccines.\nTrump also withdrew his first nominee for surgeon general, Dr. Janette Nesheiwat, in May, a day before her scheduled Senate confirmation hearing. The decision came after reports that Nesheiwat, an urgent care doctor and former Fox News contributor, obfuscated facts about her medical education. At the time, Loomer seized on the controversy and encouraged Trump to pick someone else.\nHours after pulling Nesheiwat’s nomination, Trump tapped wellness influencer Casey Means to serve as surgeon general. Means, the sister of top Kennedy adviser Calley Means, is still awaiting confirmation.\nWELCOME TO FRIDAY PULSE. President Donald Trump gave drugmakers an ultimatum yesterday: Lower your prices or face unknown consequences. Send your tips, scoops and feedback to khooper@politico.com and sgardner@politico.com, and follow along @kelhoops and @sophie_gardnerj.\nMORNING MONEY: CAPITAL RISK — POLITICO’s flagship financial newsletter has a new Friday edition built for the economic era we’re living in: one shaped by political volatility, disruption and a wave of policy decisions with sector-wide consequences. Each week, Morning Money: Capital Risk brings sharp reporting and analysis on how political risk is moving markets and how investors are adapting. Want to know how health care regulation, tariffs, or court rulings could ripple through the economy? Start here.\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nEye on Insurers\n\nCigna had a strong showing in second-quarter earnings this year. | Cigna via AP\n\nSTRONG EARNINGS FOR TWO KEY PLAYERS — Major health insurers Aetna and Cigna both reported strong financial results for the second quarter of 2025 on Thursday, despite the rising medical cost trends plaguing other major insurers this year.\nAt CVS Health’s Aetna, which shook up its leadership last year after it struggled to control costs with more members seeking medical care, has seen continual improvements in cost savings throughout 2025, executives said during an earnings call Thursday.\nMaking improvements at Aetna “has been a top priority” the company executed by enhancing its operations through technology and reducing “friction for our members and health care professionals,” said David Joyner, CEO of CVS Health. He pointed to changes Aetna made to its prior approval requirements — bundling prior authorizations for certain services like maternity care.\n“We’re starting to see the results of these efforts, delivering better experiences while also allowing us to better navigate this elevated utilization environment,” he said.\nAt Cigna, executives reaffirmed their 2025 guidance on Thursday. Its pharmacy business, Evernorth Health Services, drove a spike in revenue in the second quarter, even as its insurance segment’s revenue declined. Cigna’s cost trends were elevated in the second quarter but still in line with its expectations, said Cigna President and COO Brian Evanko during an earnings call.\nKey context: Other key players in the health insurance space, including Centene, Molina Healthcare and UnitedHealth Group, have slashed their yearly guidance over the past few months, citing rising medical costs across Medicaid, Obamacare and Medicare Advantage.\n\nAt the Agencies\n\nCMS FINALIZES HOSPITAL PAY BUMP — The Trump administration finalized on Thursday a $5 billion increase in payments to hospitals for inpatient care, Robert reports.\nThe pay bump from the Centers for Medicare and Medicaid Services takes effect in the next federal fiscal year that begins in October. It also includes a $2 billion bump in payments to hospitals with a high amount of charity care.\n\nVaccines\n\nCOVID VACCINE CONFUSION — Most Americans don’t expect to get a Covid-19 vaccine this fall, according to a KFF Tracking Poll on Health Information and Trust published today.\nNearly 60 percent of adults said they likely wouldn’t get the shot, while 40 percent said they would “definitely” or “probably” get it — mostly older adults (55 percent) and Democrats (70 percent). Among Republicans, 59 percent said they would “definitely not” get the vaccine.\nMost adults who plan to get the shot said they’re concerned about the vaccine’s availability and whether their insurance will cover it.\nWhy it matters: The findings come after Health Secretary Robert F. Kennedy Jr., a longtime vaccine skeptic, announced in May that the government would no longer recommend Covid vaccines for healthy pregnant people and children. The move has sparked pushback from public health experts and doctors — including some who sued Kennedy — arguing the move violated longstanding norms governing U.S. immunization policy.\nThe agency ultimately didn’t pull the recommendation from the CDC vaccine panel’s childhood schedule and instead downgraded it to “shared decisionmaking” — a differentiation that doctor groups say has made it harder for providers to counsel patients and for practices to assess insurance coverage. Kennedy and other top HHS officials have said there isn’t sufficient data to show that healthy children and healthy pregnant women benefited from Covid vaccination.\nIn June, Kennedy fired all 17 members of the CDC’s independent vaccine panel and replaced them with several vaccine skeptics. The panel recommends vaccines that insurers are then largely obligated to cover with no cost-sharing under the Affordable Care Act.\nMore findings: About half of parents with children under 18 said they don’t know whether federal agencies recommend healthy children get the Covid vaccine this fall, according to the KFF poll.\nAbout 20 percent of adults said Kennedy’s vaccine policy changes are making people safer, while 36 percent said they’re making people less safe. The remainder said they don’t know enough to say (31 percent) or that Kennedy’s changes won't make a difference (13 percent).\nThe national poll was conducted from July 8 to 14 online and by telephone among 1,283 U.S. adults.\n\nIn the States\n\nKRATOM WARS — Federal health officials’ push to schedule a controversial herbal supplement as a controlled substance has revived efforts among California lawmakers to regulate the product, called kratom, POLITICO’s Rachel Bluth reports.\nEarlier this week, HHS took initial steps toward classifying a derivative of kratom, 7-hydroxymitragynine, as a controlled substance after seeing a rise in overdoses and emergency-room visits linked to products containing 7-OH. The designation would place restrictions on the substance’s production, distribution and possession.\nWashington’s efforts to assert control have spurred California Assemblymember Jasmeet Bains to revisit her earlier attempt to regulate kratom in the state, which stalled partly because of competing messaging lawmakers received from makers of products that use leaves of the kratom plant and those using newer, more potent derivatives.\nKey context: The faction of the industry making natural leaf-based products, which previously had been the target of suspicion from drug enforcement and public health officials, is seizing on the opportunity to make the case that natural leaf products should be legitimized through regulations and 7-OH cordoned off as a separate, more dangerous product. Proponents of the products say they can be a substitute for opioid pain relievers.\nThe 7-OH manufacturers, meanwhile, dispute claims that their products are opioids or resemble heroin. They see themselves as offering newer, better products that entice customers and leave legacy brands behind.\n\nWHAT WE'RE READING\n\nPOLITICO’s Carmen Paun reports on the Senate Appropriations Committee’s approval of a 2026 funding bill for HHS.\nThe Associated Press’ Mike Stobbe reports on the fall in U.S. childhood vaccination rates last year as the share of children with exemptions rose to an all-time high.\nBioPharma Dive’s Delilah Alvarado reports on Moderna laying off 10 percent of its workforce as part of an effort to cut expenses amid slowing vaccine sales.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nFollow us on X\n\nDan Goldberg @dancgoldberg\nChelsea Cirruzzo @chelseacirruzzo\nLauren Gardner @Gardner_LM\nSophie Gardner @sophie_gardnerj\nKelly Hooper @kelhoops\nRobert King @rking_19\nDavid Lim @davidalim\nAlice Miranda Ollstein @aliceollstein\nCarmen Paun @carmenpaun\nDaniel Payne @_daniel_payne\nRuth Reader @RuthReader\nErin Schumaker @erinlschumaker\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}