{
  "file_name": "2025-08-01_100644_email.html",
  "date": "2025-08-01",
  "subject_line": "Liberation Day, Part III",
  "playbook_type": "national_playbook",
  "authors": [
    "Adam Wren",
    "Dasha Burns",
    "Eli Okun",
    "Bethany Irvine",
    "Ali Bianco"
  ],
  "sponsor": "The Vapor Technology Association",
  "text": "Aug 01, 2025\nView in browser\n\n By Adam Wren with Dasha Burns\n\n Presented by \n\nWith help from Eli Okun, Bethany Irvine and Ali Bianco\nOn today’s Playbook Podcast, Adam Wren and Zack Stanton talk through President Donald Trump’s latest round of tariff threats, how Laura Loomer wields influence in the administration and the latest escalation in the redistricting arms race.\n\nGood morning. I’m Adam Wren. It’s Aug. 1. Where has the year gone? Get in touch.\nIn today’s Playbook …\n— Far-right activist Laura Loomer has become President Donald Trump’s MAGA loyalty enforcer from outside the administration — and sees “hundreds” left to purge.\n— An exclusive new poll out this morning shows Roy Cooper leading Michael Whatley by 6 points in the North Carolina Senate race.\n— Sarah McBride says voters feel like Democrats have “been assholes to them,” she tells Playbook’s Dasha Burns. … And new polling from Third Way outlines Dems’ most effective lines of attack on the GOP megalaw.\n\nDRIVING THE DAY\n\nPresident Donald Trump's faith in tariffs has been reinforced by the economy, which has been chugging along despite the tariff-sized dent. | Jim Watson/AFP via Getty Images\n\nLIBERATION DAY, PART III: For months, today’s date was circled on calendars in national capitals throughout the world as the deadline when President Donald Trump’s threat of major new tariffs would be enacted. Then, in an executive order last night, Trump made an eleventh-hour change, giving nearly 70 U.S. trading partners seven days to negotiate deals or face new tariffs ranging from 15 to 41 percent.\nTACO Trump? Not quite.\nThis time seems different than the past deadlines, as reflected in three different arenas: the markets, the campaign trail and the White House.\nTHE MARKETS: When the first “Liberation Day” tariff threat came in the spring, the U.S. stock and bond markets were badly hit, and their huge losses led Trump to back down.\nNot so this time.\n“Markets are all about expectations, so maybe all of this is already baked in,” Scott Lincicome, the vice president of general economics at the libertarian-minded Cato Institute, told Playbook last night. “The real reason why Liberation Day was so chaotic and catastrophic for markets is that none of the institutional investor guys were expecting Liberation Day.”\nNow, they are.\nThe markets’ ho-hum expectations leading up to today have buoyed Trump. His “faith in tariffs has been reinforced by the economy, which has been chugging along despite the tariff-sized dent,” POLITICO international trade reporter Daniel Desrochers writes into Playbook. “Unemployment has remained relatively low, inflation hasn’t spiked dramatically and the tariffs have already brought in more than $136 billion in revenue, according to data kept by Customs and Border Protection.”\nOr, as Sen. John Kennedy (R-La.) — who’s not particularly fond of tariffs — put it yesterday: “So far, so good. The economy in America is fine.”\nThat certainty on Trump’s part, in turn, stokes certainty within the markets: They have a sense of what to expect, and the risk is more manageable. And his sweeping executive order yesterday “means that tariff rates appear settled for the foreseeable future,” Daniel tells us — which will allow Trump “to keep his wish of setting up a tariff firewall on imports to the U.S., in the hopes of boosting domestic production.”\nOne important caveat: The newly announced rates will be a major test for Trump’s economic theory. And what could make this test different is that so far, most of the inflationary pressure has been borne by businesses rather than consumers, and has come while the rate has been stuck at 10 percent for most imports — a level businesses have said is manageable.\n“Now, those same businesses will have to figure out how much of the higher rates they can swallow before passing them on to customers, particularly as the inventory they stockpiled in the beginning of the year starts to grow thin,” Daniel tells us.\n\nAs for now, though, the politics of the issue don’t seem particularly bad for Republicans. Which leads us to …\nTHE CAMPAIGN TRAIL: The tariff issue is already filtering into midterm races.\nFirst in Playbook — The tariff litmus test: In a new seven-figure statewide ad buy, businessman Nate Morris — who is running against Rep. Andy Barr and former Kentucky AG Daniel Cameron for the Republican nomination to succeed retiring Sen. Mitch McConnell — boasts support for Trump’s tariffs as a sign of both his MAGA credentials and blue-collar bona fides.\n“Mitch McConnell and his boys, Andy Barr and Daniel Cameron, they don’t know hard times,” Morris says in the ad, which Playbook is told was inspired by former pro wrestler Dusty Rhodes. “Hard times is a man working a job for 30 years, they give him a watch, kick him in the butt and say globalism took your job. That’s hard times. And it’s why I back Trump’s tariffs 100 percent, to bring back American jobs. … I’m a Trump guy, not a McConnell boy.” Watch the 30-second spot\nThe view from a swing state: In battleground Michigan, the calculus may be a bit more complicated. This week, Playbook spoke with former Rep. Mike Rogers, who is seeking the GOP nomination for Senate. Michigan — a famously manufacturing-heavy state with a massive amount of trade with neighboring Canada — is highly exposed to economic fluctuations from tariffs.\nRogers hopes the ups and downs of the trade war will be smoothed out by the end of the year in order to avoid becoming a campaign issue Democrats can wield against him.\nAs for the tariffs’ economic impact, “obviously, certainty is always better,” Rogers tells Playbook. “The shoe is going to pinch every once in a while, and the good news about the White House is when there's a case that comes up that doesn't seem fair or rational, we even call, and they’re at least open to a conversation, which is great.”\n\nA message from The Vapor Technology Association:\nThe U.S. vaping industry and tens of thousands of small businesses are at risk. A Biden-era task force and rogue FDA and CBP bureaucrats are blocking all flavored vapes from entering the U.S. These bureaucrats are undermining President Trump’s promises to protect our children from illicit vapes and save flavored vaping.\n\n President Trump: Tell the FDA and CBP to stop banning vapes – vaping voters and small businesses are counting on you.\n\nLearn more.\n\nTHE WHITE HOUSE: Spirits are relatively high throughout the West Wing. “Everyone feels good about [the] EU deal and progress on China,” a senior White House official tells Dasha. “We’re moving the ball forward. We’re proving that the American market matters more than anything else. … And that is super important and useful as we progress through resetting global trade.”\nOne thing that could sour their mood: Yesterday, an 11-judge federal appeals court panel sharply questioned Trump’s “authority to impose sweeping tariffs on foreign trading partners under an unprecedented use of emergency powers,” POLITICO’s Kyle Cheney and Doug Palmer report. The suit is expected to end up at the Supreme Court.\nAnd another thing: The July jobs report drops today at 8:30 a.m. It’s “expected to show a net gain of 115,000 jobs, which would mark a considerable downshift from June’s 147,000 jobs,” CNN’s Alicia Wallace reports. “The unemployment rate is expected to tick up to 4.2% from 4.1%.”\nA big-picture observation: Yesterday’s tranche of new tariffs came out via a much more orderly and well-honed process than the White House went through at the original “Liberation Day” earlier this year. In that way, “Liberation Day, Part III” is sort of the quieter, straight-to-VHS sequel to its April predecessor.\nBut in other ways, as August begins, the Trump White House has maintained something of a fly-by-the-seat-of-the-pants quality that defined its earliest days.\nLOOMER LOOMS: In that regard, the ongoing influence of Laura Loomer, the far-right activist, is emblematic of how power can work in both the MAGA universe and in Trump’s Washington.\nFirst in Playbook — The MAGA loyalty enforcer: Even as Trump’s second term White House has been marked by far less personnel drama at the senior staff and Cabinet level than his first, the firings are piling up, your Playbook author reports this morning with POLITICO’s Eli Stokols, Ben Johansen and Myah Ward. Many of those instances came about because of pressure campaigns from Loomer, who has emerged as something of a MAGA loyalty enforcer from outside the administration.\nLoomer sees “hundreds” left to purge: Loomer “is now fielding tips from administration officials about colleagues they want exiled amid what she called ‘a serious vetting crisis,’ predicting there are ‘hundreds’ more she expects to purge,” we report.\n“A form of therapy”: “I’m happy to take people’s tips about disloyal appointees, disloyal staffers and Biden holdovers,” Loomer told POLITICO. “And I guess you could say that my tip line has come to serve as a form of therapy for Trump administration officials who want to expose their colleagues who should not be in the positions that they’re in.”\nAnd she’s everywhere: “I have people in the West Wing,” Loomer said, adding that she gets along with White House chief of staff Susie Wiles “very well.” “I have people in pretty much every single agency within the federal government like me, every main agency coming to me with concerns.”\n\nA message from The Vapor Technology Association:\nPresident Trump understands what voters want – flavored vapes to quit smoking.\n\n That’s why VTA supports a crackdown on illicit vapes targeting youth while encouraging him to keep his promise to save flavored vaping.\n\n President Trump: Stop bureaucrats blocking Americans’ freedom to vape and killing small businesses.\n\nLearn more.\n\nTHE CAMPAIGN\nFIRST IN PLAYBOOK — Poll position: A new Emerson College poll shows former North Carolina Democratic Gov. Roy Cooper with an early six-point lead in the Tar Heel State Senate race, POLITICO’s Elena Schneider scoops this morning. The first public poll of the closely watched race shows Cooper at 47 percent, while former RNC Chair Michael Whatley sits at 41 percent. Another 12 percent are undecided.\nWhatley’s opportunity and challenge: “Cooper, who finished his second term in 2024, starts the open race to replace [retiring GOP Sen. Thom] Tillis with stronger name recognition and favorability than Whatley, a first-time candidate,” Elena writes. “By contrast, nearly two-thirds of voters do not know or are unsure of Whatley and another 17 percent view him favorably — capturing his challenge to quickly define himself with an electorate that isn’t familiar with him.”\nMONEY TALKS: The mid-year FEC reports for PACs were due yesterday, and we’re sorting through some of the notable numbers.\n\nThe Musk factor: Elon Musk may have exited the Trump administration, but recent high-dollar donations make it clear the world’s richest man hasn’t left GOP politics altogether. On June 27, the former DOGE chief donated $5 million to MAGA Inc., $5 million to the Congressional Leadership Fund and $5 million to the Senate Leadership Fund, Jessica reports. That was “enough to make him the largest known individual donor to the main House and Senate GOP super PACs so far this year.” The week after the donations, Musk said he would start his own political party.\nMassie attack: The super PAC working to oust Rep. Thomas Massie (R-Ky.) hauled in $2 million “between its launch in late June and the end of the month,” Jessica writes. GOP megadonor Paul Singer gave $1 million, the largest single donation.\nDEEP IN THE HEART: The Texas redistricting rodeo continues today as the state’s House of Representatives gathers in Austin at 11 a.m. ET for the first public hearing on the GOP’s proposed congressional map. Follow along on C-SPAN\nWhat’s the Dems’ strategy to block it? Speaking in Austin yesterday, House Minority Leader Hakeem Jeffries declined to say, The Austin American-Statesman’s John Moritz reports. “We’re going to do everything possible to support the Texas legislators,” Jeffries said. “All options should be on the table to protect the people of Texas.” Texas Dems are considering an organized quorum-breaking trip before the special session ends on Aug. 19.\nGOLD IN THEM THERE HILLS: In response to the GOP’s Texas gambit, California Gov. Gavin Newsom announced yesterday that he’s looking to call his own special election in November to ask voters to approve new congressional maps to create new Democratic seats, POLITICO’s Jeremy White reports. It would be a massive undertaking. “Newsom would be counting on Democrats’ anti-Trump message overcoming voters’ reluctance to return power to politicians for an explicitly partisan exercise,” and Democrats “would need to raise monumental sums on a tight timeline so they could inform and turn out voters.”\n\nPlaybook, the unofficial guide to official Washington, isn’t just a newsletter — it’s a podcast, too. With new co-hosts who bring unmatched Trump world reporting and analysis, The Playbook Podcast dives deeper into the power plays shaping Washington. Get the insider edge—start listening now.\n\nTHE WILDERNESS\nWHILE YOU WERE SLEEPING: Former VP Kamala Harris appeared on Stephen Colbert’s “Late Show” for her first interview since losing the 2024 election. One surprise came in her answer to a question about her decision not to run for California governor — the type of setup that often invites a gauzy answer about spending time with family or some such.\nNot so for Harris: “Recently, I made the decision that, for now, I don’t want to go back in the system. I think it’s broken,” she said. “I always believed that as fragile as our democracy is, our systems would be strong enough to defend our most fundamental principles and I think right now, they’re not as strong as they need to be.” Watch on YouTube\nAnd then came something that sounded far more conventional: “I want to travel the country, I want to listen to people, I want to talk to people,” Harris said. “And I don’t want it to be transactional, where I’m asking for their vote.” (One might call this a “listening tour.”)\nSNEAK PEEK — A blunt analysis: Rep. Sarah McBride (D-Del.) has a diagnosis for what’s been ailing the Democratic Party: “I think voters feel like Democrats have sort of been assholes to them,” McBride tells Dasha Burns in an interview for this week’s episode of “The Conversation.”\nMcBride’s “two questions”: “I do think that a voter asks two questions when they're considering who to vote for,” McBride continued. “The first question is, does this candidate, does this party like me? And by extension, do they respect me? If you can’t answer that first question to a voter’s satisfaction, they won’t even get to the second question, which is, what does this party think? What does this candidate think?” Watch the clip … More from POLITICO's Aaron Pellish … Subscribe to “The Conversation” on YouTube, Apple Podcasts or Spotify \nFIRST IN PLAYBOOK — Dems’ recess messaging push: A new polling memo from Third Way outlines a plan of attack for Democrats as they fan out across the country during congressional recess and seek to define the GOP megalaw ahead of the 2026 campaign, Playbook’s Ali Bianco scoops.\nThree recommendations: “Right now, opposition to the One Big Beautiful Bill Act is driving intense opposition and dwarfing other issues,” the memo reads. In an an online survey of 2,000 registered voters conducted by Third Way and GBAO, they tested 16 lines of attack against the legislation and found that three stood out as the most effective: (1) criticizing Republicans for cutting “$1 trillion from Medicaid;” (2) focusing on the law’s impact on the national debt; and (3) homing in on the impact of the Medicaid cuts on rural hospitals. Read the full memo\nExpect to hear similar criticisms from Sen. Bernie Sanders (I-Vt.), whose “Fighting Oligarchy” tour continues with visits to West Virginia and North Carolina next weekend. He’ll have a “particular focus on how Medicaid cuts will impact rural hospitals and working class families,” Sanders’ comms director Anna Bahr wrote on X.\nBIDEN BITES BACK: In a speech last night to the National Bar Association in Chicago, former President Joe Biden expressed alarm at attacks on the rule of law and threats to civil rights under the Trump administration, POLITICO's Shia Kapos reports. “You can’t sugarcoat it. These are dark days,” Biden said. “My friends, we need to face the hard truth of this administration, and that it has been to ease all the gains we’ve made in my administration. To erase history rather than making it. To erase fairness, equality, to erase justice itself.”\n\nA message from The Vapor Technology Association:\n\nBEST OF THE REST\nMIDDLE EAST LATEST: Special envoy Steve Witkoff and U.S. Ambassador to Israel Mike Huckabee are in Gaza today to inspect food distribution sites and secure a plan to deliver aid. This morning, Witkoff toured an aid distribution site as the conditions in Gaza have sparked global concern, CNN’s Ibrahim Dahman reports.\nThe Gaza visit comes a day after Witkoff held what the White House characterized as a “very productive” meeting with Israeli PM Benjamin Netanyahu to discuss Gaza’s starvation crisis,per FT’s Neri Zilber and Anne-Sylvaine Chassany.\nUp next for Witkoff: The Kremlin. Trump announced yesterday that Witkoff will travel to Russia after completing his Middle East trip, though details are yet to be announced.\nRENOVATION STATION: Trump intends to build a $200 million, 90,000-square-foot ballroom in the White House’s East Wing, “effecting one of the biggest changes to ‘the People’s House’ in a century,” WaPo’s Jonathan Edwards reports. The new White House State Ballroom “will seat 650 people, more than triple the capacity of the East Room,” and “seeks to solve a problem White House press secretary Karoline Leavitt said has frustrated the president and his predecessors: a lack of space for major functions that requires ‘a large and unsightly tent’ about 300 feet from the main building entrance.” Construction is set to start in September.\nRAISE THE BAR: The D.C. Bar’s disciplinary arm recommended yesterday that Trump regulatory czar Jeffrey Clark lose his law license for his role in trying to overturn the results of the 2020 election, POLITICO’s Kyle Cheney reports. The recommendation will result in an “automatic suspension for Clark from practicing law, unless he convinces the court within 30 days to intervene and block that immediate punishment.” The decision now heads to the D.C. Court of Appeals.\nEPSTEIN ESCAPE HATCH: “Trump’s Options for Dousing the Epstein Fire,” by Ankush Khardori in his latest Rules of Law column for POLITICO Magazine: “There are no good solutions — but some are worse than others.”\nTHE WEEKEND AHEAD\nTV TONIGHT — PBS’ “Washington Week”: Leigh Ann Caldwell, Andrea Mitchell, Nancy Youssef and Alexander Ward.\nSUNDAY SO FAR …\nPOLITICO “The Conversation with Dasha Burns”: Rep. Sarah McBride (D-Del.).\nNBC “Meet the Press”: Kevin Hassett … Sen. Alex Padilla (D-Calif.). Panel: Yamiche Alcindor, Stephen Hayes, Susan Glasser and Symone Sanders-Townsend.\nCBS “Face the Nation”: New Mexico Gov. Michelle Lujan Grisham … Rep. Don Bacon (R-Neb.) … Rep. Ro Khanna (D-Calif.) … CMS Administrator Mehmet Oz.\nFOX “Fox News Sunday”: Kevin Hassett … Johnnie Moore … Tim Lilley. Panel: Guy Benson, Dan Koh, Susan Page and Tiffany Smiley.\nCNN “State of the Union”: EPA Administrator Lee Zeldin. Panel: Faiz Shakir, Kate Bedingfield, Jonah Goldberg and Brad Todd.\nFox News “Sunday Morning Futures”: Stephen Miller … Rep. Lindsey Graham (R-S.C.). Panel: Gregg Jarrett, Lee Smith and Mark Levin.\nMSNBC “The Weekend”: Rep. Adriano Espaillat (D-N.Y.).\nNewsNation “The Hill Sunday”: DNC Chair Ken Martin. Panel: Burgess Everett, Molly Ball, Paul Kane and Julia Manchester.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nTALK OF THE TOWN\n\nMike Donilon reportedly told congressional investigators he was paid $4 million for his work on Joe Biden’s 2024 campaign — and would have made an additional $4 million if Biden had won in November.\nJen Easterly, a Biden admin alum, said she had an appointment to a position at her alma mater West Point rescinded after a pressure campaign from Laura Loomer. She called it a “casualty of casually manufactured outrage.”\nMEDIAWATCH — WaPo is facing a slew of high-profile departures this week, including Hank Stuever, Ann Hornaday, Craig Timberg and Joel Achenbach, per NYT’s Ben Mullin: “Source says it feels like the Hunger Games: ‘My inbox has literally dozens of announcements of departures or newsroom wide goodbye notes.’”\nPLAYBOOK METRO SECTION — “Smithsonian removes Trump from impeachment exhibit in American history museum,” by WaPo’s Janay Kingsberry: “A person familiar with the exhibit plans, who was not authorized to discuss them publicly, said the change came about as part of a content review that the Smithsonian agreed to undertake following pressure from the White House to remove an art museum director. After this story published, the Smithsonian said in a statement that ‘a future and updated exhibit will include all impeachments.’”\nOUT AND ABOUT — The Allbritton Journalism Institute and LSG hosted a book party for Josh Dawsey, Allbritton Journalism Institute instructor and co-author of “2024: How Trump Retook the White House and the Democrats Lost America” ($22.38). SPOTTED: Andie Coller, Ben Jenkins, Arielle and Joel Elliott, Jasmine Wright, Meridith McGraw, Kadia Goba, Sudeep Reddy, Tara Rush, Jackeline Stewart-Hawkins, Erin Billings, Kevin Madden, Annie Karni, Lulu Garcia-Navarro, Patrick Steel, Alex Schriver, Christina Ruffini, Justin Peligri, Cory Combs, Jake Wilkins, Lauren French, Kathy Baird, Will Kinzel, Chris Golden, Brad Bosserman, Jacob Gardenswartz, Chanse Jones, Peter Nonis, Ryann DuRant, Michael Moroney, Francesca Chambers, Brian and Jessica Bartlett, Maggie Severns, Cesca Antonelli, Jeff Zeleny and DJ Judd.\nTRANSITION — Julia Reese is now federal government affairs principal at Nucor Corporation. She previously was senior legislative assistant to Rep. Ashley Hinson (R-Iowa). \nENGAGED — Christopher Mika, national security adviser for Rep. Darrell Issa (R-Calif.), and Sonja Packard got engaged on the Speaker’s Balcony on Tuesday.\nHAPPY BIRTHDAY: Rep. Josh Harder (D-Calif.) … Howard Kurtz … Ed Gillespie of AT&T … Mikayla DeMasi … POLITICO’s Hannah Northey, Chris Buddie and Jackie Ramsay … Toni Atkins … CEI’s Travis Burk … Clare Foran … Josie McSpadden of the Gates Foundation … Karen Marangi … Drew Littman of Brownstein Hyatt Farber Schreck … Roy Loewenstein … Philip Goldberg … Sheila Katz … Dana Zureikat Daoud of the Jordanian Embassy … Ogilvy’s Jordan Lubowitz … Benji Englander … Macaulay Porter of the VA … Christina Gungoll Lepore of Oklahoma Gov. Kevin Stitt’s D.C. office … Hayden Center’s Larry Pfeiffer … former Reps. Rick Boucher (D-Va.), Sue Myrick (R-N.C.), Van Taylor (R-Texas) and Madison Cawthorn (R-N.C.) (3-0) … Martin Hamburger … former Sen. Al D’Amato (R-N.Y.) … Dan Shapiro … Graeme Trayner of FGS Global … Cappy McGarr … BGR Group’s Ansley Haulbrook … American Conservation Coalition’s Amy Mastrine … Angela Coats of The Morning Group … Fox News’ Jasmine Baehr … Scott Evertz … Stars and Stripes’ Lara Korte\nDid someone forward this email to you? Sign up here.\nSend Playbookers tips to playbook@politico.com or text us on Signal here. Playbook couldn’t happen without our editor Zack Stanton, deputy editor Garrett Ross and Playbook Podcast producer Callan Tansill-Suddath.\nCorrection: Yesterday’s Playbook misspelled Aaron Boxerman’s name.\n\nA message from The Vapor Technology Association:\nNearly 500,000 Americans die annually from smoking cigarettes. 67% of Trump voters say government should promote vapes to help Americans quit smoking – and all Americans need President Trump to save flavored vaping now.\n\n VTA stands with President Trump in cracking down on the bad actors who sell vapes targeting youth. However, a Biden-era FDA task force is out of control – wasting CBP resources on vapes, rather than human traffickers – banning vapes from the market. The vape blockade is a de facto ban on flavored vapor products nationwide, which is already shutting down small businesses.\n\n It’s time to protect this multibillion-dollar American industry and stand up for American adults’ freedom to vape.\n\n President Trump, stop the bureaucrats from undermining your promise to save flavored vaping. Don't let Biden’s task force fulfill his plan to destroy legitimate businesses and hurt American consumers. American vapers are counting on you.\n\nLearn more.\n\nFollow us on X\n\nJack Blanchard @Jack_Blanchard_\nDasha Burns @DashaBurns\nAdam Wren @adamwren\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Canada Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}