{
  "file_name": "2025-08-01_160251_email.html",
  "date": "2025-08-01",
  "subject_line": "Trump’s favorite drug price approach is back",
  "playbook_type": "politico_pulse",
  "authors": [
    "Lauren Gardner",
    "David Lim"
  ],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Lauren Gardner and David Lim\n\nDriving the Day\n\nPresident Donald Trump is demanding that U.S. pharmaceutical companies adhere to most-favored-nation drug pricing. | John McDonnell/AP Photo\n\nMFN FALLOUT — President Donald Trump surprised pharma CEOs on Thursday with letters demanding they acquiesce to his most-favored drug-pricing scheme (see what we did there?) by the end of September, setting up a late-summer lobbying fight for the industry.\nThe White House said drugmakers’ proposals for implementing his May executive order directing federal agencies to embrace most-favored-nation pricing — tying what the government pays for some medicines to cheaper prices fetched abroad — “have fallen short,” your morning hosts report. If companies don’t meet several demands by Sept. 29, Trump wrote, “we will deploy every tool in our arsenal to protect American families from continued abusive drug pricing practices.”\nGreatest hits: The industry’s two major trade groups gave strikingly similar responses to Trump’s Truth Social posts — both slammed the idea of “importing … foreign price controls” at a time when less-than-friendly nations, particularly China, try to usurp the U.S.’s dominance in drug development.\n“To reduce price differentials with other countries, policymakers should rein in health care middlemen driving up costs for Americans and get foreign countries to pay their fair share for innovative medicines,” PhRMA spokesperson Alex Schriver said in a statement.\nA spokesperson for the Biotechnology Innovation Organization, which represents startup and established biotech firms, echoed the pharmacy benefit manager dig and also called for the administration to target entities that take advantage of a drug program for low-income patients.\n“The answer is to simplify the system,” the spokesperson said in an email.\nPlaudits elsewhere: Unsurprisingly, the PBM lobby applauded the president’s move.\n“Drug companies alone set and raise drug prices and can lower the list prices at any time,” the Pharmaceutical Care Management Association said in a statement.\nTrump has eyed most-favored-nation pricing since his first term and has repeatedly seized on other developed countries’ lower drug costs as an unfair consequence of American dominance over drug development.\n“MFN will be achieved,” a person familiar with the administration's health care priorities, granted anonymity to discuss the effort candidly, said via text. “The administration is very serious about this.”\nIT’S FRIDAY. WELCOME BACK TO PRESCRIPTION PULSE. What a year this week has been.\nSend tips to David Lim (dlim@politico.com, @davidalim or davidalim.49 on Signal) and Lauren Gardner (lgardner@politico.com, @Gardner_LM or gardnerlm.01 on Signal).\nMORNING MONEY: CAPITAL RISK — POLITICO’s flagship financial newsletter has a new Friday edition built for the economic era we’re living in: one shaped by political volatility, disruption and a wave of policy decisions with sector-wide consequences. Each week, Morning Money: Capital Risk brings sharp reporting and analysis on how political risk is moving markets and how investors are adapting. Want to know how health care regulation, tariffs, or court rulings could ripple through the economy? Start here.\n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nEye on the FDA\n\nFDA Commissioner Marty Makary, left, and HHS Secretary Robert F. Kennedy Jr. sent warning letters to companies for illegally marketing products containing 7-OH. | Saul Loeb/AFP via Getty Images\n\nOPIOID RISKS — The FDA on Thursday ordered opioid manufacturers to update their labels to emphasize the risks of long-term use — a major issue for both Commissioner Marty Makary and HHS Secretary Robert F. Kennedy Jr.\nThe drug safety communication directs manufacturers to remove the phrase “extended treatment period” to avoid suggesting that data supports the drugs’ safety and efficacy “over an indefinitely long duration.” It also requires them to highlight on the labels that higher doses bring a greater risk of serious harm, among other clarifications.\nMakary focused on the medical community’s role in overprescribing opioids — and recounted his own actions overlooking the painkillers’ risks — in his 2024 book “Blind Spots.”\n“Today’s FDA action is a long-overdue step toward restoring honesty, accountability, and transparency to a system that betrayed the American people,” Kennedy, who’s in recovery from a heroin addiction, said in a statement.\nWhat’s next: Drugmakers have 30 days to submit their updates to the agency.\nPRASAD OUT — ICYMI, your morning hosts scooped Wednesday night that President Donald Trump overruled his top health officials and ordered top vaccine regulator Vinay Prasad’s ouster from the FDA.\nAmid all the commotion, one detail from the story should stand out to newsletter readers. “The Trump administration is weighing splitting the Center for Biologics Evaluation and Research into two bodies: one focused on vaccine regulation and one on therapeutics, according to three of the people familiar with the discussions.”\n\nCoronavirus\n\nPOLL: CONFUSION OVER COVID SHOTS — A new survey by KFF shows that most Americans are confused about whether the federal government recommends Covid-19 vaccines for healthy children — and that support for Health Secretary Robert F. Kennedy Jr.’s policy changes splits largely along party lines.\nPolling released today found that 47 percent of the public either doesn’t “know enough to say” whether Kennedy has shifted U.S. vaccine policy or doesn’t think he has. Most adults surveyed — 59 percent — said they will either “definitely not” or “probably not” get the Covid shot this fall, with 6 in 10 Republicans pledging the former.\nOf those who plan to get vaccinated, two-thirds said they were worried about availability, and 62 percent said they’re concerned about insurance coverage amid changes to how the federal government recommends who should receive which shots.\n\nAROUND THE AGENCIES\n\nHRSA FLOATS 340B REBATE PILOT — The Trump administration announced an application process Thursday for a 340B rebate model pilot program that could allow drugmakers to test a rebate program for a select group of drugs.\nSeveral drugmakers have attempted to set up rebate programs unilaterally in an attempt to cut down on what they say is abuse of a program that allows hospitals and other covered entities that serve low-income patients to buy medicines at a discount. But pharmaceutical companies have faced losses in court when challenged over the practice.\nNow, the Health Resources and Services Administration will explore a pilot program starting in 2026 that would be limited to drugs on the CMS Medicare drug price negotiation list.\nAmerica’s Essential Hospitals, which represents safety-net hospitals that use the 340B program, argued the pilot program would require paperwork and bureaucracy to administer.\n“Drug manufacturers will be the only beneficiaries of this program, while hospitals will have to contend with a whole new set of administrative burdens,” AEH CEO Bruce Siegel said in a statement.\nPhRMA spokesperson Alex Schriver called the pilot a “positive first step.”\n“We believe it should cover all medicines and address broader program integrity concerns,” Schriver said.\n\nIn Congress\n\nOMUFA MARCHES FORWARD — The Senate HELP Committee unanimously voted on Wednesday to advance legislation out of committee that would reauthorize the FDA’s over-the-counter monograph drug user fee program.\nThe House and Senate each have versions of the bill ready for floor action, but it is not clear when the legislation will advance before the Sept. 30 deadline.\n\nPharma Moves\n\nTara Rabin has joined Context Strategies as a senior adviser. She previously worked at the FDA as a media relations director.\nMike Doustdar will become Novo Nordisk’s president and CEO on Aug. 7. He’s currently the drugmaker’s executive vice president of international operations.\n\nDocument Drawer\n\nThe FDA Center for Tobacco Products’ scientific advisory committee will meet on Oct. 7 to consider the renewal of modified risk granted orders issued to Philip Morris Products S.A. for five products.\nCMS published its fiscal 2026 final rule for the hospital inpatient prospective payment system for acute care hospitals.\n\nWHAT WE'RE READING\n\nModerna plans to lay off 10 percent of its employees amid an effort to save money, BioPharma Dive’s Delilah Alvarado reports.\nMerck will cut roughly 8 percent of its workforce, Endpoints News’ Kyle LaHucik reports.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nFollow us on X\n\nDavid Lim @davidalim\nLauren Gardner @Gardner_LM\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}