{
  "file_name": "2025-08-01_195511_email.html",
  "date": "2025-08-01",
  "subject_line": "She wants Zohran’s seat",
  "playbook_type": "new_york_playbook",
  "authors": [
    "Jason Beeferman"
  ],
  "sponsor": null,
  "text": "Aug 01, 2025\nView in browser\n\n By Jason Beeferman\n\nWith help from Amira McKee\n\nMary Jobaida, who hopes to fill Zohran Mamdani's Assembly seat, canvasses with voters at Queensbridge Houses in Long Island City. | Team Mary Jobaida For Assembly.\n\nMary Jobaida is a Bangladeshi-born, Muslim mother of three who wants to be the newest member of the state Legislature.\nDemocratic mayoral nominee Zohran Mamdani hasn’t been elected mayor yet. But if — or when — he becomes Gracie Mansion’s newest resident, his Assembly seat in the left-leaning “Peoples’ Republic of Astoria” will become vacant — and Jobaida wants to fill it.\nJobaida touts her membership with the Democratic Socialists of America and says she wants to stand up to ICE, make CUNY, SUNY, pre-k and public transportation free, and even decriminalize the theft of food by hungry New Yorkers.\n“It's actually a waste of money, waste of resources and hurtful to people,” she said, noting that “it’s not practical” to arrest someone for stealing nourishment.\nRunning for the seat, she said, was arranged by God: “I was not going to run against Zohran Mamdani, for sure, because we need progressive elected officials here, but I say it’s like it's planned by God and accepted by people,” she said, recounting how the district's lines were redrawn two years ago to include her residence.\nThe Queens Democratic Party may have other ideas. If Mamdani — who currently leads mayoral polls — is sworn in as mayor on Jan. 1, a special election would have to be called by Gov. Kathy Hochul by Jan. 11 and would likely take place in mid- to late-February.\nThat would mean the Democratic, Republican and potentially Working Families Party organizations could select their own candidate to run in a special. As City & State reported, the Queens Democrats might jump at the opportunity to replace Mamdani with a more moderate candidate.\nJobaida, who has already started contacting donors, canvassing and gathering volunteers for her bid, is one of the first candidates to emerge amid a wave of leftist energy that’s engulfed the city since Mamdani’s win. She has a website and told Playbook she will officially launch her campaign later this month.\nLast month, Assemblymember Jessica González-Rojas announced she would primary state Sen. Jessica Ramos, an Andrew Cuomo foe turned ally. And Mamdani organizer Mahtab Khan registered Monday to run against Queens Assemblymember David Weprin.\nOne Democratic Party insider told Playbook that discussions around filling Mamdani’s seat aren’t expected to occur in earnest until the SOMOS conference in Puerto Rico — where politicos, lobbyists and policymakers fly to the Caribbean to rub elbows and drink rum in the days immediately after the general election.\nThe Working Families Party did not respond to repeated requests for comment on whether it would pick a candidate — like Jobaida — to run for the seat on its ballot line. The co-chair of the city’s Democratic Socialists of America chapter told Playbook the party will be hosting “several forums this fall to hear from interested candidates” before its membership votes on whom it wants to endorse.\nAnd Mamdani and Jobaida haven’t spoken yet, though Jobaida plans to speak with him “very soon.”\nJobaida is about 45 years old. She was born in a rural village in Bangladesh that never recorded her birthdate and arrived to this country shortly after 9/11 with a “pretty messed-up education from Bangladesh,” she said.\nShe attended community college before enrolling in NYU on a scholarship. She got a start in political organizing in 2007 for Barack Obama’s presidential campaign and then worked on Bill Thompson’s mayoral bid. She has taught kindergarten as a teacher in public school classrooms. She also handled constituent services for Jessica Ramos’ office (though she’s not sure if she’ll vote for her former boss yet).\nIn 2020, Jobaida mounted a primary challenge against longtime incumbent Kathy Nolan in Queens’ 37th Assembly District and lost by just 1,500 votes. After Mamdani’s primary win, Jobaida said she received calls and visits from community leaders, telling her, “You cannot sit quiet; you have to run for this seat.”\n“I believe I'm going to win this special election,” Jobaida told Playbook. “If it is special election, it's sealed. I believe it's going to be a piece of cake.”\nThough she believes the country has deep flaws with its criminal justice system and its treatment of the poor, she has immense gratitude for the nation that welcomed her with open arms.\n“We are passing a very difficult moment as a country, as a community,” Jobaida said, referencing the recent shooting of a border patrol officer and border czar Tom Homan’s promise to “flood the zone” with ICE agents in its wake.\n“Another way of saying it is like labor pain is harder before the childbirth,” she said. “We are going through some very difficult childbirth, labor pain, now, and I'm hopeful that we're going to see a beautiful America soon.” — Jason Beeferman\n\nFrom the Capitol\n\nMayor Eric Adams announced that the city broke multiple records for producing and connecting New Yorkers to affordable homes in Fiscal Year 2025. | Ed Reed/Mayoral Photography Office\n\nBEHIND THE NUMBERS: Adams unveiled a whopping figure at his housing presser in Brooklyn today: 426,800.\nThat’s the total number of housing units he says his administration has created, preserved or planned over the course of his tenure.\nFor New Yorkers looking around and wondering why, despite this influx, finding an affordable apartment still feels like competing in the Hunger Games, the operative word is “planned.”\nPlanned units — which include projections from rezonings, some of which aren’t even yet approved — account for nearly half of the total sum.\nThose 197,000 projected homes include the yet-to-be-seen fruits of the mayor’s wide-ranging City of Yes blueprint, neighborhood plans like the yet-to-be-approved rezoning of Long Island City, private rezonings, housing RFPs and other projections.\nMany of these initiatives rely on the whims of the private sector, and development decisions that are based on myriad economic factors outside of the city’s control.\n“Everything is dependent on the real estate market more generally, everything we do,” Kim Darga, deputy commissioner for development at HPD, said during a briefing on the numbers.\n“The mixed-income programs are very dependent also on the greater climate in which we are operating, so what happens with interest rates could drive what happens, what happens with tariffs could impact what happens,” she continued.\nAdams nonetheless touted the 426,800-unit figure as far surpassing previous mayors’ housing totals and crowned his administration as “the most pro-housing” in city history. — Janaki Chadha\nPOT PROBLEMS: Gov. Kathy Hochul said her administration will support cannabis businesses that were incorrectly granted licenses by the state.\n“It’s a major screw-up,” the governor told reporters today. “When I found out about it I was angry to say the least.”\nSome 150 businesses were found to have been granted licenses for storefronts that are illegally located after regulators mistakenly measured how close they were to schools.\nHochul said she explored an executive order to fix the problem, but instead determined a more durable solution is a change in the law. She blamed the prior leadership at the Office of Cannabis Management for the error.\n“I’ll protect these businesses,” she said, while adding that “we need to get the law changed to have a fix.”\nState lawmakers, including influential Democrats such as Senate Finance Chair Liz Krueger, have signaled support for changing the law so the retailers can stay put.\nIn a statement, the Office of Cannabis Management downplayed a report from Spectrum News that found the state knew about the issue for a month before alerting business owners.\n“OCM notified impacted applicants and licensees within days of confirming the issue and identifying the scope of redress opportunities,” the office’s spokesperson, Taylor Randi, said in a statement. She added that its acting director, Felicia Reid, began reviewing dispensaries’ compliance “over the past year.”\nOCM has also scrambled to dispel reports that dispensaries with locations too close to schools will have to close up shop. Randi said that as long as existing businesses properly file their applications for a renewal, they will be allowed to remain open until legislators come back to Albany to fix the problem. — Nick Reisman and Jason Beeferman\n\nFROM THE DELEGATION\n\nReps. Dan Goldman and Jerry Nadler visit a federal building in June. He and 11 other House Democrats are suing the Trump administration to access federal immigrant detainment facilities. | AP\n\nICE’D OUT WITH AN APPOINTMENT: The Trump administration’s response to a lawsuit filed this week by House members barred from inspecting migrant detention facilities has revolved around the Democrats making unannounced visits.\nBut lawmakers in New York have sought access both announced and unannounced. Rep. Dan Goldman requested an appointment in June and was still denied entry to the 10th floor of 26 Federal Plaza in lower Manhattan. Democratic lawmakers have simultaneously cited their authority to conduct oversight without giving advance notice of “detention facilities holding individuals in federal immigration custody.”\nThe 67-page lawsuit filed Wednesday in federal court in Washington includes Goldman and Adriano Espaillat as plaintiffs. It references new DHS guidelines that congressional Democrats say infringe on their authority, including the need for seven days’ notice ahead of a visit.\nIn June, Goldman’s team emailed Immigration and Customs Enforcement staff a request for an appointment nine days before he and Rep. Jerry Nadler came to 26 Federal Plaza amid reports of unsafe conditions. They still were denied access.\nThe reason, according to DHS? The 10th floor of the building is a processing, not a detention, facility.\n“These members of Congress could have just scheduled a tour,” Department of Homeland Security Assistant Secretary Tricia McLaughlin said earlier this week in a statement reacting to the legal complaint by 12 members of Congress.\nMcLaughlin was asked again today on Fox News about the lawsuit and why lawmakers “think that they can just show up announced.”\n“Exactly, this is about political theater,” she said in response. “This isn’t oversight.”\nGoldman, Espaillat, Nadler and Rep. Nydia Velázquez have said migrants are being held for several days there in unsafe conditions as revealed in videos. And they have said they would use every tool to shine light on the treatment of migrants as President Donald Trump escalates his deportation agenda. — Emily Ngo\n\nFROM CITY HALL\n\nErden Arkan leaves federal court in New York after pleading guilty to a charge alleging that he worked with a Turkish government official to funnel illegal campaign contributions to New York City Mayor Eric Adams. | Julia Demaree Nikhinson/AP Photo\n\nLET ’EM OFF EASY: Turkish construction executive Erden Arkan should be sentenced to only one year probation after giving illegal straw donations to Adams’ campaign, his lawyer argued in a memo Friday while denying Arkan had any coordination with the Turkish government.\nArkan, the co-founder of KSK Construction Group, pleaded guilty in January. His lawyer, Jonathan Rosen, said the federal probation office recommended that he receive only a year’s probation and no prison time.\nArkan “did not ‘coordinate’ his decision to use straw donors, the scheme at issue in this case, with the Turkish Consulate or any Turkish official,” despite what prosecutors alleged, Rosen wrote. A Turkish Consulate official invited Arkan to a meeting where he met Adams, but the decision to give illegal straw donations in the names of his employees came only after Arkan tried and failed to solicit donations legally from business contractors, who largely refused to give to Adams.\n“Fearing embarrassment from the now impending fundraiser, Erden pivoted to a new strategy,” Rosen explained.\nRosen also argues that federal prosecutors were using Arkan to get to Adams, and he should be let off now that Adams’ case has been dropped. “The government’s characterization of Eric Adams as a ‘tainted prosecution’ ... calls into question any bona fide federal interest in Mr. Arkan’s continued prosecution in federal court,” he wrote, quoting former Trump administration Department of Justice official Emil Bove’s letter.\nA spokesperson for the Southern District of New York did not immediately respond to a request for comment. — Jeff Coltin\n\nAROUND NEW YORK\n\n— FAKED SIGNATURES: Mayor Eric Adams’ reelection campaign submitted forged petition signatures in an effort to get on the November ballot as an independent candidate. (Gothamist)\n— TALL ORDER: The Department of Education approved close to $750,000 in catering spending at a single Brooklyn restaurant in the fiscal year 2025. (amNewYork)\n— HEALTH CUTS: Federal funding cuts to Medicaid could worsen New York’s nursing shortage. (City & State)\nMissed this morning’s New York Playbook? We forgive you. Read it here.\n\nFollow us on X\n\nJason Beeferman @JasonBeeferman\n\nSubscribe to the POLITICO Playbook family\n\nPlaybook\n  | \n\n Playbook PM\n  | \n\n California Playbook\n  | \n\n Florida Playbook\n  | \n\n Illinois Playbook\n  | \n\n Massachusetts Playbook\n  | \n\n New Jersey Playbook\n  | \n\n New York Playbook\n  | \n\n Brussels Playbook\n  | \n\n London Playbook\n\nView all our political and policy newsletters\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}