{
  "file_name": "2025-08-01_215605_email.html",
  "date": "2025-08-01",
  "subject_line": "Can you ever trust a jobs report again?",
  "playbook_type": "national_playbook",
  "authors": [
    "Ben Johansen",
    "Sophia Cai",
    "Irie Sentner",
    "Email Sophia",
    "Email Irie"
  ],
  "sponsor": "National Taxpayers Union",
  "text": "Aug 01, 2025\nView in browser\n\n By Ben Johansen, Sophia Cai and Irie Sentner\n\n Presented by \n\nWelcome to POLITICO's West Wing Playbook: Remaking Government, your guide to Donald Trump’s unprecedented overhaul of the federal government — the key decisions, the critical characters and the power dynamics that are upending Washington and beyond.\nSend tips | Subscribe | Email Sophia | Email Irie | Email Ben\nThe July jobs report showed that hiring in May and June was far slower than earlier estimates.\nHours after its release this morning, President DONALD TRUMP added someone else to the unemployment rolls: the head of the agency that wrote the report.\n“I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,” Trump wrote in a social media post. “She will be replaced with someone much more competent and qualified.”\nTrump said the Bureau of Labor Statistics under Commissioner ERIKA McENTARFER released overly positive jobs reports during the tail end of former President JOE BIDEN’s term in order to influence the election. He did not provide any evidence to back up his claim.\n“Important numbers like this must be fair and accurate, they can’t be manipulated for political purposes,” Trump wrote.\nLabor Secretary LORI CHAVEZ-DeREMER confirmed on X that McEntarfer was removed from her position, and that deputy commissioner WILLIAM WIATROWSKI will serve as acting commissioner “during the search for a replacement.”\nMcEntarfer, who did not immediately respond to a request for comment, was confirmed by the Senate in 2024 with overwhelming support, including by then-senators Vice President JD VANCE and Secretary of State MARCO RUBIO.\nFormer BLS commissioner and Trump appointee BILL BEACH called McEntarfer’s firing “totally groundless” and said that it sets “a dangerous precedent and undermines the statistical mission of the Bureau.”\nDAN KOH, who served as chief of staff to Labor Secretary MARTY WALSH during the Biden administration, said the move could have rippling effects across the global market — and that BLS appointees have never been political.\nWest Wing Playbook spoke with Beach and Koh separately this afternoon. Their conversations have been edited for length and clarity.\nYou said that this move was “groundless.” Why is that?\nBeach: These numbers are constructed by hundreds of people. They're finalized by about 40 people. These 40 people are very professional people who have served under Republicans and Democrats.\nAnd the commissioner does not see these numbers until the Wednesday prior to the release on Friday. By that time, the numbers are completely set into the IT system. They have been programmed. They are simply reported to the commissioner, so the commissioner can on Thursday brief the president's economic team.\nThe commissioner doesn't have any hand or any influence or any way of even knowing the data until they're completely done. That's true of the unemployment rate. That's true of the jobs numbers.\nAs a consequence, there's very little chance that there could be any influence from the commissioner. I believe it's a groundless claim.\nYou trusted those employees to get you accurate information?\nKoh: It was not because we didn't know the methodology. We understood the nature of sampling and how it worked. Revisions happen all the time, regardless of party.\nSometimes it's not politically expedient at that given moment when job numbers come out, as well as what the revisions are. But that's just the nature of statistics. That's the nature of statistical sampling.\n\nWhy is the political independence of BLS important?\nBeach: These numbers that BLS produces … are used all the time to guide investment decisions, business decisions. Most importantly, by members of Congress and the members of the administration to create policy.\nAs a consequence, they need to be as straightforward and independent of politics as possible. You need to rely on them. You need to say, well, this is the way the world works. We can't see an economy by going out and picking it off the tree. And statisticians are there to create the estimates that literally create the shape of the economy that we can see.\nYou always want independent numbers. Even the suspicion that they're shaped in one direction for one party or another party, or for one political ideological viewpoint, undermines them.\nIt’s like building a good bridge. If the bridge has got shoddy construction or you took a shortcut, you're going to pay the consequences sometime down the road.\nWhat could be the broader implication of this move?\nKoh: The biggest concern, candidly, is, will Trump's replacement for Commissioner McEntarfer be someone who believes in statistical sampling and statistical and sound mathematical methodology? Or will it be just somebody who makes up numbers that are convenient for President Trump?\nIf it's the latter, our entire economy and the basis on which we make so many economic decisions that the market does … will be thrown into question.\nBeach: The main thing it does is undermine the credibility of the statistical system, by inserting into the dialogue the possibility that these numbers might be shaped by the White House.\nI think that's the main danger.\nAs a consequence, we get a less valuable statistical system. And I hope we haven't crossed that particular threshold yet. This is just one firing. But it could set that precedent.\nYou were commissioner toward the tail end of Trump's first administration, and throughout most of Biden's. Did either ever ask you to change the numbers?\nBeach: No, no one ever did that. Even when I announced that 20 million people had lost their job in one month in the April 2020 report, I never got any hint or shade from the White House that, ‘Oh my gosh, we’re going to have to fire Beach because that’s a bad number.’ Everybody believed it.\nMESSAGE US — West Wing Playbook is obsessively covering the Trump administration’s reshaping of the federal government. Are you a federal worker? A DOGE staffer? Have you picked up on any upcoming DOGE moves? We want to hear from you on how this is playing out. Email us at westwingtips@politico.com.\nDid someone forward this email to you? Subscribe! \n\nA fresh chapter for Playbook— same mission, new momentum. Jack Blanchard sets the scene. Dasha Burns brings the inside scoops. Adam Wren takes Washington into the weekend. Playbook delivers must-know reporting with style, clarity, and serious scoops. Subscribe now—and don’t miss a beat.\n\nPOTUS PUZZLER \n\nWhich president was known as the “sly fox” or “little magician”?\n(Answer at bottom.)\n\nAgenda Setting\n\nCLOSING UP SHOP: The Corporation for Public Broadcasting, which funds NPR and PBS, announced today it was shutting down its operations, after Trump rescinded funding for the nonprofit, our AARON PELLISH reports. The CPB, established by Congress decades ago as an independent nonprofit, said it will begin “an orderly wind-down” after Trump signed a measure last month to claw back $1.1 billion in grants for CPB over the next two fiscal years.\n“Despite the extraordinary efforts of millions of Americans who called, wrote, and petitioned Congress to preserve federal funding for CPB, we now face the difficult reality of closing our operations,” CPB President PATRICIA HARRISON said in a statement.\nIF A TREE FALLS: The Agriculture Department will spend more than $100 million for a program that protects state- and private-owned forests, our MARC HELLER reports. USDA said it would support projects in 10 states through the Forest Legacy Program, which helps localities maintain forests through easements and land purchases. The projects, totaling $110 million, cover 177,000 acres in Arkansas, Hawaii, Iowa, Michigan, New York, Oregon and South Carolina.\nThe program had a mixed history with Trump officials. The first Trump administration asked Congress to eliminate funding through annual budget requests, saying the Forest Service should focus on land under its own jurisdiction.\nBut it looks like this administration is taking a new approach, despite looking to eliminate other programs that support state, private and tribal forestry.\n\nCurious how policy pros are staying ahead? Meet our Policy Intelligence Assistant—only available with a POLITICO Pro subscription. It combines POLITICO’s trusted reporting with advanced AI to deliver sharper insights, faster answers, and two powerful new report builders that help you turn intelligence into action. Ready to experience it for yourself? Sign up for a demo and get 30 days free—no strings attached.\n\nThe Oval\n\nSLOW NEWS DAY, HUH? Trump today said he’s mobilizing two nuclear submarines “to be positioned in the appropriate regions” in response to threatening comments made by former Russian President DMITRY MEDVEDEV, our ELI STOKOLS and PAUL McLEARY report. In a post on Truth Social, Trump said he made the move “just in case these foolish and inflammatory statements are more than just that. Words are very important, and can often lead to unintended consequences, I hope this will not be one of those instances.”\nMedvedev on Thursday referenced his nation’s nuclear capabilities in a social media post amid Trump’s latest efforts to increase economic pressure on Russia in hopes of ending the war in Ukraine.\n\nWHO'S IN, WHO'S OUT\n\nBOOTED FROM THE ADULTS' TABLE: Health associations representing a range of public health interests will no longer be included in certain activities with the CDC’s vaccine advisory committee, our LAUREN GARDNER and SOPHIE GARDNER report. The email, obtained by POLITICO, came from acip@cdc.gov to several Advisory Committee on Immunization Practices liaisons, who have in the past represented 30 trade groups for medical specialities, pharmacists and drugmakers.\nIt’s unclear how many associations received the notice. The email attributed the change to a desire to shield the group’s work from conflicts of interest, something HHS Secretary ROBERT F. KENNEDY JR. has leveled against medical groups that promote vaccination. A HHS spokesperson did not respond to a request for comment.\n\nA message from National Taxpayers Union:\nPresident Trump said it before, we’re saying it again. The best policy is zero trade barriers, subsidies, or fines. The Digital Markets Act and Digital Services Act undermine this policy, costing billions and threatening U.S. leadership in AI. Europe’s digital regulations hurt American innovation but shelter EU and Chinese firms. The U.S. must demand fairness. Stop regulatory double standards. Defend American ingenuity in Europe and around the world!\n\nIn the Courts\n\nSLOW DOWN: A federal judge has blocked the Trump administration from rapidly deporting hundreds of thousands of immigrants who were paroled into the United States to flee violence and oppression in their home countries, our KYLE CHENEY, JOSH GERSTEIN and MYAH WARD report.\nU.S. District Judge JIA COBB in a ruling today barred foreigners with immigration parole, typically a short-term status that allows foreigners to live and work in the U.S. legally, from being subjected to a controversial maneuver the administration has adopted in recent months: dismissing immigrants’ pending proceedings in immigration court — only to immediately arrest them outside the courtroom and put them into a sped-up deportation process known as expedited removal.\n\nWhat We're Reading\n\nTrump administration firings mount as staffers’ loyalty is called into question (POLITICO’s Eli Stokols, Adam Wren, Ben Johansen and Myah Ward)\nFederal Reserve’s Kugler to resign, giving Trump earlier-than-expected opening (POLITICO’s Victoria Guida and Michael Stratford)\n‘Clinton Plan’ Emails Were Likely Made by Russian Spies, Declassified Report Shows (NYT’s Charlie Savage and Adam Goldman)\n\nA message from National Taxpayers Union:\n\nPOTUS PUZZLER ANSWER\n\nThe eighth president, MARTIN VAN BUREN, got the monikers because he was a “clever and beguiling politician, proficient at manipulation, persuasion, party organization, and compromise,” according to the National Park Service.\nA CALL OUT! Do you think you have a harder trivia question? Send us your best one about the presidents, with a citation or sourcing, and we may feature it!\nEdited by Dan Goldberg, Jennifer Haberkorn, Isabel Dobrin and Kaitlyn Locke.\n\nA message from National Taxpayers Union:\nEurope benefits from American innovation while treating U.S. tech like a piggy bank. A senior EU official recently said Digital Markets Act reforms are off the table in trade talks. That’s wrong. The President should secure commitments to end discriminatory digital regulations, ensure equal treatment for American firms, pause new EU measures that disproportionately impact U.S. interests, and demand a pledge to stop targeting American businesses in the future. We must stop EU digital protectionism before it becomes a global norm that hurts everyone. The Trump administration was wise to spotlight the issue. Now it’s time to act and get the deal right.\n\nFollow us on X\n\nSophia Cai @SophiaCai99\nIrie Sentner @iriesentner\nBen Johansen @BenJohansen3\n\nFollow us\n\nTo change your alert settings, please log in at\n https://login.politico.com/?redirect=https%3A%2F%2Fwww.politico.com/settings"
}